/*--------------------------------------------------------------------------*/
/*ƒvƒƒWƒFƒNƒg: POPLAR/ANZU_L												*/
/*ƒ‚ƒWƒ…-ƒ‹–¼ : DEFV_TIB.C													*/
/*ì¬Ò–¼	  : –ì£														*/
/*“ú  •t	  : 96.10.12													*/
/*ŠT  —v	  : ƒ^ƒXƒN“o˜^													*/
/*C³—š—ğ	  : ANZU‚©‚ç—¬—p 1996/10/12 T.Nose								*/
/*            : ‹@í•Ê‚ÉˆÚ“® By M.Kotani 97/06/24							*/
/*--------------------------------------------------------------------------*/
/* ‚r‚`‚j‚`‚j‚h^‚g‚h‚m‚n‚j‚hˆÈ~‚Ì‹@í‚ÍAƒ}ƒXƒNƒvƒƒOƒ‰ƒ€•ÏX
** by O.Kimoto 1998/09/12
*/
#include "\src\atlanta\define\product.h"

#if (PRO_CPU_VERSION == SH7043_A)
#include "\src\cpu\sh7043_a\irom\def_v\defv_tib.c"
#else

#include "\src\atlanta\sh7043\define\def_tib.h"

#pragma section TIB /* locate section name "CTIB" */

/************************************************************************
 * ‚o‚n‚o‚k‚`‚q ƒ^ƒCƒv ‚a												*
 ************************************************************************/
#if defined(POPLAR_B)
#include "\src\atlanta\poplar_b\def_v\popbvtib.c"
#endif

/************************************************************************
 * ‚o‚n‚o‚k‚`‚q ƒ^ƒCƒv ‚a‚m	1999/05/13 by T.Soneoka						*
 ************************************************************************/
#if defined(POPLR_BN)
#include "\src\atlanta\poplr_bn\def_v\popbvtib.c"
#endif

/************************************************************************
 * ‚o‚n‚o‚k‚`‚q ƒ^ƒCƒv ‚k												*
 ************************************************************************/
#if defined(POPLAR_L)
#include "\src\atlanta\poplar_l\def_v\poplvtib.c"
#endif

/************************************************************************
 * ‚o‚n‚o‚k‚`‚q ƒ^ƒCƒv ‚m												*
 ************************************************************************/
#if defined(POPLAR_N)
#include "\src\atlanta\poplar_n\def_v\popnvtib.c"
#endif

/************************************************************************
 * ‚o‚n‚o‚k‚`‚q ƒ^ƒCƒv ‚g												*
 ************************************************************************/
#if defined(POPLAR_H)
#include "\src\atlanta\poplar_h\def_v\pophvtib.c"
#endif

/************************************************************************
 * ‚`‚m‚y‚t ƒ^ƒCƒv ‚k													*
 ************************************************************************/
#if defined(ANZU_L)
#include "\src\atlanta\anzu_l\def_v\anzuvtib.c"
#endif

/************************************************************************
 * ‚`‚m‚y‚t ƒ^ƒCƒv ‚u													*
 ************************************************************************/
#if defined (ANZU_V)
/*
**	ANZU_V(²İÀ°È¯ÄFAXµÌß¼®İ•t‚«ÓÃŞÙ)—p‚ÌÌ§²Ù‚É‚µ‚Ü‚·Bby Y.Tanimoto 1998/03/18
*/
#include "\src\atlanta\anzu_v\def_v\anzuvtib.c"
#endif

/************************************************************************
 * ‚r‚`‚j‚`‚j‚h															*
 ************************************************************************/
#if defined(SAKAKI)
#include "\src\atlanta\sakaki\def_v\sakivtib.c"
#endif

/************************************************************************
 * ‚g‚h‚m‚n‚j‚h															*
 ************************************************************************/
#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
#include "\src\atlanta\hinoki\def_v\hinovtib.c"
#endif

/************************************************************************
 * ‚k‚S‚O‚OŒãŒp															*
 ************************************************************************/
#if defined(POPLAR_F)
#include "\src\atlanta\poplar_f\def_v\popfvtib.c"
#endif

/************************************************************************
 * V191ŒãŒp															*
 ************************************************************************/
#if defined(STOCKHM2)
#include "\src\atlanta\stockhm2\def_v\lvndvtib.c"
#endif

#pragma section

#endif
