/************************************************************************
*	System		: POPLAR/ANZU-L
*	File Name	: CMN_TMR.C
*	Author		: 橘正樹
*	Date		: 1997/02/19
*	RealTimeOS	: ＲＩＳＣ（ＳＨ７０４３）モニタ
*	Description	: ＭＴＵ起動処理
*	Maintenance	:
*
*	Copyright (C) 1997 Murata Machienry,Ltd. All rights reserved.
*************************************************************************/
#include "\src\atlanta\define\product.h"
#include "\src\atlanta\define\cmn_pro.h"

#if (PRO_CPU_VERSION == SH7043_A)
#include "\src\cpu\sh7043_a\irom\define\sh_sys.h"
#else
#include "\src\atlanta\sh7043\define\sh_sys.h"
#endif

/*************************************************************************
	module		:[プリンタワンショットタイマの起動]
	function	:[
		1.ＭＴＵチャネル２を起動する
	]
	return		:[なし]
	common		:[]
	condition	:[]
	comment		:[]
	machine		:[SH7043]
	language	:[SHC(Ver.3.0C)]
	keyword		:[PRN]
	date		:[1997/02/19]
	author		:[橘正樹]
*************************************************************************/
void CMN_SetupPrintOneshotTimer(void)
{
	/*------------------------------------------------------------------
	** ＰＥＣＲ２:0xFFFF83BA  0x4000(PE7MD) ＭＴＵアウトプットコンペア出力:1
	** ＰＥＤＲ  :0xFFFF83B0　0x0080(PE7DR) 出力値:1
	*/

	/*------------------------------------------------------------------
	** ＣＰＵのイニシャルの時に行うとポートがＯＦＦのままになるので
	** ＶＳＹＮＣを検出した状態になり
	** プリンタの割り込みが入り続ける（ＰＧＥＮＤ）
	** ＣＰＵのイニシャルの設定ではポートを汎用入出力にしておく
	*/
	PFC__PECR2 |= PECR2_PE7MD_TIOC2B;

	/*------------------------------------------------------------------*/
	/* ＴＳＴＲの設定													*/
	/* ・カウンターの停止												*/
	/* ・予約ビット５～３は常に０をセット								*/
	/*------------------------------------------------------------------*/
	MTU__TSTR &= ~TSTR_START_CH2;
	/*------------------------------------------------------------------*/
	/* ＴＣＲの設定														*/
	/* ・ＧＲＢのコンペアマッチ／インプットキャプチャでＴＣＮＴクリア	*/
	/* ・立上がりエッジでカウント										*/
	/* ・内部クロック２８ＭＨｚ÷１６＝５７１．４３ｎｓ					*/
	/* ・予約ビット７は１又は０をセット									*/
	/*------------------------------------------------------------------*/
	MTU__TCR2 = 0x42;
	/*------------------------------------------------------------------*/
	/* ＴＭＤＲの設定													*/
	/* ・ＴＧＲＢは通常動作												*/
	/* ・ＴＧＲＡは通常動作												*/
	/* ・ＭＴＵチャネル２は通常動作モード								*/
	/* ・予約ビット７は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TMDR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＩＯＲ２の設定            										*/
	/* ・ＧＲＡコンペアマッチによる端子出力禁止							*/
	/* ・ＧＲＢコンペアマッチ（初期値０ コンペアマッチで１出力）		*/
	/*------------------------------------------------------------------*/
	MTU__TIOR2 = 0x20;
	/*------------------------------------------------------------------*/
	/* ＴＩＥＲの設定													*/
	/* ・コンペアマッチ割込み禁止（ＴＧＢＡ／ＴＧＩＢ）					*/
	/* ・予約ビット６は１をセット										*/
	/* ・予約ビット５は０をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TIER2 = 0x40;
	/*------------------------------------------------------------------*/
	/* ＴＳＲの設定														*/
	/* ・ＴＣＮＴアップカウンタ											*/
	/* ・予約ビット６は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TSR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＣＮＴのクリア													*/
	/*------------------------------------------------------------------*/
	MTU__TCNT2 = 0;
	/*------------------------------------------------------------------*/
	/* ＴＧＲの設定														*/
	/* ・カウンター値の設定												*/
	/*   １０ｍｓ÷５７１．４３ｎｓ ＝ １７５００（０ｘ４４５Ｃ）カウント */
	/*------------------------------------------------------------------*/
	MTU__TGR2B = 0x445C;
	/*------------------------------------------------------------------*/
	/* ＭＴＵ２の割込みをレベルＦへセット								*/
	/* １５～１２ビット													*/
	/*------------------------------------------------------------------*/
/*	SH__IPRE |= MTU2H_LEVEL;	*/

	return;
}

/*************************************************************************
	module		:[プリンタワンショットタイマの起動]
	function	:[
		1.ＭＴＵチャネル２を起動する
	]
	return		:[なし]
	common		:[]
	condition	:[]
	comment		:[]
	machine		:[SH7043]
	language	:[SHC(Ver.3.0C)]
	keyword		:[PRN]
	date		:[1997/02/19]
	author		:[橘正樹]
*************************************************************************/
void CMN_StartPrintOneshotTimer(void)
{
	/*------------------------------------------------------------------
	** ＣＰＵのイニシャルの時に行うとポートがＯＦＦのままになるので
	** ＶＳＹＮＣを検出した状態になり
	** プリンタの割り込みが入り続ける（ＰＧＥＮＤ）
	** ＣＰＵのイニシャルの設定ではポートを汎用入出力にしておく
	*/
	PFC__PECR2 |= PECR2_PE7MD_TIOC2B;

	MTU__TSTR &= ~TSTR_START_CH2;	/* チャネル２カウント停止 */
	MTU__TSR2 &= ~0x02;				/* TGFBのクリア */
	MTU__TCNT2 = 0;					/* TCNTのクリア */

	/*------------------------------------------------------------------*/
	/* ＴＣＲの設定														*/
	/* ・ＧＲＢのコンペアマッチ／インプットキャプチャでＴＣＮＴクリア	*/
	/* ・立上がりエッジでカウント										*/
	/* ・内部クロック２８ＭＨｚ÷１６＝５７１．４３ｎｓ					*/
	/* ・予約ビット７は１又は０をセット									*/
	/*------------------------------------------------------------------*/
	MTU__TCR2 = 0x42;
	/*------------------------------------------------------------------*/
	/* ＴＭＤＲの設定													*/
	/* ・ＴＧＲＢは通常動作												*/
	/* ・ＴＧＲＡは通常動作												*/
	/* ・ＭＴＵチャネル２は通常動作モード								*/
	/* ・予約ビット７は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TMDR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＩＯＲ２の設定            										*/
	/* ・ＧＲＡコンペアマッチによる端子出力禁止							*/
	/* ・ＧＲＢコンペアマッチ（初期値０ コンペアマッチで１出力）		*/
	/*------------------------------------------------------------------*/
	MTU__TIOR2 = 0x20;
	/*------------------------------------------------------------------*/
	/* ＴＩＥＲの設定													*/
	/* ・コンペアマッチ割込み禁止（ＴＧＢＡ／ＴＧＩＢ）					*/
	/* ・予約ビット６は１をセット										*/
	/* ・予約ビット５は０をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TIER2 = 0x40;
	/*------------------------------------------------------------------*/
	/* ＴＳＲの設定														*/
	/* ・ＴＣＮＴアップカウンタ											*/
	/* ・予約ビット６は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TSR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＧＲの設定														*/
	/* ・カウンター値の設定												*/
	/*   １０ｍｓ÷５７１．４３ｎｓ ＝ １７５００（０ｘ４４５Ｃ）カウント */
	/*------------------------------------------------------------------*/
	MTU__TGR2B = 0x445C;

	/*------------------------------------------------------------------*/
	/* ＴＳＴＲの設定													*/
	/* ・カウンターのスタート											*/
	/* ・予約ビット５～３は常に０をセット								*/
	/*------------------------------------------------------------------*/
	MTU__TSTR |= TSTR_START_CH2;

	return;
}

/*************************************************************************
	module		:[プリンタワンショットタイマの停止]
	function	:[
		1.ＭＴＵチャネル２を停止する
	]
	return		:[なし]
	common		:[]
	condition	:[]
	comment		:[]
	machine		:[SH7043]
	language	:[SHC(Ver.3.0C)]
	keyword		:[PRN]
	date		:[1997/02/19]
	author		:[橘正樹]
*************************************************************************/
void CMN_StopPrintOneshotTimer(void)
{
	MTU__TSTR &= ~TSTR_START_CH2;	/* カウント停止 */
	MTU__TSR2 &= ~0x02;				/* TGFBのクリア */
	MTU__TCNT2 = 0;					/* TCNTのクリア */

	return;
}

