/* By Y.Suzuki 1996/10/21 */
/* Original File : jun\usr2:\src\ichou\def_v\ini_tbl.c */
/* POPLAR_Hからコピーしただけです。By O.Kimoto 1998/09/07 */
/************************************************************************
 * 桐用初期値テーブル													*
 * unsigned char far MachineParameterInitialTable[SYS_MACHINE_PARAMETER_MAX]*
 * unsigned char far SettingStatusInitialTable[SYS_SETTING_MAX]			*
 * unsigned char far MemorySwitchInitialTable[SYS_MEMORY_SWITCH_MAX]	*
 * 1994/02/23															*
 * 吉川弘康																*
 ************************************************************************/
#include "\src\atlanta\define\product.h"
#include "\src\atlanta\define\status.h"
#include "\src\atlanta\ext_v\scn_tbl.h"
#include "\src\atlanta\define\sysmax.h"/*	By Y.Suzuki 1996/10/31	*/
#include "\src\atlanta\define\sysdoc.h"

#pragma section INI_TBL		/* セクション指定 */

/************************************************************************
 * 機器パラメータの初期値												*
 * unsigned char SYB_MachineParameter[SYS_MACHINE_PARAMETER_MAX]		*
 * 1994/01/31															*
 * 吉川弘康																*
 ************************************************************************/
CONST UBYTE MachineParameterInitialTable[SYS_MACHINE_PARAMETER_MAX] = {
/************/
/* Ａ: 0-10 */
/************/
/*0*/	0		/* 国別コード */
				/* ハードディップ付き仕様の場合はその値がセットされる */
		,
/*1*/	0		/* 送出レベル画データ(減衰器設定値) */
				/* 1-0	  1.0dB						*/
				/* 1-1	  2.0dB						*/
				/* 1-2	  4.0dB						*/
				/* 1-3	  8.0dB						*/
				/* 国別パラメータからセットされる	*/
				/* unsigned char far CountryTable[COUNTRY_SW_15][] */
		|
#ifdef AP	/* By H.Y 1996/02/15 */
		0x00	/* 受信側無装荷ケーブル補正			*/
#else
		0x00	/* 受信側無装荷ケーブル補正			*//* Change 0x50 to 0x00 By O.Kimoto 1999/01/11 */
#endif
				/*		0dB 4dB 8dB 12dB			*/
				/* 1-4	  0	  1	  0	   1			*/
				/* 1-5	  0	  0	  1	   1			*/
				/* 送信側無装荷ケーブル補正			*/
				/*		 0dB 4dB 8dB 12dB			*/
				/* 1-6	  0	  1	  0	   1			*/
				/* 1-7	  0	  0	  1	   1			*/
		,
#if defined (HINOKI2) || defined(HINOKI3)	/* CMN_InitializeMachineParameter()でORをとる時にここで0Bにされていると0B以上に設定できないので0に変更 2002/01/22 T.Takagi */
/*2*/	0x00		/* 2:送出レベルDTMF(減衰器設定値)	*/
#else
/*2*/	0x0B		/* 2:送出レベルDTMF(減衰器設定値)	*/
#endif
				/* 2-0	  1.0dB						*/
				/* 2-1	  2.0dB						*/
				/* 2-2	  4.0dB						*/
				/* 2-3	  8.0dB						*/
				/* 国別パラメータからセットされる	*/
				/* unsigned char far CountryTable[COUNTRY_SW_15][] */
				/* struct DialParameters_t far DialTable[].LevelDTMF */
#if (0)
** /* 未使用 By O.Kimoto 1999/01/11 */
** 		|
** 		0x00	/* 保留メロディレベル(減衰器設定値)	*//* By H.Y 1994/11/11 電子(曽根氏)からの依頼 */
** 				/* 2-4	  1.0dB						*/
** 				/* 2-5	  2.0dB						*/
** 				/* 2-6	  4.0dB						*/
** 				/* 2-7	  8.0dB						*/
** 				/* 椛のみ使用						*/
#endif
		,
/*3*/	0x80		/* 3: ADFの先端送り量補正 DS2ON～SCANSTART */
		,
/*4*/	0x80		/* 4: ADFの後端送り量補正 DS2OFF～SCANEND */
		,
/*5*/	0		/* 5:音声応答メッセージ送出レベル(減衰器設定値) */
				/* 5-0	  1.0dB						*/
				/* 5-1	  2.0dB						*/
				/* 5-2	  4.0dB						*/
				/* 5-3	  8.0dB						*/
				/* 5-4								*/
				/* 5-5								*/
				/* 5-6								*/
				/* 5-7								*/
		,
/*6*/	0		/* 6:DS2 ON から待機位置までのステップ値(NORMAL): */
		,
/*7*/	0		/* DRAM容量(1 ～ 8M) DRAMクリアで自動設定 (1bit=1M) <- 512Kから変更 By m.Tachibana 1997/06/05 */
		,
/*8*/	0		/* DRAM容量(9 ～ 16M) DRAMクリアで自動設定 (1bit=1M) */
		,
/*9*/	0		/* 初期値はＭＧ３　蓄積符号化方式（桐のみ有効） */
		,
/************/
/* Ｂ:10-19 */
/************/
#if defined(HINOKI2) && (PRO_PAPER_AD_SENSOR_INIT == DISABLE)	/* ＰＳ２自動調整不具合対応 by Y.kano 2004/12/06 */
		0x10,		/* ＰＳ２が切れてからの引き戻しステップ量 */
#else
		0x00,		/* 未使用 */
#endif
		0x00,		/* 未使用 */
		0x80,		/* 両端読取りマスク幅微調整 */
#if defined (KEISATSU) /* 警察FAX 05/04/26 石橋正和 */
		0x00,		/* 警電の場合の送出レベル(減衰器設定値) */
		0x00,		/* 警電のDTMP送出レベル(減衰器設定値) */
#else
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
#endif
		0x80,		/* Printer Top Margin */
		0x00,       /* Printer Left Margin */
		0x00,       /* 未使用 */
		0x80,       /* Printer Bottom Margin */
#if defined (KEISATSU) /* 警察FAX 2005/11/22 O.Oshima */
		0x04,       /* Printer 左右端白マスク幅 */
#else
		0x02,       /* Printer 左右端白マスク幅 */
#endif
/************/
/* Ｃ:20-29 */
/************/
		0x00,		/* Ｃ：０          LC82103 DALA センサ信号期間Ａ／Ｄローリファレンス用Ｄ／Ａ値に対するオフセット値(Reg11:0-5)*/
		0x00,		/* Ｃ：１          LC82103 DAHA センサ信号期間Ａ／Ｄハイリファレンス用Ｄ／Ａ値に対するオフセット値(Reg13:0-5)*/
		0x02,		/* Ｃ：２－０     ２値 ガンマ補正データ、Ｄ０～９－＞Ｅ０～５の値を使用する */
					/* Ｃ：２－１～２ ゴミ判定(Reg5:0-1) */
					/* Ｃ：２－３     ガンマ補正データ 特殊ガンマ曲線 */
					/* Ｃ：２－４     ガンマ補正データ 特殊ガンマ曲線 */
		0x00,		/* Ｃ：３－０～５ 中間調 ガンマ補正データ、Ｄ０～９－＞Ｅ０～５の値を使用する */
		0x00,		/* Ｃ：４－０～７ クランプ位置(Reg6:0-7) */
		0x00,		/* Ｃ：５－０～２ Ａ／Ｄサンプリングポイント調整 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
#if (0)
**		0x07,		/* Ｃ：８          Ｎｏｒｍ送信時のスライスレベル補正 00->05 変更1999/07/08 by T.Soneoka */
#endif
		0x00,		/* Ｃ：８          Ｎｏｒｍ送信時のスライスレベル補正 07->00 変更 1999/07/12 by T.Soneoka */
		0x00,		/* Ｃ：９          ガンマ補正データ ソフト補完データ調整 */
/************/
/* Ｄ:30-39 */
/************/
					/* Ｃ：２－０を１にすると下記データが有効になります */
/*
** テストデータのデフォルト値をあらかじめ設定しておきます
** 1999/06/29 by T.Soneoka
*/
#if (0) 
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域０ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域１ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域２ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域３ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域４ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域５ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域６ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域７ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域８ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域９ */
#else
		0x00,		/* ２値／中間調 ガンマ補正データ 領域０ */
		0x01,		/* ２値／中間調 ガンマ補正データ 領域１ */
		0x02,		/* ２値／中間調 ガンマ補正データ 領域２ */
		0x03,		/* ２値／中間調 ガンマ補正データ 領域３ */
		0x04,		/* ２値／中間調 ガンマ補正データ 領域４ */
		0x05,		/* ２値／中間調 ガンマ補正データ 領域５ */
		0x06,		/* ２値／中間調 ガンマ補正データ 領域６ */
		0x07,		/* ２値／中間調 ガンマ補正データ 領域７ */
		0x08,		/* ２値／中間調 ガンマ補正データ 領域８ */
		0x10,		/* ２値／中間調 ガンマ補正データ 領域９ */
#endif
/************/
/* Ｅ:40-49 */
/************/
/*
** テストデータのデフォルト値をあらかじめ設定しておきます
** 1999/06/29 by T.Soneoka
*/
#if (0)
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域１０ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域１１ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域１２ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域１３ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域１４ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域１５ */
**		0x00,		/* ２値／中間調 ガンマ補正データ 領域１６ ここまで */
#else
		0xF0,		/* ２値／中間調 ガンマ補正データ 領域１０ */
		0xF8,		/* ２値／中間調 ガンマ補正データ 領域１１ */
		0xFA,		/* ２値／中間調 ガンマ補正データ 領域１２ */
		0xFC,		/* ２値／中間調 ガンマ補正データ 領域１３ */
		0xFD,		/* ２値／中間調 ガンマ補正データ 領域１４ */
		0xFF,		/* ２値／中間調 ガンマ補正データ 領域１５ */
		0xFF,		/* ２値／中間調 ガンマ補正データ 領域１６ ここまで */
#endif
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
/************/
/* Ｆ:50-59 */
/************/
		0x03,		/* LC82103設定 m_param.h参照 */
		0x04,		/* LC82103設定 m_param.h参照 */
		0x00,		/* LC82103設定 m_param.h参照 */
		0x55,		/* LC82103設定 m_param.h参照 */
		0x02,		/* LC82103設定 m_param.h参照 */
		0x04,		/* LC82103設定 m_param.h参照 */
		0x04,		/* LC82103設定 m_param.h参照 */
#if (0)		/* 変更 by Y.Kano 2004/01/29 */
		0x44,		/* LC82103設定 m_param.h参照 */
#else
		0x00,		/* LC821033設定 m_param.h参照 */
#endif
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
/************/
/* Ｇ:60-69 */
/************/
		0x00,		/* 未使用 */
		0x03,		/* G:1 朱色読み取り時 LC82103 DAHA オフセット値 */
		0x03,		/* G:2-0     ２値 ガンマ補正データ、Ｄ０～９－＞Ｅ０～５の値を使用する */
					/* G:2-1-2 ゴミ判定(Reg5:0-1) */
		0x00,		/* G:3-0-1 （朱色読み取り時）単純二値化用Ｙ方向強調フィルタ */
					/* G:3-2-3 （朱色読み取り時）単純二値化用Ｘ方向強調フィルタ */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x18,		/* G:9-0～7 朱色読み取り用ガンマ補正データ ソフト補完データ調整 */
					/* G:9-7    1:マイナス 0:プラス */
					/* G:9-0～6 調整量 */
/************/
/* Ｈ:70-79 */
/************/
		/* Ｈ：０～２   ２値 濃度調整 */
		0x00,		/* Ｈ：０ ２値 薄い */
		0x00,		/* Ｈ：１ ２値 普通 */
		0x00,		/* Ｈ：２ ２値 濃い */
		/* Ｈ：３～５	中間調 濃度調整 */
		0x00,		/* Ｈ：３ 中間調 薄い */
		0x00,		/* Ｈ：４ 中間調 普通 */
		0x00,		/* Ｈ：５ 中間調 濃い */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
/************/
/* Ｉ:80-89 */
/************/
#if defined (KEISATSU) /* 警察FAX 05/05/31 石橋正和 */
		0x94,		/* デフォルト警電/デフォルト個別/警電SデフォルトON/加入SデフォルトOFF/警電優先受信OFF/スクランブラ有効 */
		0x00,		/* キーロックしない/共通/S1バイパスしない/S1エラー表示 */
		0x0A,		/* 一斉鳴動時間[s] */
		0x05,		/* 一斉指令能力(4800bps, MR, 20ms) */
		0x03,		/* 一斉指令タイムアウト[分] */
#else
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
#endif /* #if defined (KEISATSU) */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
/************/
/* Ｊ:90-99 */
/************/
#if (0)
**		0x80,		/* ＰＳ２ Ａ／Ｄ変換 閾値 *//* Add By O.Kimoto 1999/03/29 */
**		0x75,		/* ＰＳ２ Ａ／Ｄ変換 閾値 ヒステリシスを持たす変更のため *//* 1999/04/14 by T.Soneoka */
#else
		0x8A,		/* ＰＳ２ Ａ／Ｄ変換 閾値 ヒステリシスを持たす変更のため *//* 1999/04/22 by T.Soneoka */
#endif
#if (PRO_PAPER_AD_SENSOR_INIT == ENABLE)
		0xCD,		/* ＰＳ１の閾値初期値 */
		0xAD,		/* ＰＳ２の閾値初期値 */
		0xC9,		/* ＰＢ４の閾値初期値 */
#else
 #if (0)
**		0x15,		/* ＰＳ２ Ａ／Ｄ変換  ヒステリシス値（Ｈ－Ｌ）*/
 #else
		0x0F,		/* ＰＳ２ Ａ／Ｄ変換  ヒステリシス値（Ｈ－Ｌ）*//* 1999/04/22 by T.Soneoka */
 #endif
		0x00,		/* ＰＳ２：Ｖｓｉｍｉ（デフォルト値：０ｘＢ３）モニター Y.Kano 2004/03/01 					*/
		0x00,		/* ＰＳ２：Ｖｐａｖｅ（Ｖｐレベルの平均値）モニター	by Y.Kano 2004/03/01 					*/
#endif
		0xB3,		/* 00-> B3 Y.Kano 2004/04/01 */
		0x00,		/* ＰＳ２：Ｖｂ（記録紙無しレベル）Ａ／Ｄ変換 取込み値モニター	by Y.Kano 2004/03/01 		*/
		0xB3,		/* /* 00-> B3 Y.Kano 2004/04/01 */
		0x00,		/* 未使用 */
		0x00,		/* 未使用 */
		0x00		/* 未使用 */
};

/************************************************************************
 * 機器設定の初期値														*
 * unsigned char SYB_SettingStatus[SYS_SETTING_MAX]						*
 * 1994/01/31															*
 * 吉川弘康																*
 ************************************************************************/
CONST UBYTE SettingStatusInitialTable[SYS_SETTING_MAX] = {
/*0*/	0								/* 回線タイプー＞国別テーブルから初期化される */
		,
/*1*/	0
		|	 SCANNING_WIDTH_B4			/* 読み取りサイズ */
		|	 PRIMARY_MODE_NORMAL		/* 優先モード */
#if (0) /* ●ICHOU変更 SETTING_STATUS_26に移動 by T.Soneoka 1996/06/20 */
//		|	 PRIMARY_CONTRAST_NORMAL	/* 優先濃度 */
#endif
		|	 HALFTONE_MODE_64			/* 写真階調 */
		,
/*2*/	0
#if (PRO_VOICE_ANSWER == ENABLE)	/* NTT仕様 音声応答 by J.Kishida 2002/10/02 */
		|	VOICE_MESSAGE_ON			/* 電話優先時の音声応答ＯＮ(ＮＴＴ) */
#endif
#if (PRO_POST_OFFICE == ENABLE) || defined (KEISATSU)	/* 郵政局特ROM Ver.PO5501以降のROMは、ジャーナル自動プリントON 2004/02/12 T.Takagi */
		|	JOURNAL_AUTO_PRINT_ON
#endif
		,
/*3*/	0
		|	 CONNECTING_2ND_TEL			/* 子電話接続ＯＮ */
#if defined (JPN)
		|	HOLD_MELODY_ON				/* 保留メロディーＯＮ */
#else	/* ＴＷＮは保留メロディなし by H.Hirao 1999/02/04 */
		&	~HOLD_MELODY_ON				/* 保留メロディーＯＮ */
#endif
		&	~DIAL_IN_ON					/* ダイヤルインＯＮ */
#if (0)	/* TEL待機を追加のためこのﾋﾞｯﾄを削除します（待機ﾓｰﾄﾞに吸収されているので問題はなし）by K.Watanabe 1997/03/22 */
//		|	PRIMARY_FAX					/* TEL/FAX待機時 FAX優先 */
#endif
		|	AUTO_RX_MODE_FAX			/* 自動受信モードFAX */
		,
/*4*/	0
		&	~CLOSED_NETWORK_ON			/* 閉域通信ＯＮ */
		&	~SECURITY_TRANSMISSION		/* パスワード送信 */
		&	~BLOCK_JUNK_FAX_ON			/* ダイレクトメール防止ＯＮ */
		&	~MESSAGE_TRANSMIT_ON		/* メッセージ送信ＯＮ */
		&	~PRINTER_NO_FORM_FEED		/* ページ合成ＯＮ */
		|	 RX_REDUCTION_1				/* 受信固定縮小率 */
		,
#if (PRO_CLASS1 == ENABLE) /* 1997/08/18 Y.Matsukuma */
/*5*/	0
		|	 RS232C_SPEED_VARIABLE		/* RS-232C速度19200 */
		|	 RS232C_DATA_LENGTH_8		/* RS-232Cキャラクタービット８or７ */
		|	 RS232C_PARITY_NONE			/* RS-232Cパリティ１ */
		&	~RS232C_STOP_LENGTH_2		/* RS-232Cストップビット２or１ */
#else
		0
#endif
		,
#ifdef FRA
/*6*/	0
		&	~DOCUMENT_STAMP_ON			/* 済スタンプＯＮ */
		&	~MEMORY_TRANSMISSION_ON		/* メモリー送信ＯＮ */
		&	~SECTION_CHECK_ON			/* 部門管理ＯＮ */
		&	~CONFIRM_ON					/* 通信証ＯＮ */
		&	~CONFIRM_TYPE_RCR			/* 受領証ＯＮ */
		&	~ECM_SETTING				/* ECMＯＮ */
		&	~COPY_PROTECT_ON			/* コピー禁止ＯＮ */
		&	~REMOTE_DIAG_ON				/* リモート診断ＯＮ */
		,
#else
/*6*/	0
		&	~DOCUMENT_STAMP_ON			/* 済スタンプＯＮ */
 #if (PRO_POST_OFFICE == ENABLE) 	/* 郵政局特ROM Ver.PO5501以降のROMは、メモリー送信初期値OFF 2004/02/12 T.Takagi */
		&	~MEMORY_TRANSMISSION_ON
 #else
		|	 MEMORY_TRANSMISSION_ON		/* メモリー送信ＯＮ */
 #endif
		&	~SECTION_CHECK_ON			/* 部門管理ＯＮ */
		&	~CONFIRM_ON					/* 通信証ＯＮ */
		&	~CONFIRM_TYPE_RCR			/* 受領証ＯＮ */
		|	 ECM_SETTING				/* ECMＯＮ */
		&	~COPY_PROTECT_ON			/* コピー禁止ＯＮ */
		&	~REMOTE_DIAG_ON				/* リモート診断ＯＮ */
/*		|	REMOTE_DIAG_ON				/@ リモート診断ＯＮ 変更 1997/02/05	 By T.Yamaguchi */
		,
#endif
/*7*/	24								/* 受信縮小用しきい値 */
		,
/*8*/	0								/* リダイヤル回数 */
										/* CountryTable[][]からセットされる */
		,
/*9*/	0								/* リダイヤル間隔 */
										/* CountryTable[][]からセットされる */
		,
/*10*/	0								/* ポーズ時間 */
										/* CountryTable[][]からセットされる */
		,
/*11*/	0								/* ベル回数 */
										/* CountryTable[][]からセットされる */
		,
/*12*/	0								/* 親展保持期間 */
										/* CountryTable[][]からセットされる */
		,
#if (PRO_RING_MASTER == ENABLE)
/*13*/	0								/* リングマスターパターン */
		|	RING_MASTER_PATTERN_1		/* パターン１*/
#else
/*13*/	0								/* 未使用 */
										/* プリンタ動作時間 */
#endif
		,
/*14*/	0xFF							/* 任意受信縮小率(%刻み) *//* 0xFF:自動縮小 */
		,
/*15*/	0
		&	~REMOTE_FAX_ON				/* リモートFaxON */
		&	~REMOTE_FAX_DEL				/* リモートFax取出し時の原稿消去 */
		&	~REMOTE_FAX_PRN				/* リモートFax設定時の受信原稿プリント */
		&	~TAD_POCKET_BELL_ON			/* ポケベル呼び出しON */
		&	~TAD_OGM_USER_MESSAGE		/* 内蔵TADでユーザメッセージ有効 */
		&	~RELAYED_RELAY_TX_ON		/* 中中継ON */
		&	~CATCH_PHONE_ON				/* キャッチホンON */
		&	~RING_MASTER_ON				/* リングマスタON */
		,
/*16*/	0								/* アンズＬのみ */
		|	 COPY_FIXED_REDUCTION_1		/* コピー用固定縮小率 (自動)*/
		&	~PRINTER_RECEIVE_ON			/* ﾌﾟﾘﾝﾀｰ受信 */
		&	~STG_SILENT_OPERATION		/* サイレントオペレーション */
		,
/*17*/	24								/* コピー用しきい値 *//* 変更(0->24mm) By O.Kimoto 1998/01/29 */
		,
/*18*/	0								/* 未使用 */
										/* トールセーバ用ベル回数 */
		,
/*19*/	0								/* 未使用 */
										/* 上段手動記録紙選択 */
		,
/*20*/	0								/* 未使用 */
										/* 下段手動記録紙選択 */
		,
/*21*/	1								/* 受信原稿のプリント枚数 *//* 1995/06/26 By H.Y */
		,
/*22*/	24								/* 回転受信用しきい値 97'08/30 by K.Watanabe */
		,
/*23*/	0								/* アンズＬのみ */
		&	~DAYLIGHT_SAVING_AUTO		/* 夏時間自動切り替え */
		&	~SECURITY_RX_ON				/* セキュリティ受信	  */
		&	~OPERATION_PROTECT_ON		/* オペレーションプロテクト	  */
		&	~SECTION_CHECK_PROTECT_ON	/* 部門管理プロテクト */
		&	~PIN_ACCESS_OFF				/* PINアクセスモード */
		,
/*24*/	0								/* 未使用 */
		,
/*25*/	0								/* 未使用 */
		,
/*26*/	0
		&	~PCFAX_ON					/* ＰＣＦＡＸ接続ＯＦＦ */
		&	~READY_MODE_COPY			/* 待機モードCOPY */
		|	PRIMARY_CONTRAST_NORMAL		/* 優先濃度 */
		&	~PHONE2_EXTLINE_ON			/* 擬似2回線のPHONE2接続状態 LINE側で初期化 by T.Soneoka 1997/11/11 */
		,
/*27*/	0								/* ＰＣプリント手差し用紙サイズ */
		,
/*28*/	0								/* 未使用 */
		,
/*29*/	0								/* 未使用 */
		,
/*30*/	0
		&	~ND_MODE_ON					/* ナンバーディスプレイＯＦＦ */
		&	~ND_DIAL_IN_ON				/* ダイヤルインＯＦＦ（ＮＤ対応用）*/
		&	~WARP_MODE_ON				/* ワープ機能ＯＦＦ		*/
		,
/*31*/	0
#if defined (KEISATSU) /* 警察FAX temp for debug Added by SMuratec 李 2005/07/05 */
		|SETTING_LINE
#endif /* defined (KEISATSU) */
		|NEW_SENSOR_SETIING				/* F351用新機能チェック追加 by Y.Kano 2004/04/01 */
		,
#if defined (KEISATSU) /* 警察FAX 05/06/06 石橋正和 */
/*32*/	0,								/* ベル回数 */
										/* CountryTable[][]からセットされる */
#else
/*32*/	0,								/* 未使用 */
#endif

/*33*/	0,	/*34*/	0,
/*35*/	0,	/*36*/	0,	/*37*/	0,	/*38*/	0,	/*39*/	0,
/*40*/	0,	/*41*/	0,	/*42*/	0,	/*43*/	0,	/*44*/	0,
/*45*/	0,	/*46*/	0,	/*47*/	0,	/*48*/	0,	/*49*/	0
};

/************************************************************************
 * メモリスイッチの初期値												*
 * unsigned char SYS_MemorySwitch[SYS_MEMORY_SWITCH_MAX]				*
 * 1994/01/31															*
 * 吉川弘康																*
 ************************************************************************/
CONST UBYTE MemorySwitchInitialTable[SYS_MEMORY_SWITCH_MAX] = {
/*******************/
/* Ａ:ダイヤラ 0-9 */
/*******************/
#if defined(USA)
	0x06, 0x03, 0x00, 0x00, 0x00, 0x61, 0x00, 0x00, 0x00, 0x00,
#elif defined(JPN)
	0x04, 0x03, 0x00, 0x00, 0x00, 0x61, 0x00, 0x00, 0x00, 0x00, /* A0 06->04 O.Oshima 2004/11/06 */
#else /* 取り敢えずＵＳＡ以外を挿入します。必要なら国単位で登録してください。By S.Kawasaki 1996/06/25 */
	0x06, 0x03, 0x00, 0x00, 0x00, 0x61, 0x00, 0x00, 0x00, 0x00,
#endif

/*****************/
/* Ｂ:送信 10-19 */
/*****************/
#if defined(USA)
0x8D, 0x40, 0x10, 0x04, 0x00, 0x02, 0x16, 0x00, 0x00, 0x00,
#elif defined(JPN)
/* 0x8D, 0x40, 0x10, 0x04, 0x00, 0x22, 0x16, 0x00, 0x00, 0x00, */
/* 短縮ハンドシェイク属性の初期値をOFF にします。by H.Kubo 1998/04/08  */
/* 0x8D, 0x4F, 0x10, 0x04, 0x00, 0x22, 0x16, 0x00, 0x00, 0x00, */

 #if (0)
** /* 短縮ハンドシェークで、PIXが取れないときが有るので、やっぱり元に戻します。 by O.Kimoto 1998/08/04 */
** #if (0)
** /* 短縮ハンドシェーク属性の初期値をＯＮに戻します By O.Kimoto 1998/08/03 */
** 0x8D, 0x4F, 0x10, 0x04, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00,
** #else
** 0x8D, 0x4F, 0x10, 0x04, 0x00, 0x22, 0x00, 0x00, 0x00, 0x00,
** #endif
 #else

  #if (0)
** /* トーンアッテネータの初期値はCountryTableから値を取ってくる為、ここでは０でないといけない
** ** by O.Kimoto 1998/08/27
** */
** 0x8D, 0x4F, 0x10, 0x04, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00,
  #else
   #if defined (KEISATSU) /* 警察FAX 05/11/18 石橋正和 */
0x8D, 0x40, 0x10, 0x04, 0x00, 0x06, 0x00, 0x00, 0x00, 0x00,
   #else
0x8D, 0x40, 0x10, 0x04, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00,
   #endif

  #endif

 #endif

#else /* 取り敢えずＵＳＡ以外を挿入します。必要なら国単位で登録してください。By S.Kawasaki 1996/06/25 */
0x8D, 0x40, 0x10, 0x04, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00,
#endif

/*****************/
/* Ｃ:受信 20-29 */
/*****************/
#if (0) /* 受信原稿長制限 C1:5 0->11998/12/15 by T.Soneoka */
**0x0D, 0x09, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
#endif
0x0D, 0x29, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,

/*******************/
/* Ｄ:モデム 30-39 */
/*******************/
0x25, 0xaa, 0x4a, 0x00, 0x2e, 0x00, 0x00, 0x00, 0x00, 0x00,

/*********************/
/* Ｅ:スキャナ 40-49 */
/*********************/
0x05, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,

/*********************/
/* Ｆ:プリンタ 50-59 */
/*********************/
0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,

/*******************************************/
/* Ｇ:転送受信、電話／ＦＡＸ切り替え 60-69 */
/*******************************************/
#if defined(JPN)
 #if (0)
** /* 留守／ＦＡＸ待機で、Ｐｈｏｎｅ２がＯｆｆＨｏｏｋしている状態で、相手が先に電話を切ると、ＨＩＮＯＫＩ
** ** のＬＣＤが一瞬待機表示になってしまう。（一瞬、Ｐｈｏｎｅ２のＯＨがばたついてキャッチホン処理が動作している
** ** よって、Ｐｈｏｎｅ２のＯｆｆＨｏｏｋ監視時間を長くします。（柴野＠Ｅ設氏の実測では約５０ｍｓばたつくとのこと）
** ** by O.Kimoto 1999/02/22
** */
** 0x12, 0x34, 0x13, 0xA6, 0x31, 0x00, 0x00, 0x00, 0x00, 0x00,
 #else
  #if (PRO_REMOTE_DIAL_TRANSFER == ENABLE)
   #if defined (KEISATSU) /* 警察FAX 05/05/31 石橋正和 */
    #if 0 /* 警察FAX SMuratec 李 2005/08/24 */
    /*0x12*/0x13/* SMuratec 李 2005/07/06 */, 0x04, 0x33, 0xA6, 0x31, 0x04, 0x05, 0x33, 0x03, 0x99,
    #else /* ダイヤル送出後待ち時間修正 */
    0x53, 0x04, 0x33, 0xA6, 0x31, 0x04, 0x05, 0x33, 0x03, 0x99,
   	#endif
   #else
    /* G2-5 0→1 リモートダイヤル転送ON, 
    ** G7-4,5,6,7 0→5 リモートダイヤル転送検出ダイヤル1桁目
    ** G7-0,1,2,3 0→5 リモートダイヤル転送検出ダイヤル2桁目
    ** G8-0,1,2,3 0→3 リモートダイヤル転送桁数タイムオーバ
    ** REMOTE_RX_FUNC
    */
    0x12, 0x04, 0x33, 0xA6, 0x31, 0x00, 0x05, 0x55, 0x03, 0x00,
   #endif
  #else
0x12, 0x04, 0x13, 0xA6, 0x31, 0x00, 0x05, 0x00, 0x00, 0x00,
  #endif
 #endif

#else
0x40, 0x34, 0x13, 0x56, 0x31, 0x00, 0x00, 0x00, 0x00, 0x00,
#endif

/*****************/
/* Ｈ:操作 70-79 */
/*****************/
#if defined(JPN)
0x0E, 0x00, 0x0b, 0x00, 0x00, 0x00, 0x70, 0x00, 0x00, 0x00,	/* RDC200400326 Sﾘﾚｰのﾃﾞｨﾚｲﾀｲﾏｰを150msに設定 by Y.kano 2004/09/29 */
/*0x0E, 0x00, 0x0b, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,*/
#else
0x0E, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
#endif

/*******************/
/* Ｉ:その他 80-89 */
/*******************/
0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,

/*******************/
/* Ｊ:その他 90-99 */
/*******************/
#if (PRO_MULTI_LINE == ENABLE)	/* 1997/02/14 Y.Murata */
 #if (PRO_CLASS1 == ENABLE)
  #if (PRO_PC_PRINT == ENABLE)
	/*-----------------------------------*/
	/* ２８．８Ｋ ＋ クラス1 ＋ プリンタ */
	/*-----------------------------------*/
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x07

	#else
	/*-----------------------*/
	/* ２８．８Ｋ ＋ クラス1 */
	/*-----------------------*/
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x05

  #endif
 #else
  #if (PRO_PC_PRINT == ENABLE)
	/*------------------------*/
	/* ２８．８Ｋ ＋ プリンタ */
	/*------------------------*/
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x06

  #else
	/*------------*/
	/* ２８．８Ｋ */
	/*------------*/
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x04

  #endif
 #endif
#else
	/*------*/
	/* 標準 */
	/*------*/
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
#endif

};

/************************************************************************
 * 機種固有スイッチの初期値												*
 * unsigned char SYS_MachineUniqSwitch[SYS_MEMORY_SWITCH_MAX]			*
 * 1996/03/06															*
 * 江口																	*
 ************************************************************************/
CONST UBYTE UniqSwitchInitialTable[SYS_MEMORY_SWITCH_MAX] = {
/*******************/
/* Ａ:ダイヤラ 0-9 */
/*******************/
#if defined(JPN)
 #if (0)
** /* 【CSDR-No.178】極反検出無効に！ By O.Kimoto 1998/12/14 */
** 0x48, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x50,	/* 拡張回線は受信onlyが初期値 By O.Kimoto 1998/02/16 */
 #else

  #if (0)
** /* 極反検出は有効に戻す！
** ** ＣＳサービスより連絡有り。
** ** by O.Kimoto 1999/03/04
** */
** 0x40, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* 拡張回線は受信onlyが初期値 By O.Kimoto 1998/02/16 */
  #else
   #if defined (HINOKI2) && defined(JPNNTT)	/* FAX/TEL待機でCNG検出できない不具合 by J.Kishida 2003/11/05 */
/* A0 0x48 --> 0x78 擬似ﾘﾝｸﾊﾞｯｸﾄｰﾝ送出までの時間をPOPLAR_Fと同じにした Modified by J.Kishida 2002/11/06 */
     #if (PRO_PBX_TONE_DETECT == ENABLE)	/* 発着衝突防止のため、ダイヤル発呼前に内線トーンを見る 2004/11/25 by Y.Kano */
0x78, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* 拡張回線は受信onlyが初期値 By O.Kimoto 1998/02/16 */
     #else
0x78, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* 拡張回線は受信onlyが初期値 By O.Kimoto 1998/02/16 */
     #endif
   #else
     #if (PRO_PBX_TONE_DETECT == ENABLE)	/* 発着衝突防止のため、ダイヤル発呼前に内線トーンを見る 2004/11/25 by Y.Kano */
0x48, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* 拡張回線は受信onlyが初期値 By O.Kimoto 1998/02/16 */
     #else
0x48, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* 拡張回線は受信onlyが初期値 By O.Kimoto 1998/02/16 */
     #endif
   #endif
  #endif
 #endif
#else
0x41, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
#endif

/*****************/
/* Ｂ:送信 10-19 */
/*****************/
#if defined(JPN)
/* 0x3b, 0x00, 0xC0, 0x0a, 0x00, 0x00, 0x15, 0x02, 0x00, 0x00,*/
/* 0x3b, 0x00, 0xC0, 0x0a, 0x00, 0x20, 0x15, 0x02, 0x00, 0x00,*/ /* Changed by H.Kubo 1998/01/21 */
/* 0x3b, 0x00, 0x40, 0x0a, 0x00, 0x20, 0x15, 0x0A, 0x00, 0x00,*/ /* JBIG各モード設定追加  by T.Soneoka 1998/03/16 */

 #if (0)
** /* 日立特許対策（ＣＥＤ検出）
** ** ＣＥＤを検出しないようにしたら、今度はＮＳＦが取れない時が有るので、
** ** ＮＳＦが取れない時はもう一度取りに行くようにする。
** ** by O.Kimoto 1998/05/06
** */
** 0x3b, 0x00, 0x40, 0x0a, 0x00, 0x20, 0x15, 0x02, 0x00, 0x00, /* JBIG TP Off  by T.Soneoka 1998/05/01 */
 #else
0x7b, 0x00, 0x40, 0x0a, 0x00, 0x20, 0x15, 0x02, 0x00, 0x00, /* JBIG TP Off  by T.Soneoka 1998/05/01 */
 #endif

#else
/* 0x13, 0x00, 0xC0, 0x0a, 0x00, 0x00, 0x15, 0x02, 0x00, 0x00, */
/* 0x13, 0x00, 0xC0, 0x0a, 0x00, 0x00, 0x15, 0x0A, 0x00, 0x00,*/	/* JBIG各モード設定追加  by T.Soneoka 1998/03/16 */

 #if (0)
** /* TWN仕様はSUBフレームにおいて、「＃］／［＊］を有効にする。 By O.Kimoto 1999/02/08 */
** 0x13, 0x00, 0xC0, 0x0a, 0x00, 0x00, 0x15, 0x02, 0x00, 0x00,	/* JBIG TP Off  by T.Soneoka 1998/05/01 */
 #else
/* 0x13, 0x00, 0xC0, 0x0a, 0x00, 0x00, 0xD5, 0x02, 0x00, 0x00, */
0x53, 0x00, 0xC0, 0x0a, 0x00, 0x00, 0xD5, 0x02, 0x00, 0x00,		/* B0 13 -> 53 by H.Hirao 1999/03/12 */
 #endif

#endif

/*****************/
/* Ｃ:受信 20-29 */
/*****************/
#if defined (HINOKI2) || defined(HINOKI3)	/* 2002/01/21 T.Takagi */
 #if (PRO_POST_OFFICE == ENABLE)	/* 郵政局特ROM by O.Kimoto 2001/01/21 */
0x3b, 0x68, 0x68, 0xF0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, /* C1 6a -> 68 TCFチェック時間 1000ms -> 800ms FM336PLUSのため */
 #else
0x3b, 0x68, 0x68, 0x50, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* C1 6a -> 68 TCFチェック時間 1000ms -> 800ms FM336PLUSのため */
 #endif
#else
 #if (0)
 ** /* プリント時デコード間に合わず対応 By O.Kimoto 1998/04/30 */
 ** 0x7b, 0x6a, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* B0 3b -> 7b By M.Tachibana 1998/04/24 */
 #else
  #if (0)
 ** /* ＱＡＴ不具合D71-72
 ** ** ＡＬ－１００側は基本的にインチ機として動作しており、一方ＰＯＰＬＡＲはミリ機である。
 ** ** よって、「インチミリ変換」をしないように変更
 ** ** （尚、本来はこのビットは”０”だったのですが、手が滑って立ってしまっていた。
 ** ** By O.Kimoto 1998/05/06
 ** */
 ** 0x7b, 0x6a, 0x88, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* C2 08 -> 88 By O.Kimoto 1998/04/30 */
  #else
   #if defined(JPN)
    #if (PRO_POST_OFFICE == ENABLE)	/* 郵政局特ROM by O.Kimoto 2001/01/21 */
0x3b, 0x68, 0x68, 0xF0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    #else
0x3b, 0x68, 0x68, 0x50, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* C3 40 -> 50 Ｖ１７以下強制メモリ受信 changed by H.Hirao 1999/01/28 */
    #endif
   #else
0x3b, 0x68, 0x68, 0x50, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* C3 40 -> 50 Ｖ１７以下強制メモリ受信 changed by H.Hirao 1999/01/28 */
   #endif	/* defined (JPN) */

/* 0x3b, 0x6a, 0x68, 0x40, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	@* C3 00 -> 40 Ｖ３４強制メモリ受信 changed by H.Hirao 1998/12/26 */
/* 0x3b, 0x6a, 0x88, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	@* C2 08 -> 88 By O.Kimoto 1998/04/30 */
/* 0x3b, 0x6a, 0x68, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	@* デフォルト MMR 蓄積 1998/10/06 By H.Hirao */
/*
** とりあえず、ＭＭＲのイメージプリントができませんので、ＭＲをデフォルトにします。C2 68 -> 48
*/
/* 0x3b, 0x6a, 0x48, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	@* デフォルト MR 蓄積 1998/11/07 By H.Hirao */
  #endif
 #endif
#endif	/* defined (HINOKI2) */

/*******************/
/* Ｄ:モデム 30-39 */
/*******************/
#if (0) /* Changed By H.Hirao 1998/10/05 */
** 0x3D, 0x0F, 0x15, 0x10, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00,
#else
/* 0x3D, 0x0F, 0x15, 0x90, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, @* ARA テーブルはデフォルトでモデムの ROM を使う */
/* 0x3D, 0x14, 0x15, 0x90, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, @* D-1 0x0F -> 0x14 changed by H.Hirao 1999/01/19 */

 #if (0)
** /* フィールドにおいて、ＳｕｐｅｒＧ３の交信不具合が多発しているため、
** ** ３４２９Ｂａｕｄをマスクしておきます。
** ** by O.Kimoto 1999/03/16
** */
** 0x3D, 0x14, 0x15, 0x90, 0x00, 0x00, 0x02, 0x00, 0x00, 0x1B, /* 3429 シンボルレート禁止閾値追加。 by H.Kubo 1999/03/04 */
 #else
  #if defined(JPN)
   #if (PRO_POST_OFFICE == ENABLE)	/* 郵政局特ROM by O.Kimoto 2001/01/21 */
    #if defined(JP1)
0x1D, 0x14, 0x15, 0x90, 0x00, 0x00, 0x02, 0x00, 0x00, 0x1B, /* 郵政の、５５転送対応ROMは、V.34を有効にします 2004/02/12 T.Takagi */
    #else
0x1D, 0x14, 0x15, 0xD0, 0x00, 0x00, 0x02, 0x00, 0x00, 0x1B, /* V.34 Mask By O.Kimoto 2001/01/24 */
    #endif
   #else
0x1D, 0x14, 0x15, 0x90, 0x00, 0x00, 0x02, 0x00, 0x00, 0x1B, /* 3429 シンボルレート禁止閾値追加。 by H.Kubo 1999/03/04 */
   #endif
  #else
0x1D, 0x14, 0x15, 0x90, 0x00, 0x00, 0x02, 0x00, 0x00, 0x1B, /* 3429 シンボルレート禁止閾値追加。 by H.Kubo 1999/03/04 */
  #endif
 #endif

#endif

/*********************/
/* Ｅ:スキャナ 40-49 */
/*********************/
0x01, 0x00, 0x40, 0x00, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00,

/*********************/
/* Ｆ:プリンタ 50-59 */
/*********************/
/*0x2F, 0x10, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0a, 0xB4, プリンタイニシャルカット F0:7 0->1 1998/10/09 by T.Soneoka */
0xAF, 0x10, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0a, 0xB4,

/*****************/
/* Ｇ:電話 60-69 */
/*****************/
#if defined(JPN)
/* 0x17, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00,*/
 #if (PRO_BT_DET_WHILE_RBT == ENABLE) /* 疑似ベル鳴動中のBusyTone検出 2001/10/03 M.Matsumoto *//* Add By O.Kimoto 2002/03/11 */
0x17, 0x00, 0x00, 0x00, 0x01, 0x01, 0x00, 0x43, 0x00, 0x00,
 #else
  #if defined (HINOKI2) && defined(JPNNTT)	/* 留守／ＦＡＸ待機時の秘話機能設定 L400(A)と同値 By O.Kimoto 2002/11/08 */
0x27, 0x00, 0x00, 0x00, 0x01, 0x01, 0x00, 0x03, 0x00, 0x00,
  #else
0x17, 0x00, 0x00, 0x00, 0x01, 0x01, 0x00, 0x03, 0x00, 0x00,	/* 変更 TEL2チン鳴り対策初期値On by T.Soneoka 1998/03/03 */
  #endif
 #endif
#else
/* ＨＩＮＯＫＩ ＴＷＮ仕様のＮＣＵタイプをANZU_GBR_TYPEで動作させるための２４Ｖ制御を有効にした
** by H.Hirao 1999/01/29
*/
0x1f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
/* 0x17, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, */
#endif

/*****************/
/* Ｈ:操作 70-79 */
/*****************/
#if defined(JPN)
 #if 0 /* (PRO_ENERGY_SAVE == ENABLE) 見送る */ /* 頻繁に24VOnOffが起こり、リレーの寿命が持たない対策 2002/11/29 T.Takagi */
//0x62, 0x60, 0x6c, 0x02, 0x04, 0x05, 0x08, 0x13, 0x17, 0x0A,	/* ５分タイマー初期化 */
 #else
  #if defined(HINOKI3)	/* 通信管理レポート降順プリント初期値ON by K.Watanabe 2004/12/09 */
/*0x66, 0x60, 0x6c, 0x02, 0x04, 0x00, 0x08, 0x13, 0x17, 0x0A,*/
0x66, 0x68, 0x6c, 0x02, 0x04, 0x00, 0x08, 0x13, 0x17, 0x0A,	/* ジャーナル定形サイズカットする by K.Watanabe 2005/01/05 */
  #else
0x62, 0x60, 0x6c, 0x02, 0x04, 0x00, 0x08, 0x13, 0x17, 0x0A,
  #endif
 #endif
#else
 #if 0 /* (PRO_ENERGY_SAVE == ENABLE) 見送る */	/* 頻繁に24VOnOffが起こり、リレーの寿命が持たない対策 2002/11/29 T.Takagi */
/*	0x62, 0x60, 0x6c, 0x02, 0x04, 0x05, 0x00, 0x00, 0x00, 0x00,	*//* ５分タイマー初期化 */
 #else
0x62, 0x60, 0x6c, 0x02, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00,		/* メモリオーバメッセージＯｎ 1999/03/12 by H.Hirao */
 #endif
#endif

/*******************/
/* Ｉ:その他 80-89 */
/*******************/
#if defined (HINOKI2) && defined(JPNNTT)	/* 音声応答デフォルトON(PRO_VOICE_ANSWER) by J.Kishida 2002/09/17 */
0x00, 0x00, 0x00, 0x20, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00,
#elif defined(JPN)
 #if (PRO_POST_OFFICE == ENABLE)	/* 郵政局特ROM by O.Kimoto 2001/01/21 */
0x00, 0x00, 0x00, 0x00, 0x05, 0x00, 0x00, 0x04, 0x00, 0x00,
 #else
0x00, 0x00, 0x00, 0x00, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00,
 #endif
#elif defined(HINOKI3)
0x00, 0x00, 0x00, 0x20, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00,
#else
0x00, 0x00, 0x00, 0x00, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00,
#endif

/*******************/
/* Ｊ:その他 90-99 */
/*******************/
	#if (0)
	/* 回転受信用初期値が入っていなかった By O.Kimoto 1998/04/09 */
	0x00, 0x00, 0x00, 0x96, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,	/* J:3 0x00 -> 0x96 By M.Tachibana 1998/03/06 */
	#else
	/* 0x00, 0x00, 0x00, 0x96, 0x00, 0x00, 0x01, 0x14, 0x00, 0x00,	@* J:3 0x00 -> 0x96 By M.Tachibana 1998/03/06 */
	/* 0x00, 0x00, 0x00, 0x96, 0x00, 0x0C, 0x01, 0x14, 0x00, 0x00,	@* J:5 0x00 -> 0x0C by H.Hirao 1999/04/23 */
	0x00, 0x00, 0x00, 0x96, 0x30, 0x0C, 0x01, 0x14, 0x00, 0x00,	/* J:4 0x00 -> 0x30 by H.Hirao 1999/05/06 */
	#endif
};

/************************************************************************
 * 保守用スイッチの初期値												*
 * unsigned char SYB_MaintenanceSwitch[SYS_MEMORY_SWITCH_MAX]			*
 * 1996/03/06															*
 * 江口																	*
 ************************************************************************/
CONST UBYTE MaintenanceSwInitialTable[SYS_MEMORY_SWITCH_MAX] = {
/*****************/
/* Ａ:       0-9 */
/*****************/
0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x31,

/*****************/
/* Ｂ:     10-19 */
/*****************/
0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x40, 0xA6,
/* 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, DCS-TCF間時間調整 1997/06/02  By T.Yamaguchi */

/*****************/
/* Ｃ:     20-29 */
/*****************/
0x20, 0x00, 0x00, 0x1B, 0x32, 0x00, 0x01, 0x3D, 0x14, 0x10,

/*****************/
/* Ｄ:     30-39 */
/*****************/
0x0F, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
/* 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, キャリアダウン時間設定DEUは６秒 1997/06/04  By T.Yamaguchi */

/*****************/
/* Ｅ:     40-49 */
/*****************/
0x00, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,

/*****************/
/* Ｆ:     50-59 */
/*****************/
/* 7-4:0N アリロシフト対策 By Y.Suzuki 1998/03/03 */
0x00, 0x90, 0x00, 0x00, 0x00, 0x00, 0x00, 0x1B, 0x00, 0x00,

/*****************/
/* Ｇ:     60-69 */
/*****************/
0x00, 0x00, 0x10, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
/* 0x00, 0x00, 0x00, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, G:2-4 クラス１フロー制御の初期値をハードフローにする by H.Hirao 1999/04/02 */
/* 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, G:3-6,7 Add R288F Volume Control 1998/10/16 H.Hirao */
/* 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, G:3-1 未使用にしました 1998/04/28 by T.Soneoka */

/*****************/
/* Ｈ:     70-79 */
/*****************/
/* 0x0F, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0A, 0x19, 0x00,*/ /* ＲＬ＜－－＞イメージ変換処理の内蔵／外ＲＯＭ切り替え By O.Kimoto 1998/11/20 */
/* 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0A, 0x19, 0x00,*/ /* 京セラＴＨＰ不具合対応 H2:00->2e H3:00->32  1998/12/21 by T.Soneoka */
/* 0x00, 0x00, 0x2e, 0x32, 0x00, 0x00, 0x00, 0x0A, 0x19, 0x00,*/ /* リストプリントは巻き物にする（ジャーナル／Ｒ２８８Ｆステータスモニター by O.Kimoto 1999/01/29 */

/* 0x00, 0x03, 0x2e, 0x32, 0x00, 0x00, 0x00, 0x0A, 0x19, 0x00, */ 
/* 0x00, 0x03, 0x2e, 0x32, 0x00, 0x00, 0x00, 0x0A, 0x01, 0x36, */	/* Endmark2 by O.kimoto 1999/02/11 */
/* 0x00, 0x03, 0x2e, 0x32, 0x00, 0x00, 0x04, 0x04, 0x01, 0x36, */	/* 騒音対策で初期値を変えます */
/* 0x04, 0x03, 0x2e, 0x32, 0x00, 0x00, 0x04, 0x04, 0x01, 0x36, */	/* 騒音対策（Image To RL 変換を外ＲＯＭでする） By O.Kimoto 1999/03/01 */
/* 0x00, 0x03, 0x2e, 0x32, 0x00, 0x00, 0x04, 0x44, 0x01, 0x36, */	/* 騒音対策（モータ起動をプリントより５ｍｓ先に回すのを初期値とする  1999/03/02 by T.Soneoka */
#if defined(TWN)
 #if defined(HINOKI2) || defined(HINOKI3)	/* HINOKI2 TWN では原稿蓄積時の表示をJPNと同様にする 2002/07/23 T.Takagi */
0x00, 0x03, 0x2e, 0x32, 0x00, 0x00, 0x01, 0x42, 0x01, 0x36,			/* 原稿蓄積時のＬＣＤ表示をＴＷＮタイプにする H:5 0x00 -> 0x02 by H.Hirao 1999/03/18 */
 #else
0x00, 0x03, 0x2e, 0x32, 0x00, 0x02, 0x01, 0x42, 0x01, 0x36,			/* 原稿蓄積時のＬＣＤ表示をＴＷＮタイプにする H:5 0x00 -> 0x02 by H.Hirao 1999/03/18 */
 #endif
#else
 #if defined(HINOKI3) || defined(HINOKI2)	/* HINOKI3ではジャーナルA4分割プリントが初期値です by K.Watanabe 2004/10/15 */
  #if defined(HINOKI2) && defined(JPNNTT)	/* 新ＣＣＤ対応 by Y.Kano 2005/01/15 */
   #if (1)		/* 修正 ５バイト目の値を ０ｘ００に戻す。by Y.kano 2005/01/21 */
0x00, 0x03, 0x2e, 0x32, 0x00, 0x00, 0x01, 0x42, 0x01, 0x36,
   #else
0x00, 0x03, 0x2e, 0x32, 0x00, 0x04, 0x01, 0x42, 0x01, 0x36,	/* H:5-2 0x00 -> 0x04 */
   #endif
  #else
0x00, 0x03, 0x2e, 0x32, 0x00, 0x00, 0x01, 0x42, 0x01, 0x36,
  #endif
 #endif
#endif

/*****************/
/* Ｉ:   　80-89 */
/*****************/
0x22, 0x23, 0x25, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,

/*****************/
/* Ｊ:   　90-99 */
/*****************/
0x40, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
/* 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, debug complete by H.Hirao 1998/11/17 */

};


/*----------------------------------------------*/
/*ハードディップスイッチが付いている機械かどうか*/
/*----------------------------------------------*/
#if defined(AP)	/* By H.Y 1995/02/03 */
CONST UBYTE HardDIP_SwitchEnable = 1;
#else
CONST UBYTE HardDIP_SwitchEnable = 0;
#endif

/* スクランブルあり・なし用 By Y.Suzuki 1997/09/01 */
#if (0) /* (PRO_CIPHER == ENABLE) */ /* Deleted by H.Kubo 1998/03/31 */
CONST UBYTE ScrambleOn = 0;
#endif

#pragma section

#pragma section SPECIAL_ROM		/* 特ＲＯＭセクション指定 */
/* address 0x2004C0 */
#if defined(JPN)

CONST UBYTE ROM_SW_SpecialRelayTrans = 0;	/* 折り返し特ＲＯＭ */				/* address 0x2004C0 */
CONST UBYTE ROM_SW_SpecialPauseInput = 0;	/* ダイアル記号キーにポーズ追加 */	/* address 0x2004C1 */
CONST UBYTE ROM_SW_SpecialDoctorReport = 0;	/* 医師会特ＲＯＭ */				/* address 0x2004C2 */

 #if (PRO_POST_OFFICE == ENABLE)
  /* 以下の変数は本来はSYSMAX.Hの中で宣言されていたものですが、郵政局の特ROMでジャーナルをA41枚に収めてほしい
  ** という特ROM依頼がありました。この郵政局の特ROMはよく来るので、今後のことも考えて、ROMスイッチとしておきます。
  ** また、本来は上記にあるROMスイッチに見習って名前を付けるべきなのでしょうが、そうすると変更対象ファイルが
  ** 増えるので、やむを得ず下記のような対応としておきます。
  ** By O.Kimoto 2001/01/22 */
	CONST UBYTE SYS_JOURNAL_MAX = 30;		/* address 0x2004c3 */
 #else
	CONST UBYTE ROM_SW_DUMMY60 = 0;		/* PRO_POST_OFFICE == ENABLEでSYS_JOURNAL_MAXを定義しているのでべたで定義するとずれる為Dummyで領域確保 */
 #endif

/*
** 今後の特ＲＯＭのために予約しておきます（ROM_Switch[]のシンボルは参照してません）
** 特ＲＯＭ用のＲＯＭスイッチを追加する場合、配列数を減らして、個別のシンボルを
** この上に追加してください by H.Hirao
*/
 #if (0)	/* PRO_POST_OFFICEがENABLE/DISABLEにかかわらず領域を固定する為に記述を変更 By O.Kimoto 2002/06/17 */
**   #if (PRO_POST_OFFICE == ENABLE)
** CONST UBYTE ROM_SW_SpecialDailyPolling = 0;	/* 毎日ポーリングＲＯＭ */			/* address 0x2004C4 *//* Add By O.Kimoto 2002/06/17 */
** CONST UBYTE ROM_Switch[58] = {0};	/* Change 60 -> 59 中国郵政局特ROM By O.Kimoto 2001/01/22 *//* Change 59 -> 58 毎日ポーリング By O.Kimoto 2002/06/17 */
**   #else
** CONST UBYTE ROM_SW_DUMMY60 = 0;		/* PRO_POST_OFFICE == ENABLEでSYS_JOURNAL_MAXを定義しているのでべたで定義するとずれる為Dummyで領域確保 */
** CONST UBYTE ROM_SW_SpecialDailyPolling = 0;	/* 毎日ポーリングＲＯＭ */			/* address 0x2004C4 *//* Add By O.Kimoto 2002/06/17 */
** CONST UBYTE ROM_Switch[59] = {0};	/* Change 60 -> 59 毎日ポーリング By O.Kimoto 2002/06/17 */
**   #endif
 #else

CONST UBYTE ROM_SW_SpecialDailyPolling = 0;	/* 毎日ポーリングＲＯＭ */			/* address 0x2004C4 *//* Add By O.Kimoto 2002/06/17 */
CONST UBYTE ROM_SW_OptionalSpeedDial = 0;	/* スギ薬局特ROM（任意短縮）2003/01/06 T.Takagi */ /* address 0x2004C5 */
CONST UBYTE ROM_Switch[57] = {0};	/* Change 60 -> 59 中国郵政局特ROM By O.Kimoto 2001/01/22 *//* Change 59 -> 58 毎日ポーリング By O.Kimoto 2002/06/17 *//* Change 58 -> 57 スギ薬局特ROM 2003/01/06 T.Takagi */

 #endif



#else
CONST UBYTE ROM_Switch[63] = {0};
#endif

#pragma section
