/*
 *	@(#)$Id: PRT_TBL.C,v 1.1.1.1 2005/04/04 04:24:06 mi93007 Exp $
 *	FileName:	/home2/prj/Eva/Src/inc/prt_tbl.h
 *	Create:	Thu Apr 09 21:17:59 1998	by	ishiyama
 *	Description:
 *		Printer Table Header File
 *	Change Log:
 *		
 */
#ifndef	PRT_TBL_H
	#define PRT_TBL_H

#include "\src\atlanta\define\product.h"
#include "\src\atlanta\define\std.h"
#include "\src\atlanta\define\sysdoc.h"
 #if defined(SATSUKI2) /* SMuratec H.C.H 2003.07.11 */
#include "\src\atlanta\satsuki2\define\scn_def.h"
 #else
#include "\src\atlanta\hinoki\define\scn_def.h"
 #endif
#include "\src\atlanta\prt\iu_therm\define\prt_drv.h"
#include "\src\cpu\sh7043_a\irom\define\sh_port.h"
/*
 *	一度に DMA かけるサイズ
 *		32 Line 単位でないとスムージングに影響がある
 *		最大値は、CPU SH7014 の DMAC の制限のため、0xffff + 1 = 0x0000
 *		この値を大きくするほど、DMA 起動が間にあわなかったときの
 *		画像に対する影響は少ない。
 */
CONST UDWORD	PrinterDmaMaxSize = 32 * (1728 / 16); /* @@@@@@ テストのため最少値に設定 */

CONST UBYTE	PrinterWhiteMaskWidth = 0;			/* 両端白マスク幅(mm) */

/*
 *	記録紙の長さ
 */
CONST UWORD	PaperLength[] = {
	/* 15.4 line/mm 換算ライン数 */
	0,									/* PAPER_SIZE_NONE */
	(SYS_A4_PAGE_LENGTH * 4),				/* PAPER_SIZE_A4(297.0mm) */
	(SYS_LETTER_PAGE_LENGTH * 4),			/* PAPER_SIZE_LETTER(279.4mm) */
	(SYS_LEGAL_PAGE_LENGTH * 4),			/* PAPER_SIZE_LEGAL(355.6mm) */
	(SYS_F4_PAGE_LENGTH * 4),				/* PAPER_SIZE_F4(330.0mm) */
};

/*
 *	縮小率
 *		SettingStatus から、実際の縮小率(%)に変換
 */
CONST UBYTE	ReductionParam2Value[] = {
	0,									/* 自動縮小 */
	100,								/* 固定縮小率１(100%) */
	97,									/* 固定縮小率2(97%) */
	91,									/* 固定縮小率3(91%) */
	81,									/* 固定縮小率4(81%) */
	75,									/* 固定縮小率5(75%) */
	75,									/* for Fail Safe */
};



/* 主走査方向縮小パターン */
CONST UWORD	HReductionPattern[26][6] = {
	{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000}, /* 100% */
	{0x0001,0x0000,0x0000,0x0000,0x0000,0x0000}, /* 99% */
	{0x0001,0x0000,0x0000,0x0001,0x0000,0x0000}, /* 98% */
	{0x0001,0x0000,0x0001,0x0000,0x0001,0x0000}, /* 97% */
	{0x0001,0x0100,0x0000,0x0001,0x0100,0x0000}, /* 96% */
	{0x0001,0x0010,0x0100,0x0400,0x0200,0x0000}, /* 95% */
	{0x0001,0x0001,0x0001,0x0001,0x0001,0x0001}, /* 94% */
	{0x4001,0x1000,0x0400,0x0080,0x0020,0x0008}, /* 93% */
	{0x1001,0x0100,0x0010,0x1001,0x0100,0x0010}, /* 92% */
	{0x0801,0x0040,0x0801,0x0040,0x0801,0x0040}, /* 91% */
	{0x0401,0x2010,0x0080,0x0401,0x2010,0x0080}, /* 90% */
	{0x0201,0x0804,0x1008,0x4020,0x8040,0x0100}, /* 89% */
	{0x0101,0x0101,0x0101,0x0101,0x0101,0x0101}, /* 88% */
	{0x0101,0x0101,0x0101,0x0101,0x0101,0x0101}, /* 87%(GateArray の都合で 88% と同じ */
	{0x8101,0x4080,0x2020,0x1010,0x0408,0x0204}, /* 86% */
	{0x4081,0x1020,0x0408,0x4081,0x1020,0x0408}, /* 85% */
	{0x2081,0x0410,0x2081,0x0410,0x2081,0x0410}, /* 84% */
	{0x1041,0x4104,0x0410,0x1041,0x4104,0x0410}, /* 83% */
	{0x0841,0x1082,0x2104,0x4208,0x8410,0x0820}, /* 82% */
	{0x0841,0x0841,0x0841,0x0841,0x0841,0x0841}, /* 81% */
	{0x0841,0x8421,0x4210,0x2108,0x1084,0x0842}, /* 80% */
	{0x8421,0x2110,0x1084,0x8421,0x2110,0x1084}, /* 79% */
	{0x4421,0x1048,0x4421,0x1088,0x4421,0x1088}, /* 78% */
	{0x4221,0x8844,0x1108,0x4221,0x8844,0x1108}, /* 77% */
	{0x2221,0x4422,0x4444,0x8888,0x1088,0x1111}, /* 76% */
	{0x1111,0x1111,0x1111,0x1111,0x1111,0x1111}, /* 75% */
};

/* 副走査方向縮小パターン */
CONST UWORD	VReductionPattern[26][2] = {
	{0x0000,0x0000},					/* 100% */
	{0x0001,0x0000},					/* 99% */
	{0x0001,0x0001},					/* 98% */
	{0x0801,0x0020},					/* 97% */
	{0x0101,0x0101},					/* 96% */
	{0x2081,0x0408},					/* 95% */
	{0x0841,0x0841},					/* 94% */
	{0x4221,0x0884},					/* 93% */
	{0x1111,0x1111},					/* 92% */
	{0x4891,0x1224},					/* 91% */
	{0x2491,0x2491},					/* 90% */
	{0x9249,0x4924},					/* 89% */
	{0x4949,0x4949},					/* 88% */
	{0x4949,0x4949},					/* 87%(GateArray の都合で 88% と同じ */
	{0xa529,0x5294},					/* 86% */
	{0x54a9,0x5a49},					/* 85% */
	{0xaaa9,0x5554},					/* 84% */
	{0x5555,0x5555},					/* 83% */
	{0xd555,0xaaaa},					/* 82% */
	{0xaad5,0xaad5},					/* 81% */
	{0xd6b5,0xab5a},					/* 80% */
	{0xb5b5,0xb5b5},					/* 79% */
	{0xdb6d,0x6db6},					/* 78% */
	{0xdb6d,0xdb6d},					/* 77% */
	{0x76ed,0xddbb},					/* 76% */
	{0xdddd,0xdddd},					/* 75% */
};


/* for Rx Motor */
#if defined(SATSUKI2)	/* ＳＡＴＳＵＫＩ２モーター設定 by Y.Kano 2003/07/09 */
CONST UWORD	InitGaRmr = 0x0000;

/* 0:	RX_MOTOR_NORMAL 200pps 1Step Normal印字 2度書き  副走査3.85line/mm */
CONST struct ThroughUpDown RxMotorUpDownNormal[] = {
  #if (0) /* ＮＯＲＭ 白抜け対策 ２相から１－２相に変えます 並川からの依頼 1999/02/08 by T.Soneoka */
**	{RMSPED400|RMSTEP2|RMSEL_2, 0, 2,}
  #else
  
/* 移植 by SMuratec K.W.Q 2003/07/24 */
/*	{RMSPED800|RMSTEP4|RMSEL_1_2, 0, 4,}*/
	{RMSPED400|RMSTEP4|RMSEL_1_2, 0, 4,}
	
  #endif
};

/* 1:	RX_MOTOR_FINE 200pps 1Step Fine印字 	   副走査7.7line/mm */
CONST struct ThroughUpDown RxMotorUpDownFine[] = {
  #if (0) /* 200 2相から400 1-2相に変えます 騒音対策のからみ */
**	{RMSPED400|RMSTEP2|RMSEL_2, 0, 2,}
  #else
  
/* 移植 by SMuratec K.W.Q 2003/07/24 */
/*	{RMSPED800|RMSTEP4|RMSEL_1_2, 0, 4,}*/
	{RMSPED400|RMSTEP4|RMSEL_1_2, 0, 4,}
  
  #endif
};

/* 2:	RX_MOTOR_SFINE 100pps 1Step SuperFine印字 副走査15.4line/mm */
CONST struct ThroughUpDown RxMotorUpDownSFine[] = {
/* 
** 騒音対策 
** 200pps 1-2相に変更します 100pps 2相に比べて3db程静かになります
** SAKURAと同じ
** 1999/01/12 by T.Soneoka
*/

/* 移植 by SMuratec K.W.Q 2003/07/24 */
#if (0)
**  #if (0)
**	{RMSPED200|RMSTEP2|RMSEL_2, 0, 1,}
**  #else
**    #if (0) /* ＳＦＩＮＥだけ、最小記録紙長が違う不具合 1999/1/28 by T.Soneoka */
**	{RMSPED200|RMSTEP2|RMSEL_1_2, 0, 1,}
**    #else
**	{RMSPED400|RMSTEP4|RMSEL_1_2, 0, 4,}
**    #endif
**  #endif
#else  
    #if (0) /* ＳＦＩＮＥだけ、最小記録紙長が違う不具合 1999/1/28 by T.Soneoka */
**	{RMSPED200|RMSTEP2|RMSEL_1_2, 0, 1,}
    #else
	{RMSPED400|RMSTEP2|RMSEL_1_2, 0, 2,}		/* ジャムエラー防止としてカウント数を２に変更 by Y.Kano 2003/07/10 */
    #endif

#endif

};

/* 3:	RX_MOTOR_FORWARD 200pps 1Step */
CONST struct ThroughUpDown RxMotorUpDownFarward[] = {

/* 移植 by SMuratec K.W.Q 2003/07/24 */
/*	{RMSPED800|RMSTEP4|RMSEL_2, 0, 4,}*/
	{RMSPED800|RMSTEP8|RMSEL_2, 0, 4,}

};

/* 4:	RX_MOTOR_BACKWARD 200pps 1Step */
CONST struct ThroughUpDown RxMotorUpDownBackward[] = {

/* 移植 by SMuratec K.W.Q 2003/07/24 */
/*	{RMSPED800|RMSTEP4|RMSEL_2, 0, 4,}*/
	{RMSPED800|RMSTEP8|RMSEL_2, 0, 4,}
	
	
};
#else		/* ＳＡＴＳＵＫＩ２以外のモーター設定 by Y.Kano 2003/07/09 */
CONST UWORD	InitGaRmr = 0x0000;

/* 0:	RX_MOTOR_NORMAL 200pps 1Step Normal印字 2度書き  副走査3.85line/mm */
CONST struct ThroughUpDown RxMotorUpDownNormal[] = {
  #if (0) /* ＮＯＲＭ 白抜け対策 ２相から１－２相に変えます 並川からの依頼 1999/02/08 by T.Soneoka */
**	{RMSPED400|RMSTEP2|RMSEL_2, 0, 2,}
  #else
	{RMSPED400|RMSTEP2|RMSEL_1_2, 0, 2,}
  #endif
};

/* 1:	RX_MOTOR_FINE 200pps 1Step Fine印字 	   副走査7.7line/mm */
CONST struct ThroughUpDown RxMotorUpDownFine[] = {
  #if (0) /* 200 2相から400 1-2相に変えます 騒音対策のからみ */
**	{RMSPED400|RMSTEP2|RMSEL_2, 0, 2,}
  #else
	{RMSPED400|RMSTEP2|RMSEL_1_2, 0, 2,}
  #endif
};

/* 2:	RX_MOTOR_SFINE 100pps 1Step SuperFine印字 副走査15.4line/mm */
CONST struct ThroughUpDown RxMotorUpDownSFine[] = {
/* 
** 騒音対策 
** 200pps 1-2相に変更します 100pps 2相に比べて3db程静かになります
** SAKURAと同じ
** 1999/01/12 by T.Soneoka
*/
  #if (0)
**	{RMSPED200|RMSTEP2|RMSEL_2, 0, 1,}
  #else
    #if (0) /* ＳＦＩＮＥだけ、最小記録紙長が違う不具合 1999/1/28 by T.Soneoka */
**	{RMSPED200|RMSTEP2|RMSEL_1_2, 0, 1,}
    #else
	{RMSPED200|RMSTEP2|RMSEL_1_2, 0, 2,}
    #endif
  #endif
};

/* 3:	RX_MOTOR_FORWARD 200pps 1Step */
CONST struct ThroughUpDown RxMotorUpDownFarward[] = {
	{RMSPED400|RMSTEP2|RMSEL_2, 0, 2,}
};

/* 4:	RX_MOTOR_BACKWARD 200pps 1Step */
CONST struct ThroughUpDown RxMotorUpDownBackward[] = {
	{RMSPED400|RMSTEP2|RMSEL_2, 0, 2,}
};
#endif


CONST struct MotorCtrl RxMotorTable[RX_MOTOR_TABLE_MAX] = {
/* 0:	RX_MOTOR_NORMAL		Normal印字      副走査3.85line/mm */
	{ 
		&RxMotorUpDownNormal[0],
#if (0)	/* モータ非同期にする（こっちのほうがきれい） 1998/11/27 by T.Soneoka */
**		(RMSYNC|RMCW|RMEXCT),			/* Attribute */
#else

/* 移植 by SMuratec K.W.Q 2003/07/24 */
 #if (0)
  #if defined(SATSUKI2)	/* SATSUKI2 モータ逆転 by Y.Kano 2003/06/30 */
		(RMASYNC|RMCCW|RMEXCT),			/* Attribute */
  #else
		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
  #endif
 #else
		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
 #endif

#endif
		0,								/* ExtendAttribute */
	},
/* 1:	RX_MOTOR_FINE	Fine印字 	   副走査7.7line/mm */
	{
		&RxMotorUpDownFine[0],
/* SATSUKI2 モータ回転方向テスト by Y.Kano 2003/06/26 */

/* 移植 by SMuratec K.W.Q 2003/07/24 */
 #if (0)
  #if defined(SATSUKI2)	/* SATSUKI2 モータ逆転 by Y.Kano 2003/06/30 */
		(RMASYNC|RMCCW|RMEXCT),			/* Attribute */
  #else
		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
  #endif
 #else
 		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
 #endif
 
 		0,								/* ExtendAttribute */
	},
/* 2:	RX_MOTOR_SFINE	SuperFine印字 副走査15.4line/mm */
	{
		&RxMotorUpDownSFine[0],

/* 移植 by SMuratec K.W.Q 2003/07/24 */
#if (0)
 #if defined(SATSUKI2)	/* SATSUKI2 モータ逆転 by Y.Kano 2003/06/30 */
		(RMASYNC|RMCCW|RMEXCT),			/* Attribute */
 #else
		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
 #endif
#else
		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
#endif

		0,								/* ExtendAttribute */
	},
/* 3:	RX_MOTOR_FARWARD	*/
	{ 
		&RxMotorUpDownFarward[0],
		
/* 移植 by SMuratec K.W.Q 2003/07/24 */
#if (0)
  #if defined(SATSUKI2)	/* SATSUKI2 モータ逆転 by Y.Kano 2003/06/30 */
		(RMASYNC|RMCCW|RMEXCT),			/* Attribute */
  #else
		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
  #endif
#else
		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
#endif

 		0,								/* ExtendAttribute */
	},
/* 4:	RX_MOTOR_TO_BACKWARD */
	{ 
		&RxMotorUpDownBackward[0],

/* 移植 by SMuratec K.W.Q 2003/07/24 */
#if (0)
  #if defined(SATSUKI2)	/* SATSUKI2 モータ逆転 by Y.Kano 2003/06/30 */
		(RMASYNC|RMCCW|RMEXCT),			/* Attribute */
  #else
		(RMASYNC|RMCW|RMEXCT),			/* Attribute */
  #endif
#else
		(RMASYNC|RMCCW|RMEXCT),			/* Attribute */
#endif 

		0,								/* ExtendAttribute */
	},
};

#if defined(SATSUKI2)	/* SATSUKI2に合わせるため以下に変更します。2003/07/09 */
/*
 *	SATSUKI2 Printer記録紙搬送距離(Step は、1/15.4mm 換算値で表現)
 *			       (-) <----(0)----->(+)
 *	PS1 	  PlatenRoller  PS2        Cutter    ExstRoller
 *	 *           *           *           *           *
 *	 |<-358step->|<-xxxstep->|<-xxxstep->|<-xxxstep->|
 *      ???mm      11.51mm      14.51mm     0mm
 *                  *            *
 *                  ~<-印字位置  ~<-待機位置(PS2からPrintReadySteps分)
 */
CONST DWORD MinimumDocExitSteps			= 462;		/* 最小記録紙長排出ステップ/イニシャルカット 30mm(×30.8) */
CONST WORD FeedOutDocSteps				= 1;		/* 排出ステップ数 0でいいのでは？*/
CONST WORD BackWardStepError			= 924;		/* 60mm */

/* 移植 by SMuratec K.W.Q 2003/07/29 */
/* SATSUKI2もHINOKIと同じにする。by Y.Kano 2003/07/26 */
CONST WORD BackWardStepErrorFromReady	= 462;		/* 30mm引き戻してもPS2がOFFしない場合はカットエラー */
/*CONST WORD BackWardStepErrorFromReady	= 308;	*/	/* 20mm引き戻してもPS2がOFFしない場合はカットエラー */
CONST WORD PrintReadySteps				= 130;		/* 印字待機位置 PS2から8.5のところ 先端*/
CONST WORD PrintPostionSteps			= -(123-61);/* 印字位置 PS2から8mm分引き戻しす *//* 先端余白=4mm */
CONST WORD ToCutPosFromPlatenSteps		= 462;		/* 印字終了からカット位置までの距離 11.5+14.5+後端余白4mm = 30mm */
CONST DWORD JAM_CheckSteps 				= 462;		/* JAM Check Step 印字開始からCutter位置からPS2 30mm */
CONST WORD PrintingToFeedOutDocSteps	= 802;		/* 印字位置からの記録紙排出ステップ 11.5+14.51=26.2mm */
CONST DWORD Print3M_Over				= 46200;	/* ３ｍ印字オーバ 3000mm*15.4 */
CONST WORD COUNT_CUT_BACK_STEP 			= (-77);	/* 5mm分引き戻し 5/(1/15.4)=154step B4紙カット時に端がいたむ不具合 */
CONST WORD COUNT_CUTTER_TO_PS2			= 223;		/* 14.51mm * 15.4 */
CONST WORD COUNT_FEED_OUT				= 308;		/* 20.00mm * 15.4 */
CONST WORD COUNT_BOTTOM_MARGIN			= 61;		/*   4.0mm * 15.4 */

#else /* HINOKI、HINOKI2 */
/*
 *	HINOKI Printer記録紙搬送距離(Step は、1/15.4mm 換算値で表現)
 *			       (-) <----(0)----->(+)
 *	PS1 	  PlatenRoller  PS2        Cutter    ExstRoller
 *	 *           *           *           *           *
 *	 |<-358step->|<-188step->|<-188step->|<-1155step->|
 *      23.2mm      12.1mm      12.2mm       75mm
 *                  *            *
 *                  ~<-印字位置  ~<-待機位置(PS2からPrintReadySteps分)
 */
 #if (0) /* F340実機での長さにあわせました */
**CONST WORD MinimumDocExitSteps			= 2310;				/* １５０ｍｍにしときます 最小記録紙長排出ステップ */
 #else
  #if (0) /* プリント原稿３ｍ以上に対応 1999/02/02/by T.Soneoka */
**	CONST WORD MinimumDocExitSteps			= 1925;				/* １２５ｍｍ 最小記録紙長排出ステップ */
  #else
	CONST DWORD MinimumDocExitSteps			= 1925;				/* １２５ｍｍ 最小記録紙長排出ステップ */
  #endif
 #endif
CONST WORD FeedOutDocSteps				= 616;				/* 排出ステップ数 */
CONST WORD BackWardStepError			= (1155+188+186);
CONST WORD BackWardStepErrorFromReady	= 462;				/* ３０ｍｍ引き戻してもＰＳ２がＯＦＦしない場合はカットエラー */
CONST WORD PrintReadySteps				= 154;				/* 印字待機位置 ＰＳ２から１０ｍｍのところ */
CONST WORD PrintPostionSteps			= -(188-62);		/* 印字位置 ＰＳ２から８ｍｍ分引き戻しす *//* 先端余白＝４ｍｍ */
CONST WORD ToCutPosFromPlatenSteps		= (188+188+62);		/* 印字終了からカット位置までの距離 *//* 後端余白＝４ｍｍ */
 #if (0) /* プリント原稿３ｍ以上に対応 1999/02/02/by T.Soneoka */
**CONST WORD JAM_CheckSteps 				= (188+188+62);		/* ＪＡＭチェックステップ 印字開始からＣＵＴＴＥＲ位置からＰＳ２をチェックします */
 #else
	CONST DWORD JAM_CheckSteps 				= (188+188+62);		/* ＪＡＭチェックステップ 印字開始からＣＵＴＴＥＲ位置からＰＳ２をチェックします */
 #endif
CONST WORD PrintingToFeedOutDocSteps	= ((188+188+1155)-(188+154));	/* 印字位置からの記録紙排出ステップ */
 #if (0) /* プリント原稿３ｍ以上に対応 1999/02/02/by T.Soneoka */
**CONST UWORD Print3M_Over				= 46200;				/* ３ｍ印字オーバ 3000mm*15.4 */
 #else
	CONST DWORD Print3M_Over				= 46200;				/* ３ｍ印字オーバ 3000mm*15.4 */
 #endif
CONST WORD COUNT_CUT_BACK_STEP = (-77);	/* 5mm分引き戻し 5/(1/15.4)=77step Ｂ４記録紙カット時、記録紙の端がいたむ不具合  1999/11/22 by T.Soneoka */
/* EndMark By O.Kimoto 1999/02/09 */
CONST WORD COUNT_CUTTER_TO_PS2		= 188;	/* 12.2mm * 15.4 */
CONST WORD COUNT_FEED_OUT			= 616;	/* 40.0mm * 15.4 */
CONST WORD COUNT_BOTTOM_MARGIN		=  61;	/*  4.0mm * 15.4 */

#endif

CONST UBYTE	PsChatCount = 10;		/* PaperSensor チャタリング防止用カウント値 */
/*
 *	PS1 については、ゆっくりカセットを引きぬいた場合、
 *	一瞬 ON になることがあるため、紙なしから紙ありになるとき
 *	ヒステリシスを持たすようにした。
 */
CONST UWORD	Ps1Exist2NonCount = 10;		/* PaperSensor チャタリング防止用カウント値 */
CONST UWORD	Ps1Non2ExistCount = 500;	/* PaperSensor チャタリング防止用カウント値 */

CONST UBYTE	AbnormalStrobeCount = 5;	/* 連続印可でエラーにする回数 */

/* ８ｂｉｔ換算 */
CONST UWORD	HighTempUpper[2] = {0x68, 0x6c};	/* サーマルヘッド サーミスタ これ以上ならReady */
CONST UWORD	HighTempLower[2] = {0x48, 0x58};	/* サーマルヘッド サーミスタ これ以下になったらPlese wait */

CONST UDWORD	InkInitialCount = 308000 - 462; /* (200m - 30mm) x 15.4 */

/*
 *	Strobe Pulse
 */
CONST UBYTE	StrobeOffset = 0x00;		/*  for test Strobe Pulse offsett */

CONST UBYTE	StrobeNormal[2][256] = {
	{
		  6,  6,  6,  6, 12, 12, 12, 12,
		 18, 18, 18, 18, 24, 24, 24, 24,
		 31, 31, 31, 31, 38, 38, 38, 38,
		 44, 44, 44, 44, 50, 50, 50, 50,
		 58, 58, 58, 58, 64, 64, 64, 64,
		 70, 70, 70, 70, 77, 77, 77, 77,
		 83, 83, 83, 83, 90, 90, 90, 90,
		 96, 96, 96, 96,103,103,103,103,
		109,109,109,109,115,115,115,115,
		122,122,122,122,128,128,128,128,
		133,133,133,133,135,135,135,135,
		140,140,140,140,144,144,144,144,
		147,147,147,147,150,150,150,150,
		154,154,154,154,157,157,157,157,
		161,161,161,161,164,164,164,164,
		167,167,167,167,172,172,172,172,
		175,175,175,175,180,180,180,180,
		185,185,185,185,190,190,190,190,
		195,195,195,195,200,200,200,200,
		205,205,205,205,208,208,208,208,
		214,214,214,214,216,216,216,216,
		218,218,218,218,223,223,223,223,
		226,226,226,226,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
	},
	{
#if (0) /* 中西さんからの変更依頼 1998/12/16 by T.Soneoka */
**		  6,  6,  6,  6, 12, 12, 12, 12,
**		 18, 18, 18, 18, 24, 24, 24, 24,
**		 31, 31, 31, 31, 38, 38, 38, 38,
**		 44, 44, 44, 44, 50, 50, 50, 50,
**		 58, 58, 58, 58, 64, 64, 64, 64,
**		 70, 70, 70, 70, 77, 77, 77, 77,
**		 83, 83, 83, 83, 90, 90, 90, 90,
**		 96, 96, 96, 96,103,103,103,103,
**		109,109,109,109,115,115,115,115,
**		122,122,122,122,128,128,128,128,
**		133,133,133,133,139,139,139,139,
**		145,145,145,145,150,150,150,150,
**		155,155,155,155,159,159,159,159,
**		164,164,164,164,169,169,169,169,
**		174,174,174,174,178,178,178,178,
**		182,182,182,182,187,187,187,187,
**		191,191,191,191,196,196,196,196,
**		201,201,201,201,206,206,206,206,
**		211,211,211,211,216,216,216,216,
**		221,221,221,221,225,225,225,225,
**		229,229,229,229,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230
#else
		  6,  6,  6,  6, 12, 12, 12, 12,
		 18, 18, 18, 18, 24, 24, 24, 24,
		 31, 31, 31, 31, 38, 38, 38, 38,
		 44, 44, 44, 44, 50, 50, 50, 50,
		 58, 58, 58, 58, 64, 64, 64, 64,
		 70, 70, 70, 70, 77, 77, 77, 77,
		 83, 83, 83, 83, 90, 90, 90, 90,
		 96, 96, 96, 96,103,103,103,103,
		109,109,109,109,115,115,115,115,
		122,122,122,122,128,128,128,128,
		133,133,133,133,139,139,139,139,
		145,145,145,145,150,150,150,150,
		155,155,155,155,159,159,159,159,
		164,164,164,164,169,169,169,169,
		174,174,174,174,178,178,178,178,
		182,182,182,182,187,187,187,187,
		191,191,191,191,196,196,196,196,
		201,201,201,201,206,206,206,206,
		211,211,211,211,216,216,216,216,
		221,221,221,221,225,225,225,225,
		229,229,229,229,231,231,231,231,
		233,233,233,233,235,235,235,235,
		237,237,237,237,239,239,239,239,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240
#endif
	}
};
CONST UBYTE	StrobeFine[2][256] = {
	{
/*		0,	0,	0,	0,	0,	0,	0,	0,*/	/* テスト用 by Y.Kano 2003/09/17 */
/*		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		0,	0,	0,	0,	0,	0,	0,	0,
		3,	7,	11,	15,	18,	22,	26,	30,
		35,	40,	45,	50,	53,	57,	61,	65,
		68,	71,	74,	78,	83,	88,	93,	98,
		103,108,113,118,122,126,130,135,
		143,152,161,170,172,175,177,180,
		182,185,187,190,191,192,193,195,
		196,197,198,200,201,202,203,205,
		206,207,208,210,211,212,213,215,
		217,219,221,224,224,225,226,227,
		227,228,229,230,230,231,232,233,
		233,234,234,235,235,236,236,237,
		237,238,238,239,239,240,240,241,
		242,243,244,245,245,245,245,245,
		245,245,245,245,245,245,245,245,
		245,245,245,245,245,245,245,245,
		245,245,245,245,245,245,245,245,
		245,245,245,245,245,245,245,245,
		245,245,245,245,245,245,245,245,
		245,245,245,245,245,245,245,245,
		245,245,245,245,245,245,245,245,*/
		  6,  6,  6,  6, 12, 12, 12, 12,
		 18, 18, 18, 18, 24, 24, 24, 24,
		 31, 31, 31, 31, 38, 38, 38, 38,
		 44, 44, 44, 44, 50, 50, 50, 50,
		 58, 58, 58, 58, 64, 64, 64, 64,
		 70, 70, 70, 70, 77, 77, 77, 77,
		 83, 83, 83, 83, 90, 90, 90, 90,
		 96, 96, 96, 96,103,103,103,103,
		109,109,109,109,115,115,115,115,
		122,122,122,122,128,128,128,128,
		133,133,133,133,135,135,135,135,
		140,140,140,140,144,144,144,144,
		147,147,147,147,150,150,150,150,
		154,154,154,154,157,157,157,157,
		161,161,161,161,164,164,164,164,
		167,167,167,167,172,172,172,172,
		175,175,175,175,180,180,180,180,
		185,185,185,185,190,190,190,190,
		195,195,195,195,200,200,200,200,
		205,205,205,205,208,208,208,208,
		214,214,214,214,216,216,216,216,
		218,218,218,218,223,223,223,223,
		226,226,226,226,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
		230,230,230,230,230,230,230,230,
	},
	{
#if (0) /* 中西さんからの変更依頼 1998/12/16 by T.Soneoka */
**		  6,  6,  6,  6, 12, 12, 12, 12,
**		 18, 18, 18, 18, 24, 24, 24, 24,
**		 31, 31, 31, 31, 38, 38, 38, 38,
**		 44, 44, 44, 44, 50, 50, 50, 50,
**		 58, 58, 58, 58, 64, 64, 64, 64,
**		 70, 70, 70, 70, 77, 77, 77, 77,
**		 83, 83, 83, 83, 90, 90, 90, 90,
**		 96, 96, 96, 96,103,103,103,103,
**		109,109,109,109,115,115,115,115,
**		122,122,122,122,128,128,128,128,
**		133,133,133,133,139,139,139,139,
**		145,145,145,145,150,150,150,150,
**		155,155,155,155,159,159,159,159,
**		164,164,164,164,169,169,169,169,
**		174,174,174,174,178,178,178,178,
**		182,182,182,182,187,187,187,187,
**		191,191,191,191,196,196,196,196,
**		201,201,201,201,206,206,206,206,
**		211,211,211,211,216,216,216,216,
**		221,221,221,221,225,225,225,225,
**		229,229,229,229,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230,
**		230,230,230,230,230,230,230,230
#else
		  6,  6,  6,  6, 12, 12, 12, 12,
		 18, 18, 18, 18, 24, 24, 24, 24,
		 31, 31, 31, 31, 38, 38, 38, 38,
		 44, 44, 44, 44, 50, 50, 50, 50,
		 58, 58, 58, 58, 64, 64, 64, 64,
		 70, 70, 70, 70, 77, 77, 77, 77,
		 83, 83, 83, 83, 90, 90, 90, 90,
		 96, 96, 96, 96,103,103,103,103,
		109,109,109,109,115,115,115,115,
		122,122,122,122,128,128,128,128,
		133,133,133,133,139,139,139,139,
		145,145,145,145,150,150,150,150,
		155,155,155,155,159,159,159,159,
		164,164,164,164,169,169,169,169,
		174,174,174,174,178,178,178,178,
		182,182,182,182,187,187,187,187,
		191,191,191,191,196,196,196,196,
		201,201,201,201,206,206,206,206,
		211,211,211,211,216,216,216,216,
		221,221,221,221,225,225,225,225,
		229,229,229,229,231,231,231,231,
		233,233,233,233,235,235,235,235,
		237,237,237,237,239,239,239,239,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240,
		240,240,240,240,240,240,240,240
#endif
	}
};
CONST UBYTE	StrobeSfine[2][256] = {
	{
		  5,  5,  5,  5, 10, 10, 10, 10,
		 15, 15, 15, 15, 20, 20, 20, 20,
		 26, 26, 26, 26, 32, 32, 32, 32,
		 37, 37, 37, 37, 43, 43, 43, 43,
		 49, 49, 49, 49, 54, 54, 54, 54,
		 60, 60, 60, 60, 65, 65, 65, 65,
		 71, 71, 71, 71, 77, 77, 77, 77,
		 82, 82, 82, 82, 88, 88, 88, 88,
		 93, 93, 93, 93, 98, 98, 98, 98,
		104,104,104,104,109,109,109,109,
		113,113,113,113,115,115,115,115,
		119,119,119,119,122,122,122,122,
		125,125,125,125,128,128,128,128,
		131,131,131,131,133,133,133,133,
		137,137,137,137,139,139,139,139,
		142,142,142,142,146,146,146,146,
		149,149,149,149,153,153,153,153,
		157,157,157,157,162,162,162,162,
		166,166,166,166,170,170,170,170,
		174,174,174,174,177,177,177,177,
		182,182,182,182,184,184,184,184,
		185,185,185,185,190,190,190,190,
		192,192,192,192,196,196,196,196,
		196,196,196,196,196,196,196,196,
		196,196,196,196,196,196,196,196,
		196,196,196,196,196,196,196,196,
		196,196,196,196,196,196,196,196,
		196,196,196,196,196,196,196,196,
		196,196,196,196,196,196,196,196,
		196,196,196,196,196,196,196,196,
		196,196,196,196,196,196,196,196,
		196,196,196,196,196,196,196,196
	},
	{
		  4,  4,  4,  4,  8,  8,  8,  8,
		 12, 12, 12, 12, 16, 16, 16, 16,
		 21, 21, 21, 21, 26, 26, 26, 26,
		 30, 30, 30, 30, 35, 35, 35, 35,
		 40, 40, 40, 40, 44, 44, 44, 44,
		 49, 49, 49, 49, 53, 53, 53, 53,
		 58, 58, 58, 58, 63, 63, 63, 63,
		 67, 67, 67, 67, 72, 72, 72, 72,
		 76, 76, 76, 76, 80, 80, 80, 80,
		 85, 85, 85, 85, 89, 89, 89, 89,
		 93, 93, 93, 93, 97, 97, 97, 97,
		101,101,101,101,107,107,107,107,
		112,112,112,112,118,118,118,118,
		123,123,123,123,129,129,129,129,
		133,133,133,133,135,135,135,135,
		138,138,138,138,142,142,142,142,
		144,144,144,144,148,148,148,148,
		151,151,151,151,155,155,155,155,
		158,158,158,158,162,162,162,162,
		165,165,165,165,168,168,168,168,
		171,171,171,171,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172,
		172,172,172,172,172,172,172,172
	}
};

#if defined(SATSUKI2)	/* SATSUKI2用ヒートテーブル by Y.Kano 2003/09/17 */
CONST UBYTE	PreHeatTable[256] = {
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  0,  0,  0,  0,  0,  0,  0,  0,
		  1,  2,  3,  5,  6,  8,  9, 11,
		 12, 14, 15, 17, 18, 20, 21, 23,
		 24, 26, 27, 29, 30, 32, 33, 35,
		 36, 38, 39, 41, 42, 44, 45, 47,
		 48, 50, 51, 53, 54, 56, 57, 59,
		 60, 62, 63, 65, 66, 68, 69, 71,
		 72, 74, 75, 77, 78, 79, 80, 82,
		 83, 84, 85, 87, 88, 89, 90, 92,
		 93, 94, 95, 97, 98, 99,100,102,
		103,104,105,106,107,108,109,110,
		111,112,113,114,115,116,117,118,
		119,120,121,122,122,123,124,125,
		125,126,127,128,128,129,130,131,
		131,132,133,134,134,135,136,137,
		137,138,139,140,140,141,142,143,
		143,144,145,146,146,147,148,149,
		149,150,151,152,152,153,153,154,
		154,155,155,156,156,157,157,158,
		158,159,159,160,160,161,161,162,
		162,163,163,164,164,165,165,166,
		166,167,167,168,168,169,169,170
};
#endif	/* defined(SATSUKI2)	*/




/* ＳＡＫＵＲＡからとってきました 1998/11/27 by T.Soneoka */
CONST UBYTE head_preheat = 0x2C;	/* ｻｰﾏﾙﾍｯﾄﾞ･ﾌﾟﾘﾋｰﾄ･ﾊﾟﾙｽ幅 */

CONST UBYTE OffsetA4 = 40; /* (2048(B4)-1728(A4))/8 */

CONST UBYTE PrintThoughUpTable[20] = {
#if (0) /* 1999/03/24 by T.Soneoka */
**	 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
#else
	20,19,18,17,16,15,14,13,12,11,10, 9, 8, 7, 6, 5, 4, 3, 2, 1,
#endif
}; /* 1998/12/16 by T.Soneoka */

CONST UBYTE PrintThoughDownTable[20] = {
#if (0) /* 1999/01/05 by T.Soneoka */
**	 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 3, 2, 1,
#else
	20,19,18,17,16,15,14,13,12,11,10, 9, 8, 7, 6, 5, 4, 3, 2, 1,
#endif
}; /* 1998/12/16 by T.Soneoka */

#endif /* PRT_TBL_H */
