/* ============================================================
 * 版权：    king 版权所有 (c) 2007
 * 文件：    IQuartersSummary.java
 * 创建日期： 2007-6-18 10:38:20
 * 功能：    {具体要实现的功能}
 * 所含类:   {包含的类}
 * 修改记录：
 * 日期                    作者         内容
 * =============================================================
 *  2007-6-18 10:38:20     王胜        创建文件，实现基本功能
 * ============================================================
 */
package org.king.summary.service;

import java.util.List;

public interface IQuartersSummaryService {

	public List getSummaryInfo();
}
