/*--------------------------------------------------------------------------*/
/*  プロジェクト : POPLAR/ANZU_L                                            */
/*  ファイル名   : SCD_DATA.C                                               */
/*  作成者       : 野瀬                                                     */
/*  日  付       : 96.10.12                                                 */
/*  概  要       : モニタテーブル                                           */
/*  修正履歴     : ソフトコーデック用変数を、高速ＳＲＡＭから内蔵ＲＡＭに   */
/*				   移動させる。by O.Kimoto 1998/08/27                       */
/*--------------------------------------------------------------------------*/
#include	"\src\atlanta\define\product.h"
/*#include	"\src\kobe\anzu\define\sysdoc.h"*/
#include	"\src\atlanta\define\message.h"

#if (PRO_CPU_VERSION == SH7043_A)
#include	"\src\cpu\sh7043_a\scd\define\scd.h"
#else
#include	"\src\atlanta\scd\define\scd.h"
#endif

/******************************/
/* 内部ＲＡＭに配置するデータ */
/******************************/
/* ｾｸｼｮﾝ名はﾒｲｸﾌｧｲﾙでつけています */
/* #pragma section SCDDATAI @* locate section name "DSCDDATAI" */

/*--------------------------*/
/* ＦＩＬＬ制御用パラメータ */
/*--------------------Y.S---*/
/*struct	FillCntlData	FillCntl = {0};*/

#if (0)		/*	By Y.Suzuki 1997/02/28	*/
** /*------------------------------*/
** /*	ダイレクトメモリ送信フラグ	*/
** /*---------------------------Y.S*/
** UBYTE DirectMemTxFlag = 0;	/* 1 byte */
#endif

/*--------------------------------------------------------------*/
/*	０．メモリ送信時、ハイパーファインからモード変更指示フラグ	*/
/*----------------------------------------------------------Y.S-*/
UBYTE ReductionFromHfine = 0;	/* 1 byte */

/*-----------------------------------------------*/
/* １．Byte と word データの操作  by S.Wang      */
/*-----------------------------------------------*/
/* ScdBWData ScdcEncData = {0}; ローカル変数にする struct CdcBlk へ By S.Wang 96/01/22 */
/* ScdBWData ScdcDecData = {0}; */

/*--------------------------*/
/*	１．ｿﾌﾄｺｰﾃﾞｯｸｴﾗｰフラグ	*/
/*-----------------------Y.S*/
UBYTE ScdcErrFlag = 0;	/* 1 byte */

/*------------------------------*/
/*	２．ﾒﾓﾘ受信1ﾍﾟｰｼﾞ終了ﾌﾗｸﾞ	*/
/*---------------------------Y.S*/
UBYTE ScdcPageEndFlag = 0;	/* 1 byte */

/*--------------------------------------*/
/*	３．ECM受信時ﾌﾞﾛｯｸEND検出用ﾊﾞｲﾄｶｳﾝﾀ	*/
/*--------------------------96/1/9--Y.S-*/
UBYTE ScdcEcmBufCnt = 0;	/* 1 byte */

/*--------------------------------------------------*/
/*	４．メモリデータリード中にＥＯＰがあらわれた。	*/
/* MemRead() の中でセットされる。					*/
/*						EOP :NG						*/
/*						DATA:OK						*/
/*--------------------------------------96/1/10 Y.S-*/
WORD MemReadStatus = 0;	/*  2byte */

/*--------------------------*/
/*	６．ﾀﾞｲﾚｸﾄﾒﾓﾘ送信フラグ	*/
/*---------------96/1/11 Y.S*/
UBYTE DirectMemTx = 0;	/* 1 byte */

/*--------------------------*/
/*	７．1ﾗｲﾝ送信ﾃﾞｰﾀｶｳﾝﾄ用	*/
/*---------------96/1/12 Y.S*/
UWORD LineByteCnt = 0;	/*  2 byte */

/*-------------------------------------------------------------------- */
/* ９．メモリＧ３受信タスク受信結果格納用大域変数 By Y.Suzuki 96/06/18 */
/*---------------------------------------------------------------------*/
UBYTE SCD_G3RxResult = 0;	/* 1 byte */

/*------------------------------------------*/
/*	１０．Ｇ３受信モデムＤＭＡ結果格納用	*/
/*------------------------------------------*/
UBYTE SCD_G3ReadStatus = 0;	/* 1 byte */

/*----------------------------------------*/
/* １１．ソフトコーデックメッセージ送信用 */
/*----------------------------------------*/
MESSAGE_t	SoftcodecMessage = {0};

/*-----------------------------------------------------------------------*/
/* ２３．Ｇ３受信時モデムバッファ［０］読み飛ばし By Y.Suzuki 1997/01/09 */
/*-----------------------------------------------------------------------*/
UBYTE DEBUG_SCD_MDM_BufferSkip = 0;

/*---------------------------------------------------*/
/* ２４．ダイレクトメモリ送信 By Y.Suzuki 1997/02/15 */
/*---------------------------------------------------*/
UBYTE SCD_DirectTx = 0;

/*------------------------------------------------------------*/
/* ２５．受信時にエラー検出した時、ＭＲ＿ＥＯＬをスキップする */
/*------------------------------------------------------------*/
UBYTE SCD_SkipMrEol = 0;

/*-------------------------------------------------------------------*/
/*	２６．バイト ＳＣＤ用キャリヤ断チェック用 By Y.Suzuki 1997/3/7   */
/*-------------------------------------------------------------------*/
UWORD	SCD_CarryDownBlock = 0;	/*	キャリアダウンとみなすブロック数		*/

/*-------------------------------------------------------*/
/*	２８．バイト ＳＣＤ変数追加用 By Y.Suzuki 1997/02/28 */
/*-------------------------------------------------------*/
UBYTE	SCD_TxMode = 0;							/*	送信モード（最後に送ったページのモード）	*/

/*----------------------------------------------------------*/
/*	２９．バイト ＳＣＤ ＥＣＭサイズ By Y.Suzuki 1997/03/07 */
/*----------------------------------------------------------*/
UWORD	SCD_EcmSize = 0;

/*----------------------------------------------------------------------------*/
/*	３１．バイト 最小電送時間に必要な1ラインのバイト数 By Y.Suzuki 1997/02/28 */
/*----------------------------------------------------------------------------*/
UWORD SCD_MinimumLineSize = 0;		/*	scd_redc.c	*/

/*------------------------------------------------------------------*/
/*	３３．バイト Ｇ３送信時 ＥＯＬコピー変数 By Y.Suzuki 1997/04/22 */
/*------------------------------------------------------------------*/
UBYTE *SCD_LastEolAddr = 0;
UDWORD SCD_LastEolDataCount = 0;

/*-------------------------------------------------------------------------------------*/
/*	４１．バイト Ｇ３送信時ＳＲＡＭ－＞ＭＤＭＤＭＡ転送バイト数 By Y.Suzuki 1997/02/28 */
/*-------------------------------------------------------------------------------------*/
UWORD SCD_MdmBufCount[8] ={0};

/*---------------------------------------------------------*/
/*	５７．バイト Ｇ３送信用変数 	By Y.Suzuki 1997/02/28 */
/*---------------------------------------------------------*/
UWORD SCD_EOL_WriteCount = 0;

/*--------------------------------------------------*/
/*	５９．バイト ＳＣＤキャラクタ送信タスク			*/
/*--------------------------------------------------*/
UWORD tskno_SCD_CTxCodeConvertTask = 0;

/*---------------------------------------------------------*/
/*	６１．バイト ＳＣＤデバック変数 By Y.Suzuki 1997/02/28 */
/*---------------------------------------------------------*/
UBYTE SCD_DBG_OldRlSize = 0;		/*	scd_redc.c  1:縮小時に縮小前のRLサイズをオーバーした	*/
UBYTE SCD_NgRl = 0;					/*	decode.c	PUTRLに渡されたRL値が異常 1､2:デコード中 3､4: 縮小中 */
UBYTE SCD_DBG_RLOVER = 0;			/*	decode.c	1:MDMデコードした結果ラインサイズをオーバーした*/
									/*	decode.c	2:MEMデコードした結果ラインサイズをオーバーした*/
									/*	decode.c	3:ECMデコードした結果ラインサイズをオーバーした*/
									/*	scd_redc.c	4:縮小後のラインがラインサイズオーバーした */
UBYTE SCD_DBG_PMODE = 0;			/*	encode.c	5:エンコード時ラインの最後でP_MODEがきた*/
UBYTE SCD_DBG_ENC_RLSIZE = 0;		/*	encode.c	1:ＭＲラインのエンコードでラインサイズオーバー */
									/*				3:ＭＨラインのエンコードでラインサイズオーバー */

/*-------------------------------------------------------
*	６６．バイト キャリア断検出用 By Y.Suzuki 1997/06/03
---------------------------------------------------------*/
UWORD SCD_CarryDownByteCnt = 0;

/*-----------------------------------------------------
**	６８．バイト ダイレクト受信 By Y.Suzuki 1997/06/13
------------------------------------------------------*/
UBYTE SCD_DirectRx = 0;

/*-------------------------------------------------------
*	６９．バイト ＳＣＤ変数追加用 By Y.Suzuki 1997/07/01
---------------------------------------------------------*/
UBYTE SCD_Det_Rcp = 0;

/*-------------------------------------------------------
*	７０．バイト ＳＣＤ変数追加用 By Y.Suzuki 1997/10/16
---------------------------------------------------------*/
UBYTE SCD_MaintenanceSwitch[SCD_MNT_SW_MAX] = {0};

/*--------------------------------------------------------------
*	８０．バイト ECMバッファ先頭アドレス By Y.Suzuki 1997/02/28
---------------------------------------------------------------*/
UBYTE *SCD_EcmBufTopAddress = 0;

/*--------------------------------------------------------------*/
/*	８１．メモリ送信時、300dpiからモード変更指示フラグ	*/
/*----------------------------------------------------------Y.S-*/
UBYTE ReductionFromR12 = 0;

/*-------------------------------------------------------
*	８０．バイト ＳＣＤ変数追加用 By Y.Suzuki 1997/02/28
---------------------------------------------------------*/
UBYTE SCD_Dummy[14] = {0};

/*-----------------*/
/*	１００．バイト */
/*-----------------*/
/* このファイルにデータを追加する場合、ファイルの最後に SCD_Dummy に収まる16バイト程度にする。*/
/* #pragma section */

