/*---------------------------------------------------------------------------*/
/*  プロジェクト : POPLAR/ANZU_L                                             */
/*  ファイル名   : ini_cpu.c                                                 */
/*  モジュ-ル    : void InitializeCPU(void)                                  */
/*                 void INI_Start10msTimer(void)                             */
/*                 void InitializeSystem(void)                               */
/*                                                                           */
/*  作成者       : 野瀬敏弘                                                  */
/*  日  付       : 96.10.11                                                  */
/*  概  要       : SH7043 CPU初期設定                                        */
/*  修正履歴     :                                                           */
/*---------------------------------------------------------------------------*/
#include "\src\atlanta\define\product.h"
#include "\src\atlanta\sh7043\define\sh_sys.h"
#include "\src\atlanta\sh7043\define\cpu_def.h"

#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
 #if defined(SATSUKI2)		/* 追加 by Y.Kano 2003/08/05 */
#include "\src\atlanta\satsuki2\define\satsport.h"
 #else
#include "\src\atlanta\hinoki\define\hinoport.h"
 #endif
#define	Input(Address)	((UBYTE)(*(Address)))
#define	Output(Address, Data)	{*(Address) = (UBYTE)(Data);}
#define	OutputWORD(Address, Data)	{*(Address) = (UWORD)(Data);}
#endif

#include "\src\atlanta\flash\define\sys_pro.h"

#if (PRO_ENERGY_SAVE_PPF == ENABLE) /*By Y.Suzuki 2002/06/28*/
#include "\src\atlanta\sh7043\define\io_pro.h"
#include "\src\atlanta\define\std.h"
#endif

/******************************************************************************
	module		:[SH704X CPUの初期化]
	function	:[
		1. SH704X CPUのシステムレジスタ設定
		2. ポートの初期化
	]
	condition	:[
		この関数は内蔵ＲＯＭ内に置き、バス設定を終えてから外部ＲＯＭ上の
		プログラムへ移行する事
	]
	return		:[なし]
	common		:[なし]
	machine		:[SH704X]
	language	:[SHC]
	keyword		:[INI]
	date		:[1996/10/11]
	author		:[野瀬敏弘]
******************************************************************************/
void InitializeCPU(void)
{

	/*----------------------------------------------*/
	/* ＢＳＣ（バスステートコントローラー）の設定   */
	/*----------------------------------------------*/
	/*----------------------------------------------*/
	/* ＢＣＲ１（バスコントロールレジスタ１）の設定 */
	/* ・ＭＴＵ制御レジスタアクセス許可             */
	/* ・ＣＳ３空間は通常空間                       */
	/* ・ＣＳ３空間のバスサイズはワードサイズ       */
	/* ・ＣＳ２空間のバスサイズはワードサイズ       */
	/* ・ＣＳ１空間のバスサイズはワードサイズ       */
	/* ・ＣＳ０空間のバスサイズはワードサイズ       */
	/*----------------------------------------------*/
	SH__BCR1 = SH__BCR1_DATA;

	/*----------------------------------------------*/
	/* ＢＣＲ２（バスコントロールレジスタ２）の設定 */
	/* ・ＣＳ３空間連続アクセス時０アイドルサイクル */
	/* ・ＣＳ２空間連続アクセス時０アイドルサイクル */
	/* ・ＣＳ１空間連続アクセス時０アイドルサイクル */
	/* ・ＣＳ０空間連続アクセス時０アイドルサイクル */
	/* ・ＣＳ３空間／ＣＳアサート拡張有り           */
	/*----------------------------------------------*/
#if (PRO_MINOLTA_TEST_FUNC == ENABLE)	/* 1998/08/10 Y.Murata */
	SH__BCR2 = 0xFFFF;
#else
	SH__BCR2 = SH__BCR2_DATA;
	SH__BCR2 |= WCR1_CS0_1WAIT;	/* By M.Tachibana 1997/07/02 */
#endif
	/*--------------------------------------------------------------*/
	/* ＷＣＲ１（ウェイトステートコントロールレジスタ１）の設定     */
	/* ・ＣＳ３空間は３ウェイト設定                                 */
	/* ・ＣＳ２空間はノーウェイト設定                               */
	/* ・ＣＳ１空間は３ウェイト設定                                 */
	/* ・ＣＳ０空間は３ウェイト設定                                 */
	/*--------------------------------------------------------------*/
	SH__WCR1 = SH__WCR1_DATA;

	/*--------------------------------------------------------------*/
	/* ＷＣＲ２（ウェイトステートコントロールレジスタ２）の設定     */
	/* ・ＤＲＡＭ空間ＤＭＡ２ウェイト設定                           */
	/* ・ＣＳ空間ＤＭＡ２ウェイト設定                               */
	/*--------------------------------------------------------------*/
#if (PRO_MINOLTA_TEST_FUNC == ENABLE)	/* 1998/08/10 Y.Murata */
	SH__WCR2 = (WCR2_DRAM_DMA_3WAIT + WCR2_CS_DMA_2WAIT);
#else
	SH__WCR2 = SH__WCR2_DATA;
#endif
	/*--------------------------------------------------------------*/
	/* ＤＣＲ（ＤＲＡＭエリアコントロールレジスタ）の設定           */
	/* ・ＲＡＳプリチャージサイクル数１．５サイクル                 */
	/* ・ＲＡＳ－ＣＡＳ遅延サイクル数１サイクル                     */
	/* ・ＲＡＳアサートサイクル数２．５サイクル                     */
	/* ・ＤＲＡＭライトサイクル数３サイクル                         */
	/* ・ＤＲＡＭリードサイクル数３サイクル                         */
	/* ・ＤＲＡＭアイドルサイクル無し                               */
	/* ・バースト禁止                                               */
	/* ・ＲＡＳアップモードＤＲＡＭアクセス                         */
	/* ・ＤＲＡＭバス幅１６ビット                                   */
	/* ・ＤＲＡＭアドレスマルチプレクス１０ビット                   */
	/*--------------------------------------------------------------*/
#if (PRO_MINOLTA_TEST_FUNC == ENABLE)	/* 1998/08/10 Y.Murata */
	SH__DCR = 0xcf85;
#else
	SH__DCR = SH__DCR_DATA;
#endif
	/*--------------------------------------------------------------*/
	/* ＲＴＣＳＲ（リフレッシュタイマーコントロール・ステータスレジスタ）の設定 */
	/* ・コンペアマッチによる割込要求禁止                           */
	/* ・システムクロック／２でカウント                             */
	/* ・ＤＲＡＭのリフレッシュをする                               */
	/* ・ＣＡＳビフォアＲＡＳリフレッシュ                           */
	/*--------------------------------------------------------------*/
#if (PRO_MINOLTA_TEST_FUNC == ENABLE)	/* 1998/08/10 Y.Murata */
	SH__RTCSR = 0;
#else
	SH__RTCSR = SH__RTCSR_DATA;
#endif
	/*--------------------------------------------------------------*/
	/* ＲＴＣＮＴ（リフレッシュタイマカウンタ）の設定               */
	/* ・タイマカウンタをセット                                     */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	SH__RTCNT = SH__RTCNT_DATA;

	/*--------------------------------------------------------------*/
	/* ＲＴＣＯＲ（リフレッシュタイムコンスタントレジスタ）の設定   */
	/* ・２００×７１．４ｎｓ＝１４．２８μｓ（リフレッシュサイクル）本ちゃん */
	/* ・１６０×１００ｎｓ＝１６μｓ（リフレッシュサイクル）ＩＣＥ用         */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	SH__RTCOR = SH__RTCOR_DATA;


	/*------------------------------------------------*/
	/* ＤＭＡＣ（ＳＨ７０４３内蔵）の設定             */
	/*------------------------------------------------*/
	/*----------------------------------------------------------------*/
	/* オペレーションレジスタ（ＤＭＡＯＲ）の設定                     */
	/* アドレスエラーフラグクリア                                     */
	/* ＮＭＩフラグクリア                                             */
	/*----------------------------------------------------------------*/
	DMA__DMAOPR &= 0; /* ０初期化 念のため */

	/*----------------------------------------------------------------*/
	/* チャネルコントロールレジスタ０（ＣＨＣＲ０）の設定             */
	/* アクノリッジレベルハイアクティブ（初期値）                     */
	/* 外部リクエスト、デュアルアドレスモード                         */
	/* ＤＲＥＱ立ち下がりエッジ検出                                   */
	/* サイクルスチールモード（初期値）                               */
	/* ＴＣ割込み許可                                                 */
	/*----------------------------------------------------------------*/
	DMA__CHCR0 &= 0; /* ０初期化 念のため */
	DMA__CHCR0 |= DMA__CHCR0_DATA;

	/*----------------------------------------------------------------*/
	/* チャネルコントロールレジスタ１（ＣＨＣＲ１）の設定             */
	/* アクノリッジレベルハイアクティブ（初期値）                     */
	/* 外部リクエスト、デュアルアドレスモード                         */
	/* ＤＲＥＱ立ち下がりエッジ検出                                   */
	/* サイクルスチールモード（初期値）                               */
	/* ＴＣ割込み許可                                                 */
	/*----------------------------------------------------------------*/
	DMA__CHCR1 &= 0; /* ０初期化 念のため */
	DMA__CHCR1 |= DMA__CHCR1_DATA;

	/*----------------------------------------------------------------*/
	/* チャネルコントロールレジスタ２（ＣＨＣＲ２）の設定             */
	/* 動作禁止                                                       */
	/*----------------------------------------------------------------*/
	DMA__CHCR2 &= 0; /* ０初期化 念のため */

	/*----------------------------------------------------------------*/
	/* チャネルコントロールレジスタ３（ＣＨＣＲ３）の設定             */
	/* 動作禁止                                                       */
	/*----------------------------------------------------------------*/
	DMA__CHCR3 &= 0; /* ０初期化 念のため */

	/*----------------------------------------------------------------*/
	/* オペレーションレジスタ（ＤＭＡＯＲ）の設定                     */
	/* チャネル優先順位 ラウンドロビン                                */
	/* ＤＭＡＣ動作許可                                               */
	/*----------------------------------------------------------------*/
/*	DMA__DMAOPR = DMA__DMAOPR_DATA;	By M.Tachibana 1997/06/17 */
	DMA__DMAOPR = 0;

	/*----------------------------------------------------------------*/
	/* 内蔵ＤＭＡＣ ＣＨ０ ＣＨ１ の割込みレベルをＦへセット          */
	/*----------------------------------------------------------------*/
/*	SH__IPRC |= SH__IPRC_DATA;	By M.Tachibana 1997/06/17 */
	SH__IPRC = 0;


/* ↓ By M.Tachibana 1997/10/09 */
#if (0)
** 	/*--------------------------------------------------------------*/
** 	/* ＰＡＤＲＨ（ポートＡデータレジスタＨ）の設定                 */
** 	/*--------------------------------------------------------------*/
** 	/*--------------------------------------------------------------*/
** 	/* ・手差し、カセット１、２、３クラッチＯＦＦ                   */
** 	/*--------------------------------------------------------------*/
** 	IO__PADRH = IO__PADRH_DATA;
** 
** 	/*--------------------------------------------------------------*/
** 	/* ＰＡＤＲＬ（ポートＡデータレジスタＬ）の設定                 */
** 	/*--------------------------------------------------------------*/
** 	/*--------------------------------------------------------------*/
** 	/* ・モーター駆動ＯＦＦ                                         */
** 	/*--------------------------------------------------------------*/
** 	IO__PADRL = IO__PADRL_DATA;
#endif
/* ↑ By M.Tachibana 1997/10/09 */


	/*------------------------------------------------*/
	/* ＰＦＣ（ピンファンクションコントローラ）の設定 */
	/*------------------------------------------------*/
	/*--------------------------------------------------------------*/
	/* ＰＡＣＲＨ（ポートＡコントロールレジスタＨ）の設定           */
	/* ・PA23/PA22/PA21/PA20/PA17/PA16：汎用端子                    */
	/* ・PA19：ＢＡＣＫ                                             */
	/* ・PA18：バス権要求出力                                       */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PACRH = PFC__PACRH_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＡＩＯＲＨ（ポートＡ・ＩＯレジスタＨ）の設定               */
	/* ・PA23/PA22/PA21/PA20/PA19/PA16：出力端子                    */
	/* ・PA17/PA18：入力端子                                        */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PAIORH = PFC__PAIORH_DATA;	/* <- 0x00FB M.Tachibana 1997/04/10 */

	/*--------------------------------------------------------------*/
	/* ＰＡＣＲＬ１（ポートＡコントロールレジスタＬ１）の設定       */
	/* ・PA14：リード出力                                           */
	/* ・PA13：上位側ライト出力                                     */
	/* ・PA12：下位側ライト出力                                     */
	/* ・PA11：チップセレクト（ＣＳ１）出力                         */
	/* ・PA10：チップセレクト（ＣＳ０）出力                         */
	/* ・PA9/PA8/：汎用入出力                                       */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
#if (PRO_MINOLTA_TEST_FUNC == ENABLE)	/* 1998/08/12 Y.Murata */
	PFC__PACRL1 = (PFC__PACRL1_DATA | 0x4000);
#else
	PFC__PACRL1 = PFC__PACRL1_DATA;
#endif
	/*--------------------------------------------------------------*/
	/* ＰＡＣＲＬ２（ポートＡコントロールレジスタＬ２）の設定       */
	/* ・PA7/PA6/PA5/PA4/PA3/PA2/PA1/PA0：汎用入出力                */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PACRL2 = PFC__PACRL2_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＡＩＯＲＬ（ポートＡ・ＩＯレジスタＬ）の設定               */
	/* ・PA15/PA14/PA13/PA12/PA11/PA10                              */
	/*   PA7/PA5/PA4/PA3/PA2/PA0：出力端子                          */
	/* ・PA9/PA8/PA6/PA1：入力端子                                  */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PAIORL = PFC__PAIORL_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＢＣＲ１（ポートＢコントロールレジスタ１）の設定           */
	/* ・PB9：アドレス出力（Ａ２１）                                */
	/* ・PB8：アドレス出力（Ａ２０）                                */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PBCR1 = PFC__PBCR1_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＢＣＲ２（ポートＢコントロールレジスタ２）の設定           */
	/* ・PB7：アドレス出力（Ａ１９）                                */
	/* ・PB6：アドレス出力（Ａ１８）                                */
	/* ・PB5：リード／ライト出力                                    */
	/* ・PB4：カラムアドレスストローブ                              */
	/* ・PB3：カラムアドレスストローブ                              */
	/* ・PB2：ロウアドレスストローブ                                */
	/* ・PB1：アドレス出力（Ａ１７）                                */
	/* ・PB0：アドレス出力（Ａ１６）                                */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PBCR2 = PFC__PBCR2_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＢＩＯＲ（ポートＢ・ＩＯレジスタ）の設定                   */
	/* ・PB9/PB8/PB7/PB6/PB5/PB4/PB3/PB2/PB1/PB0：出力端子          */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PBIOR = PFC__PBIOR_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＣＣＲ（ポートＣコントロールレジスタ）の設定               */
	/* ・PC15：アドレス出力（Ａ１５）                               */
	/* ・PC14：アドレス出力（Ａ１４）                               */
	/* ・PC13：アドレス出力（Ａ１３）                               */
	/* ・PC12：アドレス出力（Ａ１２）                               */
	/* ・PC11：アドレス出力（Ａ１１）                               */
	/* ・PC10：アドレス出力（Ａ１０）                               */
	/* ・PC9：アドレス出力（Ａ９）                                  */
	/* ・PC8：アドレス出力（Ａ８）                                  */
	/* ・PC7：アドレス出力（Ａ７）                                  */
	/* ・PC6：アドレス出力（Ａ６）                                  */
	/* ・PC5：アドレス出力（Ａ５）                                  */
	/* ・PC4：アドレス出力（Ａ４）                                  */
	/* ・PC3：アドレス出力（Ａ３）                                  */
	/* ・PC2：アドレス出力（Ａ２）                                  */
	/* ・PC1：アドレス出力（Ａ１）                                  */
	/* ・PC0：アドレス出力（Ａ０）                                  */
	/*--------------------------------------------------------------*/
	PFC__PCCR = PFC__PCCR_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＣＩＯＲ（ポートＣ・ＩＯレジスタ）の設定                   */
	/* ・PC15～PC0：出力端子                                        */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PCIOR = PFC__PCIOR_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＤＣＲＨ１（ポートＤコントロールレジスタＨ１）の設定       */
	/* ・PD31/PD30：汎用入出力                                      */
	/* ・PD29：チップセレクト（ＣＳ３）出力                         */
	/* ・PD28：チップセレクト（ＣＳ２）出力                         */
	/* ・PD27：ＤＭＡ１転送要求受付出力                             */
	/* ・PD26：ＤＭＡ０転送要求受付出力                             */
	/* ・PD25：ＤＭＡ１転送要求入力                                 */
	/* ・PD24：ＤＭＡ０転送要求入力                                 */
	/*--------------------------------------------------------------*/
	PFC__PDCRH1 = PFC__PDCRH1_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＤＣＲＨ２（ポートＤコントロールレジスタＨ２）の設定       */
	/* ・PD23：割込要求入力（ＩＲＱ７）                             */
	/* ・PD22：割込要求入力（ＩＲＱ６）                             */
	/* ・PD21：割込要求入力（ＩＲＱ５）                             */
	/* ・PD20：割込要求入力（ＩＲＱ４）                             */
	/* ・PD19：割込要求入力（ＩＲＱ３）                             */
	/* ・PD18：割込要求入力（ＩＲＱ２）                             */
	/* ・PD17：割込要求入力（ＩＲＱ１）                             */
	/* ・PD16：割込要求入力（ＩＲＱ０）                             */
	/*--------------------------------------------------------------*/
	PFC__PDCRH2 = PFC__PDCRH2_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＤＩＯＲＨ（ポートＤ・ＩＯレジスタＨ）の設定               */
	/* ・PD31～PD16：入力端子                                       */
	/*--------------------------------------------------------------*/
	PFC__PDIORH = PFC__PDIORH_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＤＣＲＬ（ポートＤコントロールレジスタＬ）の設定           */
	/* ・PD15：データ出力（Ｄ１５）                                 */
	/* ・PD14：データ出力（Ｄ１４）                                 */
	/* ・PD13：データ出力（Ｄ１３）                                 */
	/* ・PD12：データ出力（Ｄ１２）                                 */
	/* ・PD11：データ出力（Ｄ１１）                                 */
	/* ・PD10：データ出力（Ｄ１０）                                 */
	/* ・PD9：データ出力（Ｄ９）                                    */
	/* ・PD8：データ出力（Ｄ８）                                    */
	/* ・PD7：データ出力（Ｄ７）                                    */
	/* ・PD6：データ出力（Ｄ６）                                    */
	/* ・PD5：データ出力（Ｄ５）                                    */
	/* ・PD4：データ出力（Ｄ４）                                    */
	/* ・PD3：データ出力（Ｄ３）                                    */
	/* ・PD2：データ出力（Ｄ２）                                    */
	/* ・PD1：データ出力（Ｄ１）                                    */
	/* ・PD0：データ出力（Ｄ０）                                    */
	/*--------------------------------------------------------------*/
	PFC__PDCRL = PFC__PDCRL_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＤＩＯＲＬ（ポートＤ・ＩＯレジスタＬ）の設定               */
	/* ・PD15～PD0：入力端子                                        */
	/*--------------------------------------------------------------*/
	PFC__PDIORL = PFC__PDIORL_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＥＣＲ１（ポートＥコントロールレジスタ１）の設定           */
	/* ・PE15～PE8：汎用入出力                                      */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
	PFC__PECR1 = PFC__PECR1_DATA;
#else
	PFC__PECR1 = PECR1_PE8_15MD_GP;
#endif

	/*--------------------------------------------------------------*/
	/* ＰＥＣＲ２（ポートＥコントロールレジスタ２）の設定           */
	/* ・PE7～PE0：汎用入出力                                       */
	/* ・予約ビットは全て０をセット                                 */
	/*--------------------------------------------------------------*/
	PFC__PECR2 = PFC__PECR2_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＥＩＯＲ（ポートＥ・ＩＯレジスタ）の設定                   */
	/* ・PE15～PE0：入力端子                                        */
	/*--------------------------------------------------------------*/
#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
	PFC__PEIOR = PFC__PEIOR_DATA;	/* <- 0x0080 1997/04/10 <- 0x3080 M.Tachibana 1997/03/25 */
#else
	PFC__PEIOR = 0x0000;
#endif

	return;
}

/************************************************************************
	module		:[ＳＨ７０４３内蔵Ｉ／Ｏ初期設定]
	function	:[
	]
	return		:[なし]
	common		:[なし]
	machine		:[SH7043]
	language	:[SHC(V.3.0C)]
	keyword		:[INI]
	date		:[1997/02/27]
	author		:[野瀬敏弘]
************************************************************************/
void InitializeInternalDevice(void)
{
	/*--------------------------------------------------------------*/
	/* ＰＡＤＲＨ（ポートＡデータレジスタＨ）の設定                 */
	/*--------------------------------------------------------------*/
	/*--------------------------------------------------------------*/
	/* ・手差し、カセット１、２、３クラッチＯＦＦ                   */
	/*--------------------------------------------------------------*/
	IO__PADRH = IO__PADRH_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＡＤＲＬ（ポートＡデータレジスタＬ）の設定                 */
	/*--------------------------------------------------------------*/
	/*--------------------------------------------------------------*/
	/* ・モーター駆動ＯＦＦ                                         */
	/*--------------------------------------------------------------*/
	IO__PADRL = IO__PADRL_DATA;

#if (0)
** 	/*--------------------------------------------------------------*/
** 	/* ＰＥＩＯＲ（ポートＥ・ＩＯレジスタ）の設定                   */
** 	/*--------------------------------------------------------------*/
** 	/* ・PE7 ：出力端子（ＭＴＵアウトプットコンペア出力：TIOC2B）   */
** 	/* ・PE14：出力端子（ＭＴＵアウトプットコンペア出力：TIOC4C）   */
** 	/* ・PE15,PE13～PE8,PE6～PE0：入力端子                          */
** 	/*--------------------------------------------------------------*/
** 	PFC__PEIOR = 0x4080;	/* <- 0x0080 1997/04/10 <- 0x3080 M.Tachibana 1997/03/25 */
** 
** 	/*--------------------------------------------------------------*/
** 	/* ＰＥＣＲ１（ポートＥコントロールレジスタ１）の設定           */
** 	/*--------------------------------------------------------------*/
** 	/* ・PE15～PE8：汎用入出力                                      */
** 	/* ・PE14：ＭＴＵアウトプットコンペア出力(TIOC4C）              */
** 	/* ・予約ビットは全て０をセット                                 */
** 	/*--------------------------------------------------------------*/
** 	PFC__PECR1 = (PECR1_PE8_15MD_GP + PECR1_PE14MD_TIOC4C);		/* PE14追加 M.Tachibana 1997/04/10 */
** 
** 	/*--------------------------------------------------------------*/
** 	/* ＰＥＤＲ（ポートＥデータレジスタ）の初期設定                 */
** 	/*--------------------------------------------------------------*/
** 	IO__PEDR = 0x0080;		/* PE7:High 1997/02/21 M.Tachibana */
#endif

#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
	/*--------------------------------------------------------------*/
	/* ＰＥＣＲ１（ポートＥコントロールレジスタ１）の設定           */
	/*--------------------------------------------------------------*/
	/*--------------------------------------------------------------*/
	PFC__PECR1 = PFC__PECR1_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＥＤＲ（ポートＥデータレジスタ）の初期設定                 */
	/*--------------------------------------------------------------*/
	IO__PEDR = IO__PEDR_DATA;

	/*--------------------------------------------------------------*/
	/* ＰＥＩＯＲ（ポートＥ・ＩＯレジスタ）の設定                   */
	/*--------------------------------------------------------------*/
	PFC__PEIOR = PFC__PEIOR_DATA;	/* <- 0x0080 1997/04/10 <- 0x3080 M.Tachibana 1997/03/25 */

#endif

	/*------------------------------------------------*/
	/* ＩＮＴＣ（割込コントローラ）の設定             */
	/*------------------------------------------------*/
	/*------------------------------------------------------------------*/
	/* ＭＴＵ１の割込みをレベルＦへセット                               */
	/*------------------------------------------------------------------*/
/*	SH__IPRD |= MTU1H_LEVEL;	By M.Tachibana 1997/06/07 */

#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
	SH__IPRD |= MTU1H_LEVEL;
#else
	SH__IPRD = 0;
#endif

	/*------------------------------------------------------------------*/
	/* ＩＲＱ０～３の割込みをレベルＦへセット                           */
	/*------------------------------------------------------------------*/
/*	SH__IPRA |= (IRQ0_LEVEL + IRQ1_LEVEL + IRQ2_LEVEL + IRQ3_LEVEL);	By M.Tachibana 1997/06/07 */
#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
	SH__IPRA |= IRQ1_LEVEL;
#else
	SH__IPRA = 0;
#endif

	/*------------------------------------------------------------------*/
	/* ＩＲＱ４～７の割込みをレベルＦへセット                           */
	/*------------------------------------------------------------------*/
/*	SH__IPRB |= (IRQ4_LEVEL + IRQ5_LEVEL + IRQ6_LEVEL + IRQ7_LEVEL);	By M.Tachibana 1997/06/07 */
	SH__IPRB = 0;

	/*------------------------------------------------------------------*/
	/* ＩＲＱ０～７の割込み検出を立ち下がりエッジ検出へセット           */
	/*------------------------------------------------------------------*/
#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
	SH__ICR |= SH__ICR_DATA;
#else
	SH__ICR |= IRQ_DOWN_EGDE;
#endif

	/*------------------------------------------------------------------*/
	/* ＤＴＣの割込みをレベルＦへセット                                 */
	/*------------------------------------------------------------------*/
/*	SH__IPRG |= DTC_LEVEL;	By M.Tachibana 1997/06/07 */
	SH__IPRG = 0;


#if (0)
** 	/*------------------------------------------------*/
** 	/* Ａ／Ｄ変換器の設定                             */
** 	/*------------------------------------------------*/
** 	/*----------------------------------------------------------------*/
** 	/* Ａ／Ｄコントロール／ステータスレジスタ（ＡＤＣＳＲ）の設定     */
** 	/* ・Ａ／Ｄ変換の終了による割込み要求の禁止                       */
** 	/* ・Ａ／Ｄ変換の停止                                             */
** 	/* ・変換時間＝８０ステート                                       */
** 	/* ・グループモード（ＡＮ０～ＡＮ７）                             */
** 	/*----------------------------------------------------------------*/
** 	AD__ADCSR = (ADCSR_CKS + ADCSR_GRP + ADCSR_CH2 + ADCSR_CH1 + ADCSR_CH0);
** 
** 	/*----------------------------------------------------------------*/
** 	/* Ａ／Ｄコントロール（ＡＤＣＲ）の設定                           */
** 	/* ・低消費変換モード                                             */
** 	/* ・ソフトウェアによるＡ／Ｄ変換の開始を許可                     */
** 	/* ・スキャンモード                                               */
** 	/* ・通常サンプリング動作                                         */
** 	/*----------------------------------------------------------------*/
** 	AD__ADCR = (ADCR_SCAN);
** 
** 	/*----------------------------------------------------------------*/
** 	/* Ａ／Ｄコントロール／ステータスレジスタ（ＡＤＣＳＲ）の設定     */
** 	/* ・Ａ／Ｄスタート                                               */
** 	/*----------------------------------------------------------------*/
** 	AD__ADCSR |= ADCSR_ADST;
#endif

	/*------------------------------------------------*/
	/* データトランスファコントローラ（ＤＴＣ）の設定 */
	/*------------------------------------------------*/
	/*----------------------------------------------------------------*/
	/* ＤＴＣコントロール／ステータスレジスタ（ＤＴＣＳＲ）の設定     */
	/* 全ビットをクリア                                               */
	/*----------------------------------------------------------------*/
	SH__DTCSR &= 0;

	/*----------------------------------------------------------------*/
	/* ＤＴＣイネーブルレジスタ（ＤＴＥＲ）の設定                     */
	/* 割込み要因によるＤＴＣ起動を禁止                               */
	/*----------------------------------------------------------------*/
	SH__DTEA = 0;
	SH__DTEB = 0;
	SH__DTEC = 0;
	SH__DTED = 0;
	SH__DTEE = 0;
}


/************************************************************************
	module		:[１０ｍｓタイマー割り込み]
	function	:[ＩＴＵのＣｈ．０を１０ｍｓタイマーのカウンターとして
				  使用する。
				 ]
	return		:[なし]
	common		:[なし]
	machine		:[SH(SH7034/SH704X)]
	language	:[SHC(V.3.0C)]
	keyword		:[INI]
	date		:[1996/1/10]
	author		:[川崎真史]
************************************************************************/
void INI_Start10msTimer(void)
{
	/*------------------------------------------------------------------*/
	/* ＴＣＲの設定             										*/
	/* ・ＧＲＡのコンペアマッチ／インプットキャプチャでＴＣＮＴクリア	*/
	/* ・立上がりエッジでカウント			                       		*/
	/* ・内部クロック２８ＭＨｚ÷１６＝５７１．４３ｎｓ					*/
	/* ・予約ビット７は１又は０をセット                                 */
	/*------------------------------------------------------------------*/
	MTU__TCR0 = 0x22;
	/*------------------------------------------------------------------*/
	/* ＴＭＤＲの設定             										*/
	/* ・ＴＧＲＢは通常動作                                             */
	/* ・ＴＧＲＡは通常動作                                             */
	/* ・ＭＴＵチャネル０は通常動作モード                               */
	/* ・予約ビット７は１をセット                                       */
	/*------------------------------------------------------------------*/
	MTU__TMDR0 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＩＯＲＨの設定            										*/
	/* ・ＧＲＢ／ＧＲＡコンペアマッチによる端子出力禁止					*/
	/*------------------------------------------------------------------*/
	MTU__TIOR0H = 0x00;
	/*------------------------------------------------------------------*/
	/* ＴＩＯＲＬの設定            										*/
	/* ・ＧＲＤ／ＧＲＣコンペアマッチによる端子出力禁止					*/
	/*------------------------------------------------------------------*/
	MTU__TIOR0L = 0x00;
	/*------------------------------------------------------------------*/
	/* ＴＩＥＲの設定             										*/
	/* ・コンペアマッチ割込み許可（ＴＧＩＡ）							*/
	/* ・予約ビット６は１をセット                                       */
	/* ・予約ビット５は０をセット                                       */
	/*------------------------------------------------------------------*/
	MTU__TIER0 = 0x41;
	/*------------------------------------------------------------------*/
	/* ＴＳＲの設定             										*/
	/* ・予約ビット７は１をセット                                       */
	/* ・予約ビット６は１をセット                                       */
	/*------------------------------------------------------------------*/
	MTU__TSR0 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＧＲの設定             										*/
	/* ・カウンター値の設定				                                */
	/*   １０ｍｓ÷５７１．４３ｎｓ ＝ １７５００（０ｘ４４５Ｃ）カウント */
	/*------------------------------------------------------------------*/
	MTU__TGR0A = 0x445C;
	/*------------------------------------------------------------------*/
	/* ＭＴＵ０の割込みをレベルＦへセット								*/
	/*------------------------------------------------------------------*/
	SH__IPRD |= MTU0H_LEVEL;
	/*------------------------------------------------------------------*/
	/* ＴＳＴＲの設定             										*/
	/* ・カウンターのスタート				                            */
	/* ・予約ビット５～３は常に０をセット                               */
	/*------------------------------------------------------------------*/
	MTU__TSTR |= TSTR_START_CH0;

	return;

}

/************************************************************************
	module		:[１０ｍｓタイマー割り込み停止]
	function	:[ ]
	return		:[なし]
	common		:[なし]
	machine		:[SH(SH7034/SH704X)]
	language	:[SHC(V.3.0C)]
	keyword		:[INI]
	date		:[1997/06/07]
	author		:[橘正樹]
************************************************************************/
void INI_Stop10msTimer(void)
{
	MTU__TSTR &= ~TSTR_START_CH0;	/* チャネル0カウント停止 */
	MTU__TSR0 &= ~0x01;				/* TGFAのクリア */
	MTU__TCNT0 = 0;					/* TCNTのクリア */
}

/************************************************************************
	module		:[システムイニシャルメイン処理の入り口]
	function	:[]
	return		:[なし]
	common		:[なし]
	machine		:[SH7043]
	language	:[SHC(V.3.0C)]
	keyword		:[INI]
	date		:[1996/10/11]
	author		:[野瀬敏弘]
************************************************************************/
void InitializeSystem(void)
{
#if (PRO_ENERGY_SAVE_PPF == ENABLE)/* V851 By Y.Suzuki 2002/06/28*/
	UWORD	count;	/* ＤＲＡＭ ＲＡＳオンリリフレッシュ */
#endif

#if (PRO_PANEL == KANJI)				/* 漢字対応操作パネル */
	/* ＰＯＰＬＡＲ＿Ｈは漢字ＬＣＤのＬＣＤ＿ＢＵＳＹがこのポートに入っているので、
	** Ｂｕｓｙがくれば、Ｗａｉｔするように設定する。
	** By O.Kimoto 1997/09/24
	*/
	PFC__PACRH |= PACRH_PA17MD_WAIT;	/**  ＰＡ１７はＷＡＩＴ             */
#endif

	/*--------------------------------------------*/
	/* ＳＨ７０４３ 内蔵Ｉ／Ｏ初期設定            */
	/*--------------------------------------------*/
	InitializeInternalDevice();

#if (PRO_ENERGY_SAVE_PPF == ENABLE)/* V851 By Y.Suzuki 2002/06/28*/
	PSRESET(FALSE);
	PCON(TRUE);
	CLKCON(TRUE);
	count = 10;
	while (count--) ;
	PSRESET(TRUE);
#endif

	/*--------------------------------------------*/
	/* 外部追加割込制御ポートの初期設定           */
	/*--------------------------------------------*/
/*	INT_InitializeExternalInterrupt();	*/

	/*--------------------------------------------*/
	/** １０ｍｓタイマー割込みスタート			  */
	/*--------------------------------------------*/
/*	INI_Start10msTimer(); */

#if defined(HINOKI) || defined (HINOKI2) || defined (SATSUKI2) || defined (HINOKI3) /* HINOKI2 2001/11/13 T.Takagi */
	/* G/A, ソフトリセット */
	OutputWORD(GA_RST, 0x0001);

	/* G/A, ソフトリセット解除 */
	OutputWORD(GA_RST, 0x0000);
	/* G/A, 割込み禁止 */
	GA_IntMaskStatus = 0;	
	OutputWORD(GA_INT_MASK, GA_IntMaskStatus);
	OutputWORD(GA_INT_REC, 0x7F);	/* 割込み受領初期化 */

	/*------------------------------------------------------*/
	/* ＳＣＲのＴＥ,ＲＥビットを０にクリア(送信/受信の禁止) */
	/* ＲＩＥ,ＴＩＥ,ＴＥＩＥ,ＭＰＩＥ,ＣＫＥ１,ＣＫＥ０ビットを設定 */
	/*------------------------------------------------------*/
	Output(SCI_SCR0, 0x00);
	Output(SCI_SCR1, 0x00);
	/*------------------------------------------------------*/
	/* ＳＭＲに送信/受信フォーマットを設定 					*/
	/*------------------------------------------------------*/
	Output(SCI_SMR0, 0x80);
	/*------------------------------------------------------*/
	/* ＢＲＲに値を設定 									*/
	/*------------------------------------------------------*/
	Output(SCI_BRR0, 0x8B);
	/*------------------------------------------------------*/
	/* １ビット期間経過ＷＡＩＴ 							*/
	/*------------------------------------------------------*/
	/*------------------------------------------------------*/
	/* Sirialの割込み保留中要求のクリア						*/
	/*------------------------------------------------------*/
	(void)Input(SCI_SSR0);
	Output(SCI_SSR0 ,0x00);
	(void)Input(SCI_SSR1);
	Output(SCI_SSR1 ,0x00);
	/*------------------------------------------------------*/
	/* ＳＣＲのＴＥ,ＲＥビットを0にセット(送信/受信の不可) 	*/
	/*------------------------------------------------------*/
	Output(SCI_SCR0 ,0x00);

#endif

	return;
}
