/************************************************************************
*               BY:  O.Kimoto
*             DATE:  1997/01/17
*        FILE NAME:  mlt_tbl.c
*       Task ID No:  Not Valid
*      DESCRIPTION:  ２回線用テーブル定義
*        REFERENCE:
************************************************************************/
#include "\src\atlanta\define\product.h"

/* #if (PRO_MULTI_LINE == ENABLE) /@ DISABLEのとき空になるためコンパイルできない */	
/************************************************************************
*               BY:  O.Kimoto
*             DATE:  1997/01/17
*             TYPE:  struct
*      VAR TO HOLD:  
*      DESCRIPTION:  回線選択優先順位テーブル
************************************************************************/
CONST UBYTE MLT_SelectLineTable[2][9]= {
	0,1,2,3,4,5,6,7,8,	/** 内蔵   －＞ 外付け **/
	8,7,6,5,4,3,2,1,0	/** 外付け －＞ 内蔵   **/
};
/* #endif */
