/* By Y.Suzuki 1996/10/11 */
#include "\src\atlanta\define\product.h"
#include "\src\atlanta\define\sysmax.h"
#include "\src\atlanta\define\time.h"
#include "\src\atlanta\define\sysdblk.h"
#include "\src\atlanta\define\sysdial.h"

/* #if (PRO_PAT_JOURNAL == ENABLE)		/@ 1995/01/27 Y.Murata */
#include "\src\atlanta\define\sysjrnl.h"
/* #endif */

#if (PRO_FIP == ENABLE)
#include "\src\atlanta\define\fip_def.h"	/*FIP_REMOTEID_SIZE*/
#endif
#include "\src\atlanta\define\message.h"
#include "\src\atlanta\define\sys_opt.h"
#include "\src\atlanta\define\sysdisp.h"

#if (PRO_MINOLTA_TEST_FUNC == ENABLE)	/* 1998/05/12 Y.Murata */
	#include "\src\atlanta\define\syspcrx.h"
#endif

#if	(PRO_PRINT_TYPE == THERMAL)
#include "\src\atlanta\define\nsortcpy.h"
#include "\src\atlanta\define\realtcpy.h"
#endif

#pragma section SYS_DATA		/* セクション指定 */

/************************************************************************
 * ＳＲＡＭチェックする先頭アドレス										*
 * 97/08/18																*
 * 橘正樹																*
 ************************************************************************/
UWORD	SYS_SRAMCheckStartAddress = 0;

/************************************************************************
 * ﾏｼ-ﾝ･ｽﾃ-ﾀｽ															*
 * 93/12/20																*
 * S.Kawasaki															*
 ************************************************************************/
UWORD	SYS_MachineStatus[SYS_MACHINE_STATUS_MAX] = {0};

/************************************************************************
 * 原稿蓄積パラメータ													*
 ************************************************************************/
UBYTE	SYS_DocumentStoreItem	= 0;
UWORD	SYS_DocumentStoreNo		= 0;
UWORD	SYS_DocumentStorePage	= 0;
UBYTE	SYS_DocumentStoreBoxNumber = 0;	/* 1997/03/11  By T.Yamaguchi */
/************************************************************************
 * 原稿プリントパラメータ												*
 ************************************************************************/
UBYTE	SYS_DocumentPrintClass	= 0;
UBYTE	SYS_DocumentPrintItem	= 0;
UWORD	SYS_DocumentPrintNo		= 0;
UWORD	SYS_DocumentPrintPageNo = 0;
UBYTE	SYS_DocumentPrintBoxNumber = 0;	/* 1997/03/11  By T.Yamaguchi */
#if (PRO_ROTATE == ENABLE)
/************************************************************************
 * 原稿回転パラメータ	 By M.Kotani 97/03/27 							*
 ************************************************************************/
UBYTE	SYS_DocumentRotateClass	= 0;
UBYTE	SYS_DocumentRotateItem	= 0;
UWORD	SYS_DocumentRotateNo		= 0;
UWORD	SYS_DocumentRotatePageNo = 0;
UBYTE	SYS_DocumentRotateBoxNumber = 0;
UBYTE	SYS_MemoryRxRotateReadPoint = 0;
#endif

/************************************************************************
 * ﾀｲﾏｰ																	*
 ************************************************************************/
UDWORD	SYS_VariableTimer = 0;
TIME_DATA_t	CurrentTimeInBCD = {0};

/************************************************************************
 * 10msタイマー															*
 * 1994/01/07															*
 * 吉川弘康																*
 ************************************************************************/
#if (PRO_EX_CLASS1 == ENABLE)	/* S.Fukui Jun.19,1998 */
UWORD	SYS_GeneralTimerSram = 0;
#else
UWORD	SYS_GeneralTimer = 0;
#endif

/************************************************************************
 * 通信ｺﾏﾝﾄﾞ用ﾎﾟｲﾝﾀ-													*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
struct	SYS_ExecQueueData_t *SYS_CurrentExecutingCommand = 0;

/************************************************************************
 * 実行ExecQueueの番号													*
 * 94/7/15																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_CurrentExecQueueNo = 0;

/************************************************************************
 * 手動通信チェックメッセージのプリント要求								*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_ManualFaxCommErrRequest = 0;

/************************************************************************
 * 通信管理記録（送信）自動プリント要求									*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_TxAutoJournalPrintRequest = 0;

/************************************************************************
 * 通信管理記録（受信）自動プリント要求									*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_RxAutoJournalPrintRequest = 0;

/************************************************************************
 * 停電検出リストのプリント要求（「しない」にプリセット）				*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_ErasePixMemoryListRequest = 0;

/************************************************************************
 * プロトコルモニタのプリント要求										*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_ProtocolMonitorPrintRequest = 0;

/************************************************************************
 * ＲＡＭ領域初期化通知のプリント要求（「しない」にプリセット）			*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_BackUpRamListRequest = 0; /** ＲＡＭ領域初期化通知のプリント要求（「しない」にプリセット）*/

/************************************************************************
 * 画像メモリあふれ通知のプリント要求									*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_MemoryOverListRequest = 0;	/** 画像メモリあふれ通知のプリント要求 **/
#if (PRO_QUICK_TX_TEST == ENABLE)	/* 1998/10/19 Y.Murata for KAKI */
UWORD	SYS_MemoryOverListPage = 0;
#endif

/************************************************************************
 * 部門管理リストのプリント要求											*
 * 94/07/31																*
 * 吉川弘康																*
 ************************************************************************/
#if (PRO_DEPART_NEW_LIST == ENABLE) /* modified by thonda 1997/11/29 */
UBYTE	SYS_DepartManageListRequest = 0;	/** 管理料金管理リストのプリント要求 **/
UBYTE	SYS_DepartManageClearRequest = 0;	/** 管理料金管理リストのプリント要求 **/
#endif
UBYTE	SYS_DepartmentListRequest = 0;	/** 部門管理リストのプリント要求 **/
UBYTE	SYS_DepartmentClearRequest = 0;	/** 部門管理リストのプリント要求 **/

/************************************************************************
 * 交信種別　　　　　　　　　　　　　									*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_FaxComType = 0;		/*	交信種別					*/

/************************************************************************
 * 送信原稿種別			　　　　　　　　　　　　　　　　　　　　　　　　*
 * 93/12/27																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_FaxComTxType = 0;	/*	送信原稿種別				*/

/************************************************************************
 *	送受信ページ
 *	FCM_DATA.C より移動
 *	19.Apr'94 Y.Suzuki
 ***********************************************************************/
UWORD	SYS_TxTotalPage = 0;					/*	全送信ページ数	*/
UWORD	SYS_RxTotalPage = 0;					/*	全受信ページ数	*/

/************************************************************************
 * ＦＣＭタスクの通信遷移状態
 * 1994/05/27	S.Tanaka
 ***********************************************************************/
UBYTE	SYS_FaxCommStage = 0;

/************************************************************************
 *	原稿制御ブロック
 *		Jan.12'94	竹内茂樹
 ***********************************************************************/
struct SYS_DocBlockData_t	SYS_DocBlock = {0};		/*	原稿制御ブロック	*/

/************************************************************************
 * 転送受信用フラグ
 * 1994.7.8			HARADA
 ************************************************************************/
UBYTE	SYS_TensouJushinFlag = 0;

/************************************************************************
 *	FAX/TEL待機時最初の擬似ＲＢＴを３秒後に送出するためのフラグ
 *	'94/9/9
 *	M.HARADA
 ***********************************************************************/
UBYTE	SYS_FaxTelTimeUpTimeFlag = 0;

/************************************************************************
 *「受領証要求」フラグ													*
 * 93/12/28																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_RxReceiptRequestFlag = 0;	/*	「受領証要求」フラグ	*/

/************************************************************************
 *「会話予約受付」フラグ												*
 * 93/12/28																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_VoiceCallAccepted = 0;		/*	「会話予約受付」フラグ	*/

/************************************************************************
 * 会話予約ﾎﾞﾀﾝﾃﾞｰﾀ														*
 * 93/12/28																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_VoiceSwitch = 0;

/************************************************************************
* Ｔ３０モニタ EYE_Q 値 パラメータ										*
* 94/6/16	7.Jly'94 char-->int に変更									*
* Y.Suzuki																*
*************************************************************************/
UWORD	SYS_EyeQ_Level = 0;

/************************************************************************
 *メモリ受信を行う原稿のファイルアイテム,ナンバー,ページ				*
 * 93/12/28																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_RxMemoryFileItem = 0;		/*	メモリ受信を行う原稿のファイルアイテム	*/
UWORD	SYS_RxMemoryFileNo = 0;			/*	メモリ受信を行う原稿のファイルナンバー	*/
UWORD	SYS_RxMemoryFilePage = 0;		/*	メモリ受信を行う原稿のファイルページ	*/
/* #if (PRO_F_CODE == ENABLE)	/@ 1997/01/13  By T.Yamaguchi */
UBYTE	SYS_RxMemoryFileBoxNumber = 0;	/** メモリ受信を行なう原稿のＢＯＸ番号 */
/* #endif */

/************************************************************************
 *デュアルオープンでセットされる原稿のファイルアイテム,ナンバー,ページ	*
 * 94/06/14																*
 * Y.Suzuki																*
 ************************************************************************/
UBYTE	SYS_RxPrintFileItem = 0;	/*	デュアルオープンメモリ受信されるプリント用原稿(中継配信指示受信、リモートＦＡＸ同時プリント)のファイルアイテム	*/
UWORD	SYS_RxPrintFileNo = 0;		/*	デュアルオープンメモリ受信されるプリント用原稿(中継配信指示受信、リモートＦＡＸ同時プリント)のファイルＮＯ．	*/
UWORD	SYS_RxPrintFilePage = 0;	/*	デュアルオープンメモリ受信されるプリント用原稿(中継配信指示受信、リモートＦＡＸ同時プリント)のファイルページ	*/
UBYTE	SYS_RxPrintFileBoxNumber = 0;	/* 1997/01/30  By T.Yamaguchi */

/************************************************************************
 *受信原稿を複数枚プリントする時の残ページ数							*
 * 95/06/26																*
 * 吉川弘康																*
 ************************************************************************/
UBYTE	SYS_MultiPrintCount = 0;	/** 受信原稿を複数枚プリントする時の残ページ数 */

/************************************************************************
 * 代行受信管理テーブルへのポインタ										*
 ************************************************************************/
struct SYS_MemoryRxPrintData_t	*MemoryRxPrintPoint = {0};			/* man_main より移動 1994/06/03 Y.Murata */

/************************************************************************
 *	代行受信消去通知読みだしポイント
 *	94/10/05	S.K
 ***********************************************************************/
UBYTE	SYS_MemoryRxEraseReportPoint = 0;

/************************************************************************
 * 一時退避用ＤＳ1ポ－ト・ステ－タス									*
 * ＤＳ1ポ－ト・ステ－タス												*
 * 94/1/7																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewDS1 = 0;
UBYTE	OldDS1 = 0;

/************************************************************************
 * 一時退避用DS2ポ－ト・ステ－タス										*
 * DS2ポ－ト・ステ－タス												*
 * 94/1/7																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewDS2 = 0;
UBYTE	OldDS2 = 0;

/************************************************************************
 * 一時退避用DS3ポ－ト・ステ－タス										*
 * DS3ポ－ト・ステ－タス												*
 * 94/1/7																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewDS3 = 0;
UBYTE	OldDS3 = 0;

#if defined(STOCKHM2)
/************************************************************************
 * 一時退避用ポ－ト・ステ－タス											*
 * Cassette PS0ポ－ト・ステ－タス										*
 * 2004/3/15															*
 * SMuratec 夏 															*
 ************************************************************************/
UBYTE	NewPS0 = 0;
UBYTE	OldPS0 = 0;
#endif

/************************************************************************
 * 一時退避用PS1ポ－ト・ステ－タス										*
 * PS1ポ－ト・ステ－タス												*
 * 94/1/7																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewPS1 = 0;
UBYTE	OldPS1 = 0;

/************************************************************************
 * 一時退避用PB4ポ－ト・ステ－タス										*
 * PB4ポ－ト・ステ－タス												*
 * 94/1/7																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewPB4 = 0;
UBYTE	OldPB4 = 0;

/************************************************************************
 * 一時退避用 記録紙＆カセット　ポ－ト・ステ－タス						*
 * 記録紙＆カセット ポ－ト・ステ－タス									*
 * 94/5/20																*
 * T.Onishi																*
 ************************************************************************/
UBYTE	NewPSCST = 0;
UBYTE	OldPSCST = 0;

/************************************************************************
 * 一時退避用 記録紙＆Ｗカセット ポ－ト・ステ－タス						*
 * 記録紙＆Ｗカセット ポ－ト・ステ－タス								*
 * 94/5/20																*
 * T.Onishi																*
 ************************************************************************/
UBYTE	NewWPSCST = 0;
UBYTE	OldWPSCST = 0;

/************************************************************************
 * 一時退避用InterLockポ－ト・ステ－タス								*
 * InterLockポ－ト・ステ－タス											*
 * 94/1/7																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewInterLock = 0;
UBYTE	OldInterLock = 0;

/************************************************************************
 * 一時退避用スキャナーカバーポ－ト・ステ－タス							*
 * 94/6/14																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewTXIL = 0;
UBYTE	OldTXIL = 0;

/************************************************************************
 * 一時退避用プリンターカバーポ－ト・ステ－タス							*
 * 94/6/14																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewRXIL = 0;
UBYTE	OldRXIL = 0;
/************************************************************************
 * 一時退避用ダイアル・イン・ポ－ト・ステ－タス							*
 * ダイアル・イン・ポ－ト・ステ－タス									*
 * 94/1/7																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewDialIn = 0;
UBYTE	OldDialIn = 0;

#if defined (KEISATSU) /* 警察FAX 05/09/07 石橋正和 */
/************************************************************************
 * 一時退避用スクランブル・ポ－ト・ステ－タス							*
 * 05/09/07 石橋正和													*
 ************************************************************************/
BOOL NewScrambleOn = FALSE;
BOOL OldScrambleOn = FALSE;
#endif

#if defined (KEISATSU) /* 警察FAX Added by SMuratec 李 2005/07/18 */
/************************************************************************
 * 一時退避用指令信号用のポート・ステ－タス								*
 * 指令信号用のポート・ステ－タス										*
 * 2005/07/18															*
 * SMuratec  李															*
 ************************************************************************/
UBYTE	NewSHIREI = 0;
UBYTE	OldSHIREI = 0;

/* 警察FAX DVT_ID81 Added by SMuratec 李 2005/12/21 */
/************************************************************************
 * 指令回線起動中状態記録用の変量										*
 * 2005/12/21															*
 * SMuratec  李															*
 ************************************************************************/
UBYTE	IsSHIREIKido = 0;
#endif /* defined (KEISATSU) */

/************************************************************************
 * 記録紙サイズ（椛・皐・ラベンダー）
 * SYS_Paper1Size : ロール紙記録機とカット紙記録機の上段の記録紙サイズを設定
 * SYS_Paper2Size : 　　　　　　　　カット紙記録機の下段の記録紙サイズを設定
 * 1994/01/10
 * 木元修
 ***********************************************************************/
UBYTE	SYS_Paper1Size = 0;			/* ロール紙記録機とカット紙記録機の１段の記録紙サイズを設定 */
UBYTE	SYS_Paper2Size = 0;			/* カット紙記録機の２段の記録紙サイズを設定 */
UBYTE	SYS_Paper3Size = 0;			/* カット紙記録機の３段の記録紙サイズを設定 */
UBYTE	SYS_ManualPaperSize = 0;	/* カット紙記録機の手差し記録紙サイズを設定 */
UBYTE	SYS_PC_PrintSize = 0;		/* ＰＣプリントサイズ */

#if defined(POPLAR_F)
#else
/************************************************************************
 * ＣＣＤメーカー（０：ＮＥＣ　１：ＴＯＳＨＩＢＡ）
 * 1994/03/12
 * 木元修
 ***********************************************************************/
UBYTE	CCD_Maker = 0;	/** ＣＣＤメーカー **/

/************************************************************************
 * ＣＣＤサイズ（０：Ａ４　１：Ｂ４ ２：Ａ３ ）
 * 1994/03/12
 * 木元修
 ***********************************************************************/
UBYTE	CCD_Size = 0;	/** ＣＣＤ size **/
#endif

/************************************************************************
 *	着信ベル鳴動回数
 *		Jan.26'94	坂本直史
 ***********************************************************************/
UBYTE	SYS_RingCounter = 0;

#if (PRO_LINENUMBER == TWICE_LINE)	/* 疑似２回線仕様 by T.Soneoka 1997/11/20 */
/************************************************************************
 *	拡張ライン着信ベル鳴動回数
 *		  by T.Soneoka 1997/12/01
 ***********************************************************************/
UBYTE	SYS_RingCounterExt = 0;
#endif

/************************************************************************
 *	HOOK KEY INPUT 情報
 *		Jan.12'94	坂本直史
 ***********************************************************************/
UBYTE	SYS_HookKeyInputFlag = 0;

#if defined (KEISATSU) /* 警察FAX Added by SMuratec 李 2005/08/29 */
/************************************************************************
 *	HOOK KEY INPUT (強制終了用)
 *		SMuratec 李 2005/08/29
 ***********************************************************************/
UBYTE	SYS_HookKeyFlagBk = 0;
#endif /* defined (KEISATSU) */

/************************************************************************
 *	HOLD KEY INPUT 情報
 *		Mar.22'94	坂本直史
 ***********************************************************************/
UBYTE	SYS_HoldKeyInputFlag = 0;

/************************************************************************
 *	ＣＮＧ検出／擬似ベル同期
 *		擬似ベルのみを鳴動させる				 (0)
 *		ＣＮＧ検出しながら擬似ベルを鳴動させる	 (1)
 *		Mar. 3'94	坂本直史
 ***********************************************************************/
UBYTE	SYS_RingSignalStopFlag = 0;

/************************************************************************
 * リングバックトーンの送出を止めるかどうか判断するフラグ
 * 1994/04/13 A.Okumura
 ***********************************************************************/
UBYTE	SYS_RingToneStopFlag = 0;

/************************************************************************
 * 付属電話、又は外付電話からの発呼確認フラグ							*
 * 94/6/27																*
 * T.Hiraoka															*
 ************************************************************************/
UBYTE	SYS_TxDetectFlag = 0;	/* 使用していない？ */
UBYTE	SYS_RxDetectFlag = 0;

/************************************************************************
 * ダイヤル・チェンジ
 *		する  (1)
 *		しない(0)
 *		Jan.26'94	坂本直史
 ***********************************************************************/
UBYTE	SYS_DialChange = 0;

/************************************************************************
 *	多機能電話用ﾊﾞｯﾌｧ･ﾃﾞｰﾀ
 ***********************************************************************/
struct DialingData_t	SYS_DialingNumber = {0};

/************************************************************************
 * 画データ送信停止フラグ（工場ファンクション）
 * 1994/5/18		A.Okumura
 ***********************************************************************/
UBYTE	SYS_PixStopFlag = 0;

/************************************************************************
 * Full Scan or Partial Scan Flag
 * 1994/5/19		S.Kawasaki
 ***********************************************************************/
UBYTE	SYS_DocumentWidthFullFlag = 0;

/************************************************************************
 * Limit Length Scan or Nonlimit Length Scan Flag
 * 1994/5/19		S.Kawasaki
 ***********************************************************************/
UBYTE	SYS_DocumentLengthLimitFlag = 0;

/************************************************************************
 * 原稿読取り幅															*
 * #include "\src\atlanta\define\sysscan.h"								*
 * sysscan.jsw参照														*
 * 1993/11/24															*
 * 吉川弘康																*
 ************************************************************************/
UBYTE	SYS_DocumentScanSize = 0;

/************************************************************************
 * 原稿プリント幅														*
 * 1994/07/19															*
 * 奥村明																*
 ************************************************************************/
UBYTE	SYS_DocumentPrintSize = 0;

/************************************************************************
 * シングル･コピープリント枚数											*
 * 1994/07/19															*
 * 奥村明																*
 ************************************************************************/
UBYTE	SYS_SingleCopyPrintNumber = 0;

/************************************************************************
 * マルチ・プログラム・コマンド　ＯＮ／ＯＦＦ							*
 * 94/7/15																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_MultiProgramFlag = 0;

/************************************************************************
 * マルチ・プログラム・コマンド　Ｎｏの配列								*
 * 94/7/15																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_MultiProgramNo[SYS_JOB_MAX] = {0};

/************************************************************************
 * オートシャットオフタイマー											*
 * プリント終了後、このタイマーがタイムアップ(０)後に、プリンタをポーズ *
 * 状態にする															*
 * 1994/07/21															*
 * 吉川弘康																*
 ************************************************************************/
UBYTE	SYS_AutoShutOFF_Timer = 0;

/************************************************************************
 * 1秒タイマーでの[PRN]へのシリアル処理禁止フラグ（桐のみ)				*
 * 0:有効 1:禁止														*
 * 1994/06/29															*
 * 吉川弘康																*
 ************************************************************************/
UBYTE	SYS_PRN_SirialInhibit = 0;

/************************************************************************
 * プリンターの下段カセットそのものが装着されているかをセットする		*
 * 初期値１																*
 * ０：装着されていない	。												*
 * １：装着されている。													*
 * 1996/03/15 S.Kawasaki												*
 ************************************************************************/
UBYTE	SYS_SecondCassetteFlag = 0;

/************************************************************************
 * スタンプを押す／押さないの判断フラグ									*
 * 94/8/19																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_StampFlag = 0;

/************************************************************************
 * 夏時間切り替え機能
 * 1995/12/02 Eguchi
 * ・夏時間に切り替わる時間（基準時間からの積算秒数）
 * ・夏時間から戻る時間（基準時間からの積算秒数）
 * ・夏時間ステータス
 ***********************************************************************/
UDWORD	SYS_MoveTimeToSummerTime = 0;
UDWORD	SYS_ReturnTimeFromSummerTime = 0;
UBYTE	SYS_CurrentSummerTimeStatus	 = 0;

/************************************************************************
 * 原稿読取時にモータを反転させるかどうかの判断
 * '95,12,21 By N.S.
 *	0:正転のみで原稿搬送
 *	1:逆転で原稿読取を行う
 ***********************************************************************/
UBYTE	SYS_SCN_MotorReverseControal = 0;

/************************************************************************
 * ワーディングオフセット
 * 窓に相当するワーディングからワーディングの実体までのオフセット値。
 * 1996/03/11 Eguchi
 ***********************************************************************/
#if (0)	/* 未使用なので削除します by K.Watanabe 1998/07/10 */
//UWORD	SYS_OPR_WordingOffset = 0;
//UWORD	SYS_LST_WordingOffset = 0;
#endif

/************************************************************************
 * ＱＡＴ中に通信記録の通信時間が実際の時間と異なる不具合対策用
 * 原因：通信記録の開始時刻が正常に印字されているため、通信終了
 *		 時に読み込んだＲＴＣのデータが化けていた可能性がある。
 *		 ＲＴＣが化ける可能性としては、リード中にＣＥがローレベル
 *		 になる等があるが、実際の原因は不明。
 * 対策：通信時間の算出用に次のデータを追加
 *		 UWORD SYS_1SecBaseCounter（０～１００）
 *		 UWORD SYS_1SecGeneralTimer（０～６５５３５）
 *		 UWORD SYS_FCM_StartTime
 * 1996/09/02 S.Kawasaki
 ***********************************************************************/
UWORD	SYS_1SecBaseCounter = 0;
UWORD	SYS_1SecGeneralTimer = 0;
UWORD	SYS_FCM_StartTime = 0;



/* #if (PRO_PAT_JOURNAL == ENABLE) */
/************************************************************************
 * ジャーナル用ワークバッファ
 *		  1995/01/27 Y.Murata
 ***********************************************************************/
struct SYS_JournalData_t	PAT_JournalWorkFile = {0};	/* ＰＡＴジャーナル用ワークバッファ */
/* #endif */

#if ( PRO_DIALIN == ENABLE )
/************************************************************************
 * ダイヤル・イン着信時ＤＳＥ初期値
 *		Feb.25'94	坂本直史
 ***********************************************************************/
UBYTE	SYS_DSE1 = 0;	/* UWORD -> UBYTE By M.Tachibana 1997/02/14 */
UBYTE	SYS_DSE2 = 0;	/* UWORD -> UBYTE By M.Tachibana 1997/02/14 */
#endif

#if(PRO_MEM_RX_REJECT == ENABLE )
/************************************************************************
 *	通信タスクでプリンタを使用ことを示すフラグ
 *	94/10/27	坂本直史
 ************************************************************************/
UBYTE	SYS_FaxComPrinterBusyFlag = 0;
#endif

#if (PRO_DRAM_BACKUP == ENABLE)
/************************************************************************
 * スキャナコマンド消去リクエスト
 * 1994/11/26 Y.Murata
 ************************************************************************/
UBYTE	SYS_ScannerComEraseListRequest = 0;
#endif

#if (PRO_PIN_ACCESS == ENABLE)	/* '95.12.22 By t.yamaguchi */
/************************************************************************
 *	PIN番号用ﾊﾞｯﾌｧ･ﾃﾞｰﾀ
 ************************************************************************/
UBYTE	SYS_PinBuffer[PIN_DIALING_NUMBER_MAX] = {0};
#endif

#if (PRO_MULTI_TTI == ENABLE)	/* By H.Fujimura 1998/05/28 */
/************************************************************************
 *	マルチ発信元判断用ﾊﾞｯﾌｧ･ﾃﾞｰﾀ
 ************************************************************************/
UBYTE	SYS_Multi_PinBuffer[PIN_DIALING_NUMBER_MAX] = {0};
#endif

#if defined(JPN)
/************************************************************************
 * Ｆ網着信検出時　受信不可の場合の回線断処理用フラグ
 *				   '95,11,17 By N.S. for ANZU
 ************************************************************************/
UBYTE	SYS_F_Net_AutoCalledDisableFlag = 0;
#endif

#if (PRO_RING_MASTER == ENABLE)
/************************************************************************
 * リングマスターパターン自動検出モードフラグ
 * 1996/03/20 Eguchi
 ************************************************************************/
UBYTE	SYS_TeachingModeFlag = 0;
#endif

/************************************************************************
 * 受信完了アラーム鳴動状態
 * 1996/08/14 Eguchi
 ************************************************************************/
UBYTE	SYS_AudibleAlarmStatus = 0;



#if (PRO_FBS == ENABLE)
/************************************************************************
 * スキャナの動作識別(ADF/FBS)
 * T.Nose 1996/11/28
 * ICHOUよりコピー
 ***********************************************************************/
UBYTE	SYS_ScannerExecMode = 0;

/************************************************************************
 *	ミラーキャリッジが読取り待機位置にいるかどうか
 *		これがTRUEになると、
 *		原稿蓄積タスクとスキャナ送信は読み取りを開始する
 *		1996/09/03 s.takeuchi
 ************************************************************************/
UBYTE	SYS_IsMirrorScanReady = 0;
/************************************************************************
 * ＡＤＦ許可センサ
 * 1996/07/04 吉川弘康
 ************************************************************************/
UBYTE	NewAPS = 0;
UBYTE	OldAPS = 0;
/************************************************************************
 * ＦＢＳサイズ取込センサ
 * 1996/08/24 s.takeuchi
 ************************************************************************/
UBYTE	NewBIS = 0;
UBYTE	OldBIS = 0;
#endif

#if (PRO_UPPER_COVER == ENABLE)
/************************************************************************
 * ＡＤＦ許可センサ
 * 1996/07/04 吉川弘康
 ************************************************************************/
UBYTE	NewAPS = 0;
UBYTE	OldAPS = 0;
#endif

/************************************************************************
 * ＦＣＯＴ追求コピー時のプリント開始イベント空振り防止
 * TRUE :プリント開始イベント発行済
 * FALSE:プリント開始イベント未発行
 * 1996/10/28
 * 吉川弘康
 ************************************************************************/
UBYTE	SYS_FCOT_PrintStartRequest = 0;

#if (PRO_PRINT_TYPE == LED)
/************************************************************************
 * ドラム・ポ－ト・ステ－タス											*
 * 1997/02/15															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	OldDrumSw = 0;
UBYTE	NewDrumSw = 0;
/************************************************************************
 * 給紙・ポ－ト・ステ－タス												*
 * 1997/02/15															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	OldPSS = 0;
UBYTE	NewPSS = 0;
/************************************************************************
 * 排紙・ポ－ト・ステ－タス												*
 * 1997/02/15															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	OldPDS = 0;
UBYTE	NewPDS = 0;
/************************************************************************
 * 手差し用紙検知・ポ－ト・ステ－タス									*
 * 1997/02/15															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	OldHPES = 0;
UBYTE	NewHPES = 0;
/************************************************************************
 * ファンモーターロック・ポ－ト・ステ－タス								*
 * 1997/02/15															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	OldFanLock = 0;
UBYTE	NewFanLock = 0;
UBYTE	OldPsFanLock = 0;
UBYTE	NewPsFanLock = 0;
/************************************************************************
 * モーターロック・ポ－ト・ステ－タス									*
 * 1997/02/15															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	OldMotorLock = 0;
UBYTE	NewMotorLock = 0;
/************************************************************************
 * モーターロックの検出													*
 * 1997/07/18															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	SYS_MotorLockCheckStart = 0;
/************************************************************************
 * ドラムの検出															*
 * 1997/07/18															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	SYS_DrumUnitStatus = 0;
/************************************************************************
 * ファンロックの検出タイマ												*
 * 1997/07/18															*
 * 橘正樹																*
 ************************************************************************/
UWORD	SYS_FanLockEnableTimer = 0;
UWORD	SYS_FanLockDetectTimer = 0;
UWORD	SYS_PsFanLockEnableTimer = 0;
UWORD	SYS_PsFanLockDetectTimer = 0;
/************************************************************************
 * プリントファン停止タイマ												*
 * 1997/12/03															*
 * 橘正樹																*
 ************************************************************************/
#if defined(POPLAR_F)	/* FAN騒音対策 */
UWORD	SYS_AutoFanOffTimer = 0;
#elif (defined(POPLAR_H) && defined(JP0)) /* V851 ＦＡＮ制御 By H.Fujimura 2002/07/11 */
UWORD	SYS_AutoFanOffTimer = 0;
UWORD	SYS_AutoFanOffTimer2 = 0;
#else
UBYTE	SYS_AutoFanOffTimer = 0;
#endif

/************************************************************************
 * プリントウェイクアップタイマ											*
 * 1997/12/03															*
 * 橘正樹																*
 ************************************************************************/
UBYTE	SYS_PrinterWakeupTimer = 0;
#endif

/************************************************************************
 * サーマルヘッドサイズ（椛・皐・ラベンダー）
 * 1994/01/10
 * 木元修
 ***********************************************************************/
#if (PRO_PRINT_TYPE == THERMAL) || (PRO_PRINT_TYPE == THERMAL_TRANS)
UBYTE	SYS_ThermalHeadSize = 0;	/** サーマルヘッドサイズ **/
#endif

/************************************************************************
 * ＩＤＦ（ドナー）サイズ（椛・ラベンダー）
 * 1994/01/10
 * 木元修
 ***********************************************************************/
#if (PRO_PRINT_TYPE == THERMAL_TRANS)
UBYTE	SYS_IDFSize = 0;	/** ＩＤＦサイズ **/
#endif

#if (PRO_PRINT_TYPE == THERMAL_TRANS) || (PRO_PRINT_TYPE == THERMAL) 
/************************************************************************
 * リボン・ポート・ステータス			     							*
 * 1998/07/15															*
 * H.Yoshikawa															*
 ************************************************************************/
UBYTE OldRibon = 0;
UBYTE NewRibon = 0;
#endif


#if (PRO_CLASS1 == ENABLE) || (PRO_PANEL == KANJI)	/* For DEBUG By O.Kimoto 1997/12/07 */
/************************************************************************
 * クラス１ローカルプリント原稿管理テーブル参照位置
 * 1996/09/24 Eguchi
 * CL1FDATA.Cより移動
 ************************************************************************/
struct SYS_MemoryRxPrintData_t	*CL1_MemoryRxPrintPoint = {0};
/************************************************************************
 * FIPのRS232Cが存在するか?												*
 * 93/4/11																*
 * A.Okumura															*
 ************************************************************************/
UBYTE	SYS_RS232C_Exist = 0;				/* RS232Cが存在するか否か */
/************************************************************************
 * CL1ﾀｽｸの状態を示す													*
 * 96.03.29																*
 * Y.Tanimoto															*
 ************************************************************************/
 #if (PRO_EX_CLASS1 == ENABLE)	/* S.Fukui Jun.19,1998 */
UWORD	SYS_CL1_StatusSram = 0;				/* CL1ﾀｽｸの状態			  */
 #else
UWORD	SYS_CL1_Status = 0;				/* CL1ﾀｽｸの状態			  */
 #endif
/************************************************************************
 * CLASS1受信が可能かを示す												*
 * 96.03.29																*
 * Y.Tanimoto															*
 ************************************************************************/
 #if (PRO_EX_CLASS1 == ENABLE)	/* S.Fukui Jun.19,1998 */
UBYTE	SYS_CL1_RxEnableFlagSram = 0;		/* CLASS1受信が可能かを示す*/
 #else
UBYTE	SYS_CL1_RxEnableFlag = 0;		/* CLASS1受信が可能かを示す*/
 #endif
#endif

#if (PRO_FIP == ENABLE)	/*--------------FIP関係ここから-------------*/
/************************************************************************
 *通信で使用するＦＩＰ受信中フラグ										*
 * 93/12/28																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	SYS_FaxComFIP_RxActiveFlag = 0;	/*	通信で使用するＦＩＰ受信中フラグ	*/
/************************************************************************
 * 通信でFIP受信かどうかを判断するフラグ								*
 * 94/3/15																*
 * A.Okumura	1994/02/15 bkupram.cに移動	By M.Tachibana				*
 ************************************************************************/
/* UBYTE	SYS_FIP_ReceiveEnableFlag = 0;	@* 通信でFIP受信かどうかを判断するフラグ */
/************************************************************************
 * 親展受信開始ﾍﾟｰｼﾞNo.													*
 * 93/12/28																*
 * S.Kawasaki															*
 ************************************************************************/
UWORD	SYS_FIP_SecureStartPage = 0;		/* 親展受信開始ﾍﾟｰｼﾞNo. */
/************************************************************************
 * FIPステ－タス監視													*
 * 93/12/28																*
 * S.Kawasaki															*
 ************************************************************************/
UWORD	SYS_FIP_Status = 0;				/* FIPステ－タス監視 */
/************************************************************************
 * FIPメイルボックス番号												*
 * 94/3/15																*
 * A.Okumura															*
 ************************************************************************/
UWORD	SYS_FIP_MailBoxNo = 0;				/* FIPメイルボックス番号 */
/************************************************************************
 * FIP蓄積原稿のページ番号												*
 * 93/3/15																*
 * A.Okumura															*
 ************************************************************************/
UWORD	SYS_FIP_FilePage = 0;				/* FIP蓄積原稿のページ番号 */
/************************************************************************
 * FIP蓄積原稿のItem番号												*
 * 93/3/15																*
 * A.Okumura															*
 ************************************************************************/
UBYTE	SYS_FIP_FileItem = 0;				/* FIP蓄積原稿のItem番号 */
/************************************************************************
 * FIP通信時間															*
 * 93/3/15																*
 * A.Okumura															*
 ************************************************************************/
UWORD	SYS_FIP_ComTime = 0;				/* FIP通信時間 */
/************************************************************************
 * FIP通信ボーレート													*
 * 93/3/15																*
 * A.Okumura															*
 ************************************************************************/
UWORD	SYS_FIP_ComBaudRate = 0;				/* FIP通信ボーレート */
/************************************************************************
 * FIP通信結果															*
 * 93/3/15																*
 * A.Okumura															*
 ************************************************************************/
UWORD	SYS_FIP_ComResult = 0;				/* FIP通信結果 */
/************************************************************************
 * FIP通信(送受信)で正常終了した最終ページ								*
 * 93/3/15																*
 * A.Okumura															*
 ************************************************************************/
UWORD	SYS_FIP_TotalPage = 0;				/* FIP通信(送受信)で正常終了した最終ページ */
/************************************************************************
 * FIPファックス受信の相手機のID										*
 * 93/3/15																*
 * A.Okumura															*
 ************************************************************************/
UBYTE	SYS_FIP_ComRemoteID[FIP_REMOTEID_SIZE] = {0};		/* FIPファックス受信の相手機のID */
/************************************************************************
 * FIPのRS232Cが存在するか?												*
 * 93/4/11																*
 * A.Okumura															*
 ************************************************************************/
UBYTE	SYS_RS232C_Exist = 0;				/* RS232Cが存在するか否か */
/************************************************************************
 * ＦＩＰ送信／ポーリングの相手機のダイアル番号							*
 * 94/7/25																*
 * S.Kawasaki for Uemura												*
 ************************************************************************/
UBYTE	*SYS_FIP_DialNumber = 0;	/* ダイアル番号			*/
/************************************************************************
 * ＦＩＰポーリング時のパスコード番号　　　　　　　						*
 * 94/7/25																*
 * S.Kawasaki for Uemura												*
 ************************************************************************/
UBYTE	SYS_FIP_PasscodeNumber[5] = {0};	/* パスコード番号		*/
/************************************************************************
 * ローカル・スキャン時のスキャン・モード　　　　　						*
 * 94/7/25																*
 * S.Kawasaki for Uemura												*
 ************************************************************************/
UBYTE	SYS_FIP_ScanResolution = 0;		/* スキャン・モード		*/
/************************************************************************
 * FIP 受信可能符合化能力												*
 * 94/7/25																*
 * Y.Suzuki																*
 ************************************************************************/
UBYTE	SYS_FaxComFIP_RxCode = 0;		/* 受信可能符合化能力	*/
/************************************************************************
 * FIP 受信可能記録紙巾能力												*
 * 94/7/25																*
 * Y.Suzuki																*
 ************************************************************************/
UBYTE	SYS_FaxComFIP_RxSize = 0;		/* 受信可能記録紙巾能力 */
/************************************************************************
 * FIP 受信可能線密度能力												*
 * 94/7/25																*
 * Y.Suzuki																*
 ************************************************************************/
UBYTE	SYS_FaxComFIP_RxMode = 0;		/* 受信可能線密度能力	*/
/************************************************************************
 * FIP 受信可能線ｲﾝﾁ/ﾐﾘ能力												*
 * 94/7/25																*
 * Y.Suzuki																*
 ***********************************************************************/
UBYTE	SYS_FaxComFIP_RxMilliInch = 0;	/* 受信可能インチ／ミリ能力 */

#endif	/*----------------------------FIP関係ここまで----------------------------*/

#if (PRO_ROTATE == ENABLE)	/*--------------ROT関係ここから-------------*/
/************************************************************************
 * 代行受信管理テーブルへのポインタ										*
 ************************************************************************/
struct SYS_MemoryRxPrintData_t	*MemoryRxRotatePoint = {0};

#endif	/*----------------------------ROT関係ここまで----------------------------*/

#if (PRO_FBS == ENABLE)
/************************************************************************
 * ＢＯＯＫ次原稿のあり／なし確認										*
 ************************************************************************/
UBYTE	SYS_NextBookDocument = 0;
#endif

/*------------------------------*/
/* オプション仕様（２回線仕様） */
/*------------------------------*/
/************************************************************************
 * オプションボード用ステータス
 * By O.Kimoto 1996/11/8
 ************************************************************************/
UWORD SYS_OptionLineStatus[SYS_OPTION_BOARD_MAX] = {0};

/*---------------------------------------------*/
/* ＤＰＲメッセージキュー  1996/11/09 Y.Murata */
/*---------------------------------------------*/
struct SYS_OptionMessageData_t SYS_OptionMessage[SYS_OPTION_MESSAGE_MAX] = {0};
UBYTE 	OptMessageRead = 0;
UBYTE 	OptMessageWrite = 0;
UWORD 	OptSendMessageCounter = 0;

UBYTE 	SYS_PreLineBusyCheckStatus[SYS_OPTION_BOARD_MAX] = {0};	/* 1997/01/30 Y.Murata */

/* 表示更新 */
UBYTE	SYS_OptionFaxComUpDataDisplay = 0;

/************************************************************************
 * 通信ｺﾏﾝﾄﾞ用ﾎﾟｲﾝﾀ-													*
 * 96/11/29																*
 * O.Kimoto																*
 ************************************************************************/
struct	SYS_ExecQueueData_t *OPT_QueueP = {0};

/*---------------------------------------------------------------------*/
/* コマンドファイル用ポインター										   */
/* 96/12/01	   O.Kimoto												   */
/*---------------------------------------------------------------------*/
struct	SYS_CommandData_t		*OPT_CommandP = {0};

/*---------------------------------------------------------------------*/
/* 一括送信用ポインター												   */
/* 96/12/01	   O.Kimoto												   */
/*---------------------------------------------------------------------*/
struct	SYS_BatchTxData_t		*OPT_BatchP	  = {0};

#if (PRO_CONTINUOUS_POLLING == ENABLE)
/*---------------------------------------------------------------------*/
/* 連続ポーリング用ポインター										   */
/* 96/12/01	   O.Kimoto												   */
/*---------------------------------------------------------------------*/
struct	SYS_ContinuousPollingData_t *OPT_ContPollingP = {0};
#endif

UBYTE	OPT_CommandFileStatus = 0;				/*	使用状況	*/
UBYTE	OPT_CommandFileOptionItem = 0;			/*	通信種別	*/

/************************************************************************
 * ジャーナルセットリクエストキュー
 * 1996/12/02 Y.Murata
 ************************************************************************/
UBYTE SYS_JournalRequest[SYS_OPTION_BOARD_MAX] = {0};


UBYTE SYS_OptFactoryFunctionResponse = 0;	/* 1996/12/10 Y.Murata */

/**********************************************************************
 * ダイアルバッファ    ジャーナルセットで使用
 * 1996/12/17 Y.Murata
 **********************************************************************/
UBYTE SYS_OptionDialBuffer[DIALING_NUMBER_MAX] = {0};
UBYTE *SYS_OptionDirectDial = 0;			/*	直接ダイヤル番号	*/
UBYTE SYS_JournalKind = 0;
UWORD  SYS_JournalDepartmentCode = 0;

/* ホスト側実行キューセーブ 1996/12/19 Y.M */
UBYTE SYS_CurrentExecuteNoSave = 0;

UDWORD SYS_MltVariableTimer[SYS_OPTION_BOARD_MAX] = {0};

/*------------------------*/
/* マルチ回線表示バッファ */
/*------------------------*/
struct SYS_DisplayData_t	SYS_Display = {0};

/*--------------------------------------------------------*/
/* 機器設定、メモリＳＷ、機器パラの内容が変わった事を通知 */
/*--------------------------------------------------------*/
UWORD	SYS_ChangedSRAM_Status = 0;

/* 1997/01/09 Y.Murata */
UBYTE SYS_FaxComIndexConflictStatus = 0;

/************************************************************************
 * 回線テストに使用するバッファ											*
 * 96/12/2																*
 * Y.Matsukuma															*
 ************************************************************************/
struct SYS_FactoryOptModemData_t	SYS_FactoryOptModem = {0};

#if (PRO_MODEM == R288F)
/* ＰＯＰＬＡＲ＿Ｈは内蔵モデムもＲ２８８Ｆである。
** よって、２回線オプションと同じ構造を適応する。
** By O.Kimoto 1997/12/19 */
struct SYS_FactoryOptModemData_t	SYS_FactoryModem = {0};
#endif

/************************************************************************
** ２回線仕様で、ＦＣＭ＿ＴＡＳＫも起動せずにキューがエラーとなることがあり、
** その際、次のキューを処理するためのメッセージをここで送信する。
** by O.Kimoto 1997/01/22
************************************************************************/
UBYTE SYS_NextQueueVariableTimer = 0;

/***********************************************************************/
/* コマンドスキャナ送信時の属性 1997/01/27 Y.Murata                    */
/***********************************************************************/
UBYTE SYS_ScannerTxAbility0 = 0;
UBYTE SYS_ScannerTxAbility1 = 0;
UBYTE SYS_ScannerTxAbility2 = 0;
UBYTE SYS_ScannerTxAbility3 = 0;
UBYTE SYS_WorkAbility0 = 0;
UBYTE SYS_WorkAbility1 = 0;
UBYTE SYS_WorkAbility2 = 0;
UBYTE SYS_WorkAbility3 = 0;
/***********************************************************************/
/* 属性 1997/01/27 Y.Murata                                            */
/***********************************************************************/
UBYTE SYS_FaxComAbility0[SYS_OPTION_BOARD_MAX] = {0};
UBYTE SYS_FaxComAbility1[SYS_OPTION_BOARD_MAX] = {0};
UBYTE SYS_FaxComAbility2[SYS_OPTION_BOARD_MAX] = {0};
UBYTE SYS_FaxComAbility3[SYS_OPTION_BOARD_MAX] = {0};

/*-----------------------------------------
* 暗号化／暗号化解除実行状態
* By Y.Suzuki 1997/06/10
* 処理進捗率表示用変数
* By Y.Suzuki 1997/12/03
* 受信優先用ステータス By Y.Suzuki 1998/05/27
-------------------------------------------*/
UBYTE SYS_CipherComExec = 0;
/*UBYTE SYS_CipherPercent = 0;By Y.Suzuki 1998/05/27*/
UBYTE SYS_CipherInterruptionOn = 0;
UBYTE SYS_CipherKeyNo = 0;/* By Y.Suzuki 97/12/12 */
UBYTE SYS_CipherRestartEnable = 0;/* By Y.Suzuki 1998/06/10 */
UBYTE SYS_CipherFnetOrDialInReceive = 0;/*By Y.Suzuki 1998/06/15*/
UWORD SYS_BackupCipherStatus = 0;/*By Y.Suzuki 1998/08/12*/

/*#if (PRO_PC_PRINT == ENABLE)*/
struct SYS_PCR_OptionMessageData_t SYS_PCR_OptionMessage[SYS_PCR_OPTION_MESSAGE_MAX] = {0};
UBYTE	PCR_OptMessagRead = 0;
UBYTE	PCR_OptMessagWrite = 0;
/*#endif*/

#if (PRO_PC_PRINT == ENABLE)
/************************************************************************
 * ＰＣプリント用画像メモリあふれ通知のプリント要求						*
 * 1997/10/02															*
 * M.Tachibana															*
 ************************************************************************/
UBYTE	SYS_PcMemoryOverListRequest = 0;	/** 画像メモリあふれ通知のプリント要求 **/
UBYTE	SYS_PcMemoryOverDispRequest = 0;	/** 画像メモリあふれの表示要求 **/
#endif

UBYTE	SYS_AutoBackUpRAM_Clear = 0;
UBYTE	SYS_BackUpManualFaxCommErrReq = 0;
UBYTE	SYS_BackUpConfirmationReport = 0;
UBYTE	SYS_BackUpProtocolMonitorReq = 0;

/* 1997/10/18 Y.Murata
 * オプション回線用Ｔ３０モニタ印字要求 */
UBYTE	SYS_OptionLineT30PrintRequest = 0;
UBYTE	SYS_BackUpOptionLineT30PrintReq = 0;

/* 1997/10/29 Y.Murata
 * 回線別実行キューナンバー COMMAND_DEL*/
UWORD	SYS_ExecutingExecNo[SYS_OPTION_BOARD_MAX] = {0};

/* 1997/12/05 Y.Murata
 * 通信タイプのバックアップ */
UBYTE	SYS_BackupFaxComType = 0;
UBYTE	SYS_DualPrinterWaiting = 0;
UBYTE	SYS_DualPrinterWaitReq = 0;
UWORD	SYS_DualPrinerWakeUpStatus = 0;
UWORD	SYS_DualPrinterWaitStatus = 0;

#if (PRO_MODEM == R288F) || (PRO_MODEM == MN195006)
/************************************************************************
 * モデムバージョン記憶用エリア											*
 * L6713-13P(L8152-A) 0													*
 * L6713-14P(L8153-?) 1													*
 * 1996/10/04															*
 * 木元  修																*
 ************************************************************************/
/* Added by H. Kubo 1997/07/02 for R288F modem. */
UBYTE SYS_ModemVersion = 0;

/* Added by H. Kubo 1997/07/02 for R288F modem. */
UBYTE SYS_DetectABCODE_Flag = 0;
UBYTE SYS_V8DetectATV25Flag = 0;
UBYTE SYS_V34ProcedureExecutingFlag = 0;		/* Ｖ３４モード実行中フラグ */

/***********************************************************************
工場ファンクション用データ
1997/12/05 H.Kubo
************************************************************************/
#if (PRO_MODEM == R288F) || (PRO_MODEM == MN195006)/* 1997/12/10 by H.Kubo */
UBYTE	SYS_FactoryFuncReq = 0;
UBYTE	SYS_FactoryFuncStatus = 0;
#endif
#endif /* (PRO_MODEM == R288F)*/
#if (PRO_TX_SPEED == V34) /* Added by H.Kubo 1997\07/24 */
/************************************************************************
 * モデムのリソース														*
 * 96/01/18																*
 * Y.Murata																*
 ************************************************************************/
UWORD	SYS_DataSignalingRate = 0x0001; /* Added by H.Kubo 1997/07/24 */
#endif /* (PRO_TX_SPEED == V34) */

#if (PRO_LINENUMBER == TWICE_LINE)
/************************************************************************
 * ＰＯＰＬＡＲ＿Ｈにおいて、どちらの回線で通信を行っているかを			*
 * 記憶しておく変数														*
 * 1997/11/01															*
 * O.Kimoto																*
 ************************************************************************/
UBYTE SYS_InternalLineNumber = 0;
UBYTE SYS_InternalLineNumberSave = 0;	/* 追加 by T.Soneoka 1998/03/11 */
#if defined (KEISATSU) /* 警察FAX Added by SMuratec 李 2005/07/14 */
/************************************************************************
 * 警察FAXにおいて、どちらの回線で呼出を行っているかを			*
 * 記憶しておく変数														*
 * 2005/07/14															*
 * SMuratec 李 															*
 ************************************************************************/
UBYTE SYS_CalledLineNumber = 0;
#endif /* defined (KEISATSU) */
#endif


#if (PRO_VOICE_ANSWER == ENABLE)	/* 1998/02/05  By T.Yamaguchi */
/************************************************************************
 * 音声応答送出中,FhaseB1中を示す変数
 ************************************************************************/
UBYTE   SYS_VoiceTxFlag = 0;
UBYTE   SYS_PhaseB1Flag = 0;
UBYTE	SYS_FaxMelodyFlag = 0;
UBYTE   SYS_PhaseB1StopWaitFlag = 0;
UBYTE   SYS_Busy_detecting = 0;	/* 98/03/15 */
#endif


#if defined(ANZU_L)
/* ＤＰＲＡＭデバック用変数 Y.Murata*/
UWORD	abcdefg = 0;
UBYTE	dpr_testdata1[5] = {0};		/* 偶数アドレス byte*/
UBYTE	dpr_testdata2[5] = {0};		/* 奇数アドレス byte*/
UBYTE	dpr_testdata3[5] = {0};		/* 偶数アドレス byte*/
UWORD	dpr_testdata4[5] = {0};		/* 偶数アドレス word*/
UWORD	dpr_testdata5[5] = {0};		/* 偶数アドレス word*/
UBYTE	dpr_testdata6[6] = {0};		/* 偶数アドレス byte*/
UBYTE	dpr_testdata7[6] = {0};		/* 偶数アドレス byte*/
UBYTE	aaaaaaaa = 0;
UBYTE	dpr_testdata8[6] = {0};		/* 奇数アドレス byte*/

#endif

UBYTE SYS_TimerJobSelectSwitch = 0; /* インターバルタイマ処理切替えスイッチ T.Nose 1998/01/20 */


#if (PRO_DIALUP_INTERNET_FAX == ENABLE) /*ﾀﾞｲｱﾙｱｯﾌﾟ型ｲﾝﾀｰﾈｯﾄFAX用ﾃﾞｰﾀ追加 */
										/*1998/04/03 Eguchi */
UBYTE	SYS_INF_ExecuteIFAX = 0;
UBYTE	SYS_INF_PSTN_AccessReq = 0;
#endif


#if (PRO_MODEM == R288F) || (PRO_MODEM == MN195006)/* Added by H.Kubo 1997/07/19 */
/* 日立特許回避（ＣＥＤ検出） By O.Kimoto 1998/04/15 */
/************************************************************************
 * 10msタイマー															*
 * 1994/01/07															*
 * 吉川弘康																*
 ************************************************************************/
	UWORD SYS_ToneCheckTimer = 0;
	UWORD AfterToneCheckStartTimer = 0;
	UWORD AfterToneCheckTime = 0;

#endif

#if (PRO_PRINT_TYPE == THERMAL_TRANS)
UBYTE	SYS_PrinterPreOpenRequest = 0;
#endif

#if (PRO_PRINT_TYPE == THERMAL_TRANS) || (PRO_PRINT_TYPE == THERMAL)	/* THERMAL追加 By O.Kimoto 1998/12/01 */
/************************************************************************
 * SCN・PRNのDual動作制御変数			     							*
 * UBYTE SYS_PRN_StopRequest											*
 *		SCNからPRNへの指示で、プリントを停止させたい時にTRUEにする 		*
 * UBYTE SYS_SCN_StartRequest											*
 *		PRNからSCNへの指示で、SYS_PRN_StopRequestを認識したので、		*
 *		読み取りを開始してもよい時にTRUEにする							*
 * 1998/09/09															*
 * H.Yoshikawa															*
 ************************************************************************/
UBYTE SYS_PRN_StopRequest = 0;
UBYTE SYS_SCN_StartRequest = 0;

/************************************************************************
 * SCN・プリンタ受信PRNのDual動作制御変数								*
 * UBYTE SYS_SCN_StopRequest											*
 *		PRNからSCNへの指示で、読み取りを停止させたい時にTRUEにする		*
 * UBYTE SYS_PRN_StartRequest											*
 *		SCNからPRNへの指示で、SYS_SCN_StopRequestを認識したので、		*
 *		プリントを開始してもよい時にTRUEにする							*
 * プリンタ受信有効・無効設定が有効のときのみ使用する					*
 * SCN_PRN_StopRequest/SYS_SCN_StartRequestより優先的に処理する			*
 * 1999/02/24															*
 * H.Yoshikawa															*
 ************************************************************************/
UBYTE SYS_SCN_StopRequest = 0;	/* 1999.3.30 K.Kawata */
UBYTE SYS_PRN_StartRequest = 0;

/************************************************************************
 * MDM・PRNのDual動作制御変数			     							*
 * UBYTE SYS_PRN_StopRequest											*
 *		MDMからPRNへの指示で、プリントを停止させたい時にTRUEにする 		*
 * 1998/10/26															*
 * H.Kubo 																*
 ************************************************************************/
UBYTE SYS_PRN_StopRequestFromModem = 0;
#endif

#if (PRO_MINOLTA_TEST_FUNC == ENABLE)	/* 1998/05/12 Y.Murata */
	struct	SYS_MinoltaTestFuncData_t	SYS_MinoltaTestFuncData[SYS_MINOLTA_TEST_FUNC_MAX] = {0};
	UWORD	SYS_MinoltaFuncIntervalTimer = 0;
	UWORD	SYS_MinoltaFuncInputData = 0;
	UWORD	SYS_MinoltaFuncPagesData = 0;	/* 1998/07/21 Y.Matsukuma */
#endif

/* 移植 by SMuratec K.W.Q 2003/07/23 */
/*#if (PRO_KEYPANEL == PANEL_HINOKI)*/
#if (PRO_KEYPANEL == PANEL_HINOKI) || (PRO_KEYPANEL == PANEL_SATSUKI2)  || (PRO_KEYPANEL == PANEL_STOCKHM2)	/* Add by Y.Kano 2003/07/11 */

/*---------------------------------------------------------------------------------------
 * CPUの出力ポート状態保存RAM
 *--------------------------------------------------------------------------------------*/
UWORD PortEStatus = 0; 		/* LED/LCD/RTC等の出力ポート状態保存RAM */
UWORD PortAStatus = 0;		/* RS232C RTSポート状態保存RAM */
/*---------------------------------------------------------------------------------------
 * G/Aの出力ポート状態保存RAM
 *--------------------------------------------------------------------------------------*/
UWORD	RelayPortStatus = 0;
UWORD	GA_IntMaskStatus = 0;
UWORD	GA_MWR_Status = 0;
UWORD	GaPstartStatus = 0;
UWORD	GaTmr0Status = 0;
UWORD	GaTmr1Status = 0;
UWORD	GaRmrStatus = 0;
UWORD	GaTphStatus = 0;
UWORD	GaPrtcStatus = 0;

UDWORD IntTimerCounter = 0;	/* 2.5ms割込みを5msに見せかけるカウンタ */
UBYTE PrintSkipFlag = 0; /* 1999/1/21 add by T.Soneoka */

#endif

#if	(PRO_PRINT_TYPE == THERMAL)
/*---------------------------------------------------------------------------------------
 * ノン・ソート管理データ
 *--------------------------------------------------------------------------------------*/
struct NonSortCopyData NonSortCopyFile = {0};
/*---------------------------------------------------------------------------------------
 * リアルタイム・コピー管理データ
 *--------------------------------------------------------------------------------------*/
struct RealTimeCopyData RealTimeCopyFile = {0};
#endif


#if (PRO_QUICK_TX_TEST == ENABLE)	/* 1998/10/16 Y.Murata for KAKI */
UWORD	SYS_QucikTxStopQueueNo = 0;
UWORD	SYS_QucikTxStopStatus = 0;
#endif

/*---------------------------------------------------------------------------------------
 * 現在の通信のナンバーディスプレイ着信履歴上での位置
 *--------------------------------------------------------------------------------------*/
#if (PRO_NUMBER_DISPLAY == ENABLE) /* added by H.Kubo 1998/10/16 */
UBYTE	SYS_ND_CurrentJournalPoint = 0;
#endif

#if (PRO_PRINT_TYPE == THERMAL) /* HINOKI */
/************************************************************************
 * 一時退避用PS1ポ－ト・ステ－タス										*
 * PS2ポ－ト・ステ－タス												*
 * 94/1/7																*
 * S.Kawasaki															*
 ************************************************************************/
UBYTE	NewPS2 = 0;
UBYTE	OldPS2 = 0;
#endif

/*
** 受信中の原稿蓄積を制限するための、受信中 or 原稿蓄積中を表わすステータス
** added by H.Hirao 1998/12/26
*/
#if (PRO_IMAGE_PROCESSOR == IMAGE_PROCESSOR_LC82103)
UBYTE	SYS_DualRestrictionStatus = 0;
UBYTE	SYS_CalledRequestForDocStore = 0;	/* 原稿蓄積中のＣＩ検出中 added by H.Hirao 1998/12/28 */
UBYTE	SYS_StorePause = 0;	/* 原稿蓄積停止中 1999/1/14 by T.Soneoka */
UBYTE	SYS_ForcedMemoryOverMsg = 0; /* 1999/02/24 by T.Soneoka */
UBYTE	AD_PS2_Value = 0;	/* 1999/04/13 by T.Soneoka */
#endif

#if defined (SATSUKI2) || defined(STOCKHM2) || defined(HINOKI2) || defined (HINOKI3)	/* Add by Y.Kano 2004/01/14 */
UBYTE	AD_PS1_Value = 0;
UBYTE	AD_PB4_Value = 0;
#endif

#if (PRO_FAX_AND_1COPY == ENABLE)
UBYTE	SYS_FaxAnd1CopyEnable = 0;	/* 1999/02/18 H.Yoshikawa */
#endif

#if (PRO_MULTI_T30_MONITOR == ENABLE) /* By H.Fujimura 1999/04/09 */
struct	SYS_T30MonitorData_t *SYS_T30Monitor = {0};
#endif

#if defined(POPLAR_F)
UBYTE	SYS_ContPollingValiableTimer = 0;
#endif

#if (PRO_ENERGY_SAVE == ENABLE)		/* 2001/11/28 T.Takagi */
UBYTE	SYS_ShadingDataSet = 0;
UBYTE	SYS_HaltClock = 0;
UBYTE	SYS_MakingShadingData = 0;	/* 2001/12/3 T.Takagi */
/* UWORD	SYS_24V_OffTimer = 0; */		/* 2002/11/28 T.Takagi */
#endif

#if (PRO_RED_SCAN == ENABLE)	/* 朱色原稿読み取り 2002/03/04 T.Takagi */
UBYTE	SYS_IsRedShading = 0;
#endif

#if 0 /* defined (HINOKI2) */	/* LCDドライバ変更対応 2002/05/15 T.Takagi */
UBYTE	SYS_IsCGRAM_Writing = 0;
UBYTE	SYS_IsDisplayingLCD = 0;
#endif

#if (PRO_ENERGY_SAVE_PPF == ENABLE)/*V851 省エネBy Y.Suzuki 2002/06/18*/
/************************************************************************
 * 省エネ関連
 ************************************************************************/
UBYTE	SYS_AutoPowerSW = 0;
UBYTE	SYS_EcoModeStatus = 0;
UBYTE	SYS_NewEcoModeStatus = 0;
UBYTE	SYS_OldEcoModeStatus = 0;
UWORD	SYS_EcoModeTimer = 0;
UBYTE	SYS_SensorDetectInhibit = 0;
UBYTE	SYS_EcoResetKeyInput = 0;
#endif

#if (defined(POPLAR_H) && defined(JP0)) /* V851 チェッカー By H.Fujimura 2002/07/15 */
/*************************************************************************
 * チェッカモード
 *************************************************************************/
UBYTE	SYS_CheckerMode = 0;
#endif

#if (PRO_ECO_MODE == ENABLE) /* 2002/09/09 By M.Maeda */
/************************************************************************
 * 省エネ関連
 ************************************************************************/
UBYTE	SYS_EcoModeStatus = 0;
#endif

#if (PRO_KEYPANEL == PANEL_SATSUKI2)  || (PRO_KEYPANEL == PANEL_STOCKHM2) || defined(HINOKI3)	/* Add by Y.kano 2003/09/01 */ /* Add by Y.Kano 2004/12/21 */
/************************************************************************
 * キータッチオペレーション関連
 ************************************************************************/
UBYTE	SYS_KeyTouchFrequencySetting = 0;	/* キータッチ音色設定オペレーション中判別フラグ */
UBYTE	SYS_AckBuzzerFlag = 0;				/* AckBuzzerをONに */

/*************************************************************************
 * チェッカモード Added by SMuratec K.W.Q 2003/08/26
 *************************************************************************/
UBYTE	SYS_CheckerMode = 0;
#endif

#if defined(STOCKHM2) || (PRO_JOURNAL_VER_UP == ENABLE)	/* Added by SMuratec C.P 2004/06/07 *//* by K.Watanabe 2004/10/14 */
UBYTE	SYS_JournalPrintType = 0;
#endif

#if defined(STOCKHM2)	/* Added by SMuratec C.P 2004/06/07 */
UBYTE	SYS_ConfirmTxRxFlag  = 0; /* DVT : add by SMuratec C.P 2004/09/08 */
UBYTE	SYS_IsCallingBuzzer	 = 0;/* 本体鳴動のテスト :by SMuratec C.P 2004/09/24 呼び出しブザー */
#endif

#if defined (KEISATSU) /* 警察FAX Added by SMuratec 李 2005/07/28 */
UBYTE	SYS_LineTelStatus	 = 0;	/* ２回線秘話機能用 */
/* 警察FAX (ナンバーディスプレイ) Added by SMuratec 李 2005/10/20 */
UBYTE	SYS_LineNDStatus	 = 0;	/* ２回線ナンバーディスプレイ機能用 */
/* 警察FAX (ナンバーディスプレイ) Added by SMuratec 李 2005/10/26 */
CONST	UBYTE	DEBUG_NumberDisplay = 0;
#endif /* defined (KEISATSU) */
/*これより上に登録してください*/

#pragma section
