/************************************************************************
*	System		: POPLAR/ANZU-L
*	File Name	: CMN_TMR.C
*	Author		: 橘正樹
*	Date		: 1997/02/19
*	RealTimeOS	: ＲＩＳＣ（ＳＨ７０４３）モニタ
*	Description	: ＭＴＵ起動処理
*	Maintenance	:
*
*	Copyright (C) 1997 Murata Machienry,Ltd. All rights reserved.
*************************************************************************/
#include "\src\atlanta\define\product.h"
#include "\src\atlanta\define\cmn_pro.h"
#include "\src\atlanta\sh7043\define\sh_sys.h"


/*************************************************************************
	module		:[プリンタワンショットタイマの起動]
	function	:[
		1.ＭＴＵチャネル２を起動する
	]
	return		:[なし]
	common		:[]
	condition	:[]
	comment		:[]
	machine		:[SH7043]
	language	:[SHC(Ver.3.0C)]
	keyword		:[PRN]
	date		:[1997/02/19]
	author		:[橘正樹]
*************************************************************************/
void CMN_SetupPrintOneshotTimer(void)
{
	/*------------------------------------------------------------------
	** ＰＥＣＲ２:0xFFFF83BA  0x4000(PE7MD) ＭＴＵアウトプットコンペア出力:1
	** ＰＥＤＲ  :0xFFFF83B0　0x0080(PE7DR) 出力値:1
	*/

	/*------------------------------------------------------------------
	** ＣＰＵのイニシャルの時に行うとポートがＯＦＦのままになるので
	** ＶＳＹＮＣを検出した状態になり
	** プリンタの割り込みが入り続ける（ＰＧＥＮＤ）
	** ＣＰＵのイニシャルの設定ではポートを汎用入出力にしておく
	*/
	PFC__PECR2 |= PECR2_PE7MD_TIOC2B;

	/*------------------------------------------------------------------*/
	/* ＴＳＴＲの設定													*/
	/* ・カウンターの停止												*/
	/* ・予約ビット５～３は常に０をセット								*/
	/*------------------------------------------------------------------*/
	MTU__TSTR &= ~TSTR_START_CH2;
	/*------------------------------------------------------------------*/
	/* ＴＣＲの設定														*/
	/* ・ＧＲＢのコンペアマッチ／インプットキャプチャでＴＣＮＴクリア	*/
	/* ・立上がりエッジでカウント										*/
	/* ・内部クロック２８ＭＨｚ÷１６＝５７１．４３ｎｓ					*/
	/* ・予約ビット７は１又は０をセット									*/
	/*------------------------------------------------------------------*/
	MTU__TCR2 = 0x42;
	/*------------------------------------------------------------------*/
	/* ＴＭＤＲの設定													*/
	/* ・ＴＧＲＢは通常動作												*/
	/* ・ＴＧＲＡは通常動作												*/
	/* ・ＭＴＵチャネル２は通常動作モード								*/
	/* ・予約ビット７は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TMDR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＩＯＲ２の設定            										*/
	/* ・ＧＲＡコンペアマッチによる端子出力禁止							*/
	/* ・ＧＲＢコンペアマッチ（初期値０ コンペアマッチで１出力）		*/
	/*------------------------------------------------------------------*/
	MTU__TIOR2 = 0x20;
	/*------------------------------------------------------------------*/
	/* ＴＩＥＲの設定													*/
	/* ・コンペアマッチ割込み禁止（ＴＧＢＡ／ＴＧＩＢ）					*/
	/* ・予約ビット６は１をセット										*/
	/* ・予約ビット５は０をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TIER2 = 0x40;
	/*------------------------------------------------------------------*/
	/* ＴＳＲの設定														*/
	/* ・ＴＣＮＴアップカウンタ											*/
	/* ・予約ビット６は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TSR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＣＮＴのクリア													*/
	/*------------------------------------------------------------------*/
	MTU__TCNT2 = 0;
	/*------------------------------------------------------------------*/
	/* ＴＧＲの設定														*/
	/* ・カウンター値の設定												*/
	/*   １０ｍｓ÷５７１．４３ｎｓ ＝ １７５００（０ｘ４４５Ｃ）カウント */
	/*------------------------------------------------------------------*/
	MTU__TGR2B = 0x445C;
	/*------------------------------------------------------------------*/
	/* ＭＴＵ２の割込みをレベルＦへセット								*/
	/* １５～１２ビット													*/
	/*------------------------------------------------------------------*/
/*	SH__IPRE |= MTU2H_LEVEL;	*/

	return;
}

/*************************************************************************
	module		:[プリンタワンショットタイマの起動]
	function	:[
		1.ＭＴＵチャネル２を起動する
	]
	return		:[なし]
	common		:[]
	condition	:[]
	comment		:[]
	machine		:[SH7043]
	language	:[SHC(Ver.3.0C)]
	keyword		:[PRN]
	date		:[1997/02/19]
	author		:[橘正樹]
*************************************************************************/
void CMN_StartPrintOneshotTimer(void)
{
	/*------------------------------------------------------------------
	** ＣＰＵのイニシャルの時に行うとポートがＯＦＦのままになるので
	** ＶＳＹＮＣを検出した状態になり
	** プリンタの割り込みが入り続ける（ＰＧＥＮＤ）
	** ＣＰＵのイニシャルの設定ではポートを汎用入出力にしておく
	*/
	PFC__PECR2 |= PECR2_PE7MD_TIOC2B;

	MTU__TSTR &= ~TSTR_START_CH2;	/* チャネル２カウント停止 */
	MTU__TSR2 &= ~0x02;				/* TGFBのクリア */
	MTU__TCNT2 = 0;					/* TCNTのクリア */

	/*------------------------------------------------------------------*/
	/* ＴＣＲの設定														*/
	/* ・ＧＲＢのコンペアマッチ／インプットキャプチャでＴＣＮＴクリア	*/
	/* ・立上がりエッジでカウント										*/
	/* ・内部クロック２８ＭＨｚ÷１６＝５７１．４３ｎｓ					*/
	/* ・予約ビット７は１又は０をセット									*/
	/*------------------------------------------------------------------*/
	MTU__TCR2 = 0x42;
	/*------------------------------------------------------------------*/
	/* ＴＭＤＲの設定													*/
	/* ・ＴＧＲＢは通常動作												*/
	/* ・ＴＧＲＡは通常動作												*/
	/* ・ＭＴＵチャネル２は通常動作モード								*/
	/* ・予約ビット７は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TMDR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＩＯＲ２の設定            										*/
	/* ・ＧＲＡコンペアマッチによる端子出力禁止							*/
	/* ・ＧＲＢコンペアマッチ（初期値０ コンペアマッチで１出力）		*/
	/*------------------------------------------------------------------*/
	MTU__TIOR2 = 0x20;
	/*------------------------------------------------------------------*/
	/* ＴＩＥＲの設定													*/
	/* ・コンペアマッチ割込み禁止（ＴＧＢＡ／ＴＧＩＢ）					*/
	/* ・予約ビット６は１をセット										*/
	/* ・予約ビット５は０をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TIER2 = 0x40;
	/*------------------------------------------------------------------*/
	/* ＴＳＲの設定														*/
	/* ・ＴＣＮＴアップカウンタ											*/
	/* ・予約ビット６は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TSR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＧＲの設定														*/
	/* ・カウンター値の設定												*/
	/*   １０ｍｓ÷５７１．４３ｎｓ ＝ １７５００（０ｘ４４５Ｃ）カウント */
	/*------------------------------------------------------------------*/
	MTU__TGR2B = 0x445C;

	/*------------------------------------------------------------------*/
	/* ＴＳＴＲの設定													*/
	/* ・カウンターのスタート											*/
	/* ・予約ビット５～３は常に０をセット								*/
	/*------------------------------------------------------------------*/
	MTU__TSTR |= TSTR_START_CH2;

	return;
}

/*************************************************************************
	module		:[プリンタワンショットタイマの停止]
	function	:[
		1.ＭＴＵチャネル２を停止する
	]
	return		:[なし]
	common		:[]
	condition	:[]
	comment		:[]
	machine		:[SH7043]
	language	:[SHC(Ver.3.0C)]
	keyword		:[PRN]
	date		:[1997/02/19]
	author		:[橘正樹]
*************************************************************************/
void CMN_StopPrintOneshotTimer(void)
{
	MTU__TSTR &= ~TSTR_START_CH2;	/* カウント停止 */
	MTU__TSR2 &= ~0x02;				/* TGFBのクリア */
	MTU__TCNT2 = 0;					/* TCNTのクリア */

	return;
}


#if (PRO_MODEM == R288F) || (PRO_MODEM == MN195006) /* Ecm Tx のフレーム間フラグ送出時の待ち時間生成用 by H.Kubo 1999/01/25 */
/*************************************************************************
	module		:[モデム用タイマ]
	function	:[
		1.ＭＴＵチャネル３
	]
	return		:[なし]
	common		:[]
	condition	:[]
	comment		:[]
	machine		:[SH7043]
	language	:[SHC(Ver.3.0C)]
	keyword		:[MDM]
	date		:[1999/01/25]
	author		:[久保博]
*************************************************************************/
void CMN_ModemWait100microSec(UWORD time)
{
	if (time >= 100) {
		SaveReturnAddressAndJumpBegin(); /* 10ms 以上の待ちは wai_tsk を使うべし。*/
		return;
	}
#if (PRO_PRINT_TYPE == THERMAL) || (PRO_PRINT_TYPE == THERMAL_TRANS) /* HINOKI では Ch3 をブザーで使ってました。ごめんなさい。Changed by H.Kubo 1999/01/30 */
	/* プリンタが PH3 の機種では Ch2 はプリンタ用ワンショット割り込みに使用しています。気をつけてください。 */
	MTU__TSTR &= ~TSTR_START_CH2;	/* チャネル２カウント停止 */
	MTU__TCNT2 = 0;					/* TCNTのクリア */

	/*------------------------------------------------------------------*/
	/* ＴＣＲの設定														*/
	/* ・立上がりエッジでカウント										*/
	/* ・内部クロック２８ＭＨｚ÷１６＝１７５０ｋＨｚ			*/
	/* ・すなわち ０．５７１４２８ μsec/cycle							*/
	/*------------------------------------------------------------------*/
	MTU__TCR2 = 0x02;
	/*------------------------------------------------------------------*/
	/* ＴＭＤＲの設定													*/
	/* ・ＴＧＲＢは通常動作												*/
	/* ・ＴＧＲＡは通常動作												*/
	/* ・ＭＴＵチャネル２は通常動作モード								*/
	/* ・予約ビット７，６は１をセット									*/
	/*------------------------------------------------------------------*/
	MTU__TMDR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＩＯＲ２の設定            										*/
	/* ・ＧＲＡ，ＧＲＢコンペアマッチによる端子出力禁止					*/
	/*------------------------------------------------------------------*/
	MTU__TIOR2 = 0x00;
	/*------------------------------------------------------------------*/
	/* ＴＩＥＲの設定													*/
	/* ・コンペアマッチ割込み禁止（ＴＧＢＡ／ＴＧＩＢ）					*/
	/* ・予約ビット６は１をセット										*/
	/* ・予約ビット５は０をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TIER2 = 0x40;
	/*------------------------------------------------------------------*/
	/* ＴＳＲの設定														*/
	/* ・ステータスフラグはクリア										*/
	/* ・ＴＣＮＴアップカウンタ											*/
	/* ・予約ビット６は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TSR2 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＧＲの設定														*/
	/* ・カウンター値の設定												*/
	/*------------------------------------------------------------------*/
	if (time == 0) {
		MTU__TGR2A = 87; /* 50 us の設定  */
	}
	else {
		MTU__TGR2A = 175 * time; /* time [100us] * 175 で分周比16のときのカウンタの値 */
	}
	/*------------------------------------------------------------------*/
	/* ＴＳＴＲの設定													*/
	/* ・カウンターのスタート											*/
	/* ・予約ビット５～３は常に０をセット								*/
	/*------------------------------------------------------------------*/
	MTU__TSTR |= TSTR_START_CH2;

	while (!(MTU__TSR2 & 0x01)) {
		/* タイムアップまで待つ */
	}

	MTU__TSTR &= ~TSTR_START_CH2;	/* チャネル３カウント停止 */
#else
	/* HINOKI では Ch3 がブザー用タイマーです。 */
	MTU__TSTR &= ~TSTR_START_CH3;	/* チャネル３カウント停止 */
	MTU__TCNT3 = 0;					/* TCNTのクリア */

	/*------------------------------------------------------------------*/
	/* ＴＣＲの設定														*/
	/* ・立上がりエッジでカウント										*/
	/* ・内部クロック２８ＭＨｚ÷１６＝１７５０ｋＨｚ			*/
	/* ・すなわち ０．５７１４２８ μsec/cycle							*/
	/*------------------------------------------------------------------*/
	MTU__TCR3 = 0x02;
	/*------------------------------------------------------------------*/
	/* ＴＭＤＲの設定													*/
	/* ・ＴＧＲＢは通常動作												*/
	/* ・ＴＧＲＡは通常動作												*/
	/* ・ＭＴＵチャネル３は通常動作モード								*/
	/* ・予約ビット７，６は１をセット									*/
	/*------------------------------------------------------------------*/
	MTU__TMDR3 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＩＯＲ３の設定            										*/
	/* ・ＧＲＡ，ＧＲＢコンペアマッチによる端子出力禁止					*/
	/*------------------------------------------------------------------*/
	MTU__TIOR3H = 0x00;
	MTU__TIOR3L = 0x00;
	/*------------------------------------------------------------------*/
	/* ＴＩＥＲの設定													*/
	/* ・コンペアマッチ割込み禁止（ＴＧＢＡ／ＴＧＩＢ）					*/
	/* ・予約ビット６は１をセット										*/
	/* ・予約ビット５は０をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TIER3 = 0x40;
	/*------------------------------------------------------------------*/
	/* ＴＳＲの設定														*/
	/* ・ステータスフラグはクリア										*/
	/* ・ＴＣＮＴアップカウンタ											*/
	/* ・予約ビット６は１をセット										*/
	/*------------------------------------------------------------------*/
	MTU__TSR3 = 0xC0;
	/*------------------------------------------------------------------*/
	/* ＴＧＲの設定														*/
	/* ・カウンター値の設定												*/
	/*------------------------------------------------------------------*/
	if (time == 0) {
		MTU__TGR3A = 87; /* 50 us の設定  */
	}
	else {
		MTU__TGR3A = 175 * time; /* time [100us] * 175 で分周比16のときのカウンタの値 */
	}
	/*------------------------------------------------------------------*/
	/* ＴＳＴＲの設定													*/
	/* ・カウンターのスタート											*/
	/* ・予約ビット５～３は常に０をセット								*/
	/*------------------------------------------------------------------*/
	MTU__TSTR |= TSTR_START_CH3;

	while (!(MTU__TSR3 & 0x01)) {
		/* タイムアップまで待つ */
	}

	MTU__TSTR &= ~TSTR_START_CH3;	/* チャネル３カウント停止 */
#endif
	return;
}
#endif
